<template>
  <div class="rule">
    <div class="tabs">
      <span :class="{act:type==1}" @click="tabClick(1)">活動獎勵</span>
      <span :class="{act:type==2}" @click="tabClick(2)">活動規則</span>
    </div>
    <div class="actTime">活動時間：{{timer}}</div>
    <div class="ruleItem" v-if="type==1">
      <h3>名星誕生榜獎勵</h3>
      <h6>第1名家族</h6>
      <p>1.所有家族成員獎勵名星家族徽章（1個月）</p>
      <p>2.家族等級積分10000+K房人數上限提升至200人（永久）</p>
      <p>3.所有家族成員獎勵500金豆</p>
      <p>4.名星誕生榜家族星光值前10名：</p>
      <p>第1名：夢幻超跑*1（3488金幣/個）+1000金幣+2000金豆+赤道極光座駕（30天）</p>
      <p>第2名：粉色摩天輪*1（1520金幣/個）+800金幣+1000金豆+赤道極光座駕（30天）</p>
      <p>第3名：爲你打call*1（888金幣/個）+500金幣+500金豆+赤道極光座駕（30天）</p>
      <p>第4-10名：家族禮炮*1（555金幣/個）+200金幣+500金豆+赤道極光座駕（30天）</p>
      <h6>第2名家族</h6>
      <p>1.所有家族成員獎勵名星家族徽章（1個月）</p>
      <p>2.家族等級積分8000+K房人數上限提升至200人（永久）</p>
      <p>3.所有家族成員獎勵500金豆</p>
      <p>4.名星誕生榜家族星光值前10名：</p>
      <p>第1名：粉色摩天輪*1（1520金幣/個）+800金幣+1000金豆+赤道極光座駕（30天）</p>
      <p>第2名：爲你打call*1（888金幣/個）+500金幣+500金豆+赤道極光座駕（30天）</p>
      <p>第3名：家族禮炮*1（555金幣/個）+200金幣+500金豆+赤道極光座駕（30天）</p>
      <p>第4-10名：爲你撐腰*1（299金幣/個）+200金幣+500金豆+赤道極光座駕（30天）</p>
      <h6>第3名家族</h6>
      <p>1.所有家族成員獎勵名星家族徽章（1個月） </p>
      <p>2.家族等級積分5000+K房人數上限提升至200人（永久）</p>
      <p>3.所有家族成員獎勵300金豆</p>
      <p>4.名星誕生榜家族星光值前10名：</p>
      <p> 第1名：爲你打call*1（888金幣/個）+800金幣+1000金豆+赤道極光座駕（30天）</p>
      <p> 第2名：家族禮炮*1（555金幣/個）+500金幣+500金豆+赤道極光座駕（30天）</p>
      <p>第3名：爲你撐腰*1（299金幣/個）+200金幣+500金豆+赤道極光座駕（30天）</p>
      <p>第4-10名：家族之星*1（233金幣/個）+200金幣+500金豆+赤道極光座駕（30天）</p>
      <h6>第4-10名家族</h6>
      <p>1.所有家族成員獎勵名星家族徽章（1個月）</p>
      <p>2.家族等級積分2000+K房人數上限提升至150人（永久）</p>
      <p>3.所有家族成員獎勵200金豆</p>
      <p>4.名星誕生榜家族星光值前10名：</p>
      <p>第1名：家族禮炮*1（555金幣/個）+800金幣+500金豆+赤道極光座駕（30天）</p>
      <p>第2名：爲你撐腰*1（299金幣/個）+500金幣+500金豆+赤道極光座駕（30天）</p>
      <p>第3名：家族之星*1（233金幣/個）+200金幣+500金豆+赤道極光座駕（30天）</p>
      <p>第4-10名：家族之星*1（233金幣/個）+100金幣+500金豆</p>
      <h3>家族守護榜獎勵</h3>
      <p>第1名：5%儲值返利券（1天）+赤道極光座駕（30天）+守護達人徽章（30天）+10000金豆</p>
      <p>第2名：4%儲值返利券（1天）+赤道極光座駕（30天）+守護達人徽章（30天）+5000金豆</p>
      <p>第3名：3%儲值返利券（1天）+赤道極光座駕（30天）+守護達人徽章（30天）+3000金豆</p>
      <p>第4-10名：守護達人徽章（30天）+2000金豆</p>
      <h3>家族禮包獎勵</h3>
      <img src="../../assets/img/giftImg.png" alt="" class="giftBox">
      <p class="giftTIps">所有背包獎勵由系統隨機發放，表格僅展示部分稀有獎勵</p>
      <h3 class="other">備註：</h3>
      <p>1、名星誕生榜晉級家族成員不足10位則多餘獎勵視為無效</p>
      <p>2、家族積分已達到滿值則該獎項視為無效</p>
      <p>3、K房人數上限提升自獎勵發放之日起計算</p>
      <p>4、活動結束後7個工作日內工作人員將聯繫家族長統計獎勵資訊，逾期未提交視為自動放棄</p>
      <p>5、家族成員資訊統計於活動截止時為準，獎勵於活動結束後7個工作日內發放</p>
      <p>6、活動所有背包獎勵有效期為7天，請及時使用！</p>
    </div>
    <div class="wardItem" v-else>
      <h3>活動規則</h3>
      <p>家族名星賽分爲三個賽程：星光閃耀—眾星爭輝—名星誕生，活動僅限家族用戶報名參與</p>
      <h3>星光閃耀</h3>
      <p>1、比賽時間：<em class="tm">10月16日12:00-10月20日22:00</em> </p>
      <p>2、家族用戶點擊報名即可參與活動，星光值=作品+K房收禮金幣魅力值，星光總榜前500名可代表家族晉級</p>
      <p>3、星光日榜依據當日星光值排名，前100名可參與抽獎，每天抽送20個星光閃耀背包禮物（68金幣/個），日榜中獎概率=當日星光值/前100名總星光值</p>
      <p>4、星光閃耀期間退出家族則榜單數據清除，不參與抽獎，重新加入家族重新累計星光值</p>
      <h3>眾星爭輝</h3>
      <p>
        1、比賽時間：<em class="tm">10月20日22:05-10月24日18:00</em><br />
        2、同一家族晉級者組成團隊，代表家族參與PK，PK雙方（隨機匹配）依據總星光值判定勝負，勝方晉級並獲得家族大禮包獎勵，星光值=作品+K房收禮金幣魅力值<br />
        3、賽段結束時分數相同PK雙方將同時淘汰，PK失敗但總星光值大於等於30萬也可晉級<br />
        4、晉級用戶退出家族總星光值不扣減，再次加入家族時保留退出前數據可繼續累計，加入其他家族則視為未晉級，無法繼續參與活動<br />
        5、每個家族大禮包含獎勵30份，每人最多獲得1份，賽段結束時向晉級家族自動派發
      </p>
      <h3>名星誕生</h3>
      <p>1、比賽時間：<em class="tm">10月24日18:05-10月25日22:00</em> <br />
        2、星光值=作品+K房收禮金幣魅力值，10月25日20-22點獲得10%加成<br />
        3、晉級家族依據總星光值排名，前十名家族和家族代表成為家族名星，獲得豐厚獎勵<br />
        4、總星光值達到指定數值則家族升級，升級時系統自動發放大禮包，Ⅰ、Ⅱ、Ⅲ級對應星光值分別為1萬、10萬、50萬，禮包獎勵份數分別為30、50、100份（所有禮包獎勵自動發放，家族中星光值越高的用戶獲得稀有獎勵的概率越大）<br />
        5、晉級用戶退出家族總星光值不扣減，再次加入家族時保留退出前數據可繼續累計，加入其他家族則視為未晉級，無法繼續參與活動
      </p>
      <h3 class="other">備註</h3>
      <p>
        1、家族守護榜依據活動期間為報名用戶贈送金幣禮物魅力值排名，前10名可獲得豐厚獎勵，榜單分數相同則先到達者排名靠前<br />
        2、家族大禮包獎勵發放詳情展示在開獎明細中，可點擊查看<br />
        3、星光閃耀賽段日榜獎勵每日24點發放，最後一天於22點發放<br />
        4、報名活動后，星光閃耀和眾星爭輝賽段中會自動開始計算作品收禮星光值，無需上傳作品；<br />
        5、名星誕生參賽作品需為10月24日12:00:00後發佈的任意公開作品(清唱5分鐘除外)，可上傳多首作品參賽，報名後作品收禮才會被計算<br />
        6、所有禮包獎勵自動發放，家族中星光值越高的用戶獲得稀有獎勵的概率越大，每人每次最多可獲得1份獎勵，當家族人數少於禮包中的獎勵數時，多餘的獎勵視為無效<br />
        7、活動期間如有任何刷分行為，將取消參賽資格和獎勵，嚴重者封號處理
      </p>
    </div>
    <p class="lastTips">活動最終解釋權歸主辦方所有</p>
  </div>
</template>

<script>
import getDate from "../../utils/getDate"
export default {
  data() {
    return {
      type: 1,
      stime: '',
      etime: ''
    }
  },
  computed: {
    timer() {
      return getDate(new Date(this.stime * 1000), 3) + '-' + getDate(new Date(this.etime * 1000), 3)
    }
  },
  created() {
    document.title = '家族名星賽'
    this.stime = sessionStorage.getItem('stime')
    this.etime = sessionStorage.getItem('etime')
  },
  methods: {
    tabClick(val) {
      this.type = val
    }
  }
}
</script>

<style lang="scss">
body {
  background-color: rgba(29, 14, 9, 1);
}
.giftBox {
  width: 5.34rem;
  height: 3.13rem;
  display: block;
  margin: 0 auto;
}
.giftTIps {
  text-align: center;
}
.red {
  color: orange !important;
  font-weight: 600;
}
.rule {
  padding: 0.54rem 0.26rem;
  font-weight: 500;
  .tabs {
    display: flex;
    align-items: center;
    justify-content: space-between;
    width: 6.76rem;
    height: 0.78rem;
    padding: 0 0.07rem;
    background: url(../../assets/img/tabs.png);
    background-size: 100% 100%;
    span {
      width: 3.33rem;
      height: 0.64rem;
      text-align: center;
      line-height: 0.64rem;
      color: rgba(142, 105, 63, 1);
      &.act {
        color: rgba(29, 14, 9, 1);
        background: url(../../assets/img/actTabs.png);
        background-size: 100% 100%;
      }
    }
  }
  h3 {
    text-align: center;
    font-size: 0.28rem;
    color: rgba(255, 213, 154, 1);
    margin: 0.41rem 0 0.33rem;
  }
  h6 {
    color: rgba(255, 106, 57, 1);
    font-size: 0.26rem;
    text-align: center;
    margin: 0.2rem 0 0.25rem;
  }
  p {
    color: rgba(207, 135, 110, 1);
    font-size: 0.24rem;
  }
  .other {
    text-align: left;
    color: rgba(255, 96, 40, 1);
    font-size: 0.28rem;
  }
  .wardImg {
    width: 6.5rem;
    height: 6.11rem;
    display: block;
    margin: 0 auto;
  }
  .actTime {
    text-align: center;
    color: rgba(238, 172, 104, 1);
    font-weight: 500;
    font-size: 0.28rem;
    margin-top: 0.27rem;
  }
  .ruleItem,
  .wardItem {
    padding: 0 0.59rem;
  }
  .tm {
    color: rgba(255, 107, 58, 1);
    font-size: 0.24rem;
  }
  .lastTips {
    text-align: center;
    color: rgba(124, 67, 48, 1);
    margin-top: 1.53rem;
  }
}
@import "../../assets/scss/common.scss";
</style>
