<template>
  <div class="rule">
    <div class="tabs">
      <span :class="{act:type==1}" @click="tabClick(1)">活動獎勵</span>
      <span :class="{act:type==2}" @click="tabClick(2)">活動規則</span>
    </div>
    <div class="actTime">活動時間：{{timer}}</div>
    <div class="ruleItem" v-if="type==1">
      <h3>名星誕生榜獎勵</h3>
      <h6>第1名家族</h6>
      <p>1.所有家族成員獎勵名星家族徽章（1個月）</p>
      <p>2.家族等級積分10000+K房人數上限提升至200人（永久）</p>
      <p>3.所有家族成員獎勵500金豆</p>
      <p>4.名星誕生榜家族星光值前10名：</p>
      <p>第1名：夢幻島嶼*1（3520金幣/個）+1000金幣+2000金豆+皇家馬車座駕（30天）</p>
      <p>第2名：粉色摩天輪*1（1520金幣/個）+800金幣+1000金豆+皇家馬車座駕（30天）</p>
      <p>第3名：愛心泡泡雨*1（820金幣/個）+500金幣+500金豆+皇家馬車座駕（30天）</p>
      <p>第4-10名：生日蛋糕*1（699金幣/個，作品）+200金幣+500金豆+皇家馬車座駕（30天）</p>
      <h6>第2名家族</h6>
      <p>1.所有家族成員獎勵名星家族徽章（1個月）</p>
      <p>2.家族等級積分8000+K房人數上限提升至200人（永久）</p>
      <p>3.所有家族成員獎勵500金豆</p>
      <p>4.名星誕生榜家族星光值前10名：</p>
      <p>第1名：粉色摩天輪*1（1520金幣/個）+800金幣+1000金豆+皇家馬車座駕（30天）</p>
      <p>第2名：愛心泡泡雨*1（820金幣/個）+500金幣+500金豆+皇家馬車座駕（30天）</p>
      <p>第3名：煙火燦爛*1（588金幣/個）+200金幣+500金豆+皇家馬車座駕（30天）</p>
      <p>第4-10名：生日蛋糕*1（699金幣/個，作品）+200金幣+500金豆+皇家馬車座駕（30天）</p>
      <h6>第3名家族</h6>
      <p>1.所有家族成員獎勵名星家族徽章（1個月） </p>
      <p>2.家族等級積分5000+K房人數上限提升至200人（永久）</p>
      <p>3.所有家族成員獎勵300金豆</p>
      <p>4.名星誕生榜家族星光值前10名：</p>
      <p> 第1名：粉色摩天輪*1（1520金幣/個）+800金幣+1000金豆+皇家馬車座駕（30天）</p>
      <p> 第2名：煙火燦爛*1（588金幣/個）+500金幣+500金豆+皇家馬車座駕（30天）</p>
      <p>第3名：煙火燦爛*1（588金幣/個）+200金幣+500金豆+皇家馬車座駕（30天）</p>
      <p>第4-10名：生日蛋糕*1（699金幣/個，作品）+200金幣+500金豆+皇家馬車座駕（30天）</p>
      <h6>第4-10名家族</h6>
      <p>1.30位家族成員獎勵名星家族徽章（1個月）</p>
      <p>2.家族等級積分2000+K房人數上限提升至150人（永久）</p>
      <p>3.所有家族成員獎勵200金豆</p>
      <p>4.名星誕生榜家族星光值前10名：</p>
      <p>第1名：煙火燦爛*1（588金幣/個）+800金幣+500金豆+皇家馬車座駕（30天）</p>
      <p>第2名：星光閃耀*2（68金幣/個）+500金幣+500金豆+皇家馬車座駕（30天）</p>
      <p>第3名：星光閃耀*2（68金幣/個）+200金幣+500金豆+皇家馬車座駕（30天）</p>
      <p>第4-10名：為你點讚*1（299金幣/個，作品）+100金幣+500金豆</p>
      <h3>家族守護榜獎勵</h3>
      <p>第1名：5%儲值返利券（1天）+皇家馬車座駕（30天）+守護達人徽章（30天）+10000金豆</p>
      <p>第2名：4%儲值返利券（1天）+皇家馬車座駕（30天）+守護達人徽章（30天）+5000金豆</p>
      <p>第3名：3%儲值返利券（1天）+皇家馬車座駕（30天）+守護達人徽章（30天）+3000金豆</p>
      <p>第4-10名：守護達人徽章（30天）+2000金豆</p>
      <h3>家族禮包獎勵</h3>
      <img src="../../assets/img/giftImg.png" alt="" class="giftBox">
      <h3>備註：</h3>
      <p>1、名星誕生榜晉級家族成員不足10位則多餘獎勵視為無效</p>
      <p>2、家族積分已達到滿值則該獎項視為無效</p>
      <p>3、K房人數上限提升自獎勵發放之日起計算</p>
      <p>4、活動結束後7個工作日內工作人員將聯繫家族長統計獎勵資訊，逾期未提交視為自動放棄</p>
      <p>5、家族成員資訊統計於活動截止時為準，獎勵於活動結束後7個工作日內發放</p>
      <p>6、活動獎勵特效禮物請更新至最新版本軟體使用，否則可能會錯過絢麗特效哦</p>
    </div>
    <div class="wardItem" v-else>
      <h3>活動規則</h3>
      <p>家族名星賽分爲三個賽程：星光閃耀—眾星爭輝—名星誕生，活動僅限家族用戶報名參與，</p>
      <h3>星光閃耀</h3>
      <p>1、比賽時間：8月12日12:00-8月15日22:00</p>
      <p>2、家族用戶點擊報名即可參與活動，星光值=作品/K房收禮金幣魅力值，星光總榜前200名可代表家族晉級</p>
      <p>3、星光日榜依據當日星光值排名，前100名可參與抽獎，每天抽送20個星光閃耀背包禮物（68金幣/個），日榜中獎概率=當日星光值/前100名總星光值</p>
      <p>4、星光閃耀期間退出家族則榜單數據清除，不參與抽獎，重新加入家族重新累計星光值</p>
      <h3>眾星爭輝</h3>
      <p>
        1、比賽時間：8月15日22:05-8月20日18:00<br />
        2、同一家族晉級者組成團隊，代表家族參與PK，PK雙方（隨機匹配）依據總星光值判定勝負，勝方晉級並獲得家族大禮包獎勵，星光值=作品/K房收禮金幣魅力值<br />
        3、賽段結束時分數相同PK雙方將同時淘汰，PK失敗但總星光值大於等於50萬也可晉級<br />
        4、晉級用戶退出家族總星光值不扣減，再次加入家族時保留退出前數據可繼續累計，加入其他家族則視為未晉級，無法繼續參與活動<br />
        5、每個家族大禮包含獎勵30份，每人最多獲得1份，賽段結束時向晉級家族自動派發
      </p>
      <h3>名星誕生</h3>
      <p>1、比賽時間：8月20日18:05-8月21日22:00<br />
        2、星光值=作品/K房收禮金幣魅力值，8月21日20-23點獲得10%加成<br />
        3、晉級家族依據總星光值排名，前十名家族和家族代表成為家族名星，獲得豐厚獎勵<br />
        4、總星光值達到指定數值則家族升級，升級時系統自動發放大禮包，Ⅰ、Ⅱ、Ⅲ級對應星光值分別為10萬、30萬、100萬，禮包獎勵份數分別為30、50、100份<br />
        5、晉級用戶退出家族總星光值不扣減，再次加入家族時保留退出前數據可繼續累計，加入其他家族則視為未晉級，無法繼續參與活動
      </p>
      <h3>備註</h3>
      <p>
        1、家族守護榜依據活動期間為報名用戶贈送金幣禮物魅力值排名，前10名可獲得豐厚獎勵，榜單分數相同則先到達者排名靠前<br />
        2、家族大禮包獎勵發放詳情展示在開獎明細中，可點擊查看<br />
        3、星光閃耀賽段日榜獎勵每日24點發放，最後一天於22點發放<br />
        4、參賽作品需為8月12日18:00:00後發佈的任意公開作品(清唱5分鐘除外)，可上傳多首作品參賽，報名後作品收禮才會被計算，若刪除活動期間報名的參賽作品，該刪除作品在對應賽段收禮總魅力值作廢<br />
        5、活動期間如有任何刷分行為，將取消參賽資格和獎勵，嚴重者封號處理
      </p>
    </div>
    <p class="lastTips">活動最終解釋權歸主辦方所有</p>
  </div>
</template>

<script>
import getDate from "../../utils/getDate"
export default {
  data() {
    return {
      type: 1,
      stime: '',
      etime: ''
    }
  },
  computed: {
    timer() {
      return getDate(new Date(this.stime * 1000), 3) + '-' + getDate(new Date(this.etime * 1000), 3)
    }
  },
  created() {
    document.title = '規則&獎勵'
    this.stime = sessionStorage.getItem('stime')
    this.etime = sessionStorage.getItem('etime')
  },
  methods: {
    tabClick(val) {
      this.type = val
    }
  }
}
</script>

<style lang="scss">
body {
  background-color: #8338d0;
}
.giftBox {
  width: 5.34rem;
  height: 3.13rem;
  display: block;
  margin: 0 auto;
}
.red {
  color: orange !important;
  font-weight: 600;
}
.rule {
  padding: 0.54rem 0.26rem;
  font-weight: 500;
  h5 {
    text-align: center;
    margin: 0.31rem auto;
    color: #ffe6b5;

    font-size: 0.28rem;
  }
  h6 {
    color: #30ffee;
    font-size: 0.26rem;
    margin-top: 0.31rem;
  }
  p {
    font-size: 0.22rem;
    color: #e6a3ff;
  }
  .tabs {
    display: flex;
    align-items: center;
    justify-content: space-between;
    width: 6.9rem;
    height: 0.78rem;
    background: url(../../assets/img/tasBg.png);
    background-size: 100% 100%;
    span {
      width: 3.46rem;
      height: 0.9rem;
      text-align: center;
      line-height: 0.9rem;
      &.act {
        background: url(../../assets/img/ruleAct.png);
        background-size: 100% 100%;
      }
    }
  }
  .wardImg {
    width: 6.5rem;
    height: 6.11rem;
    display: block;
    margin: 0 auto;
  }
  .actTime {
    text-align: center;
    color: #ffe6b5;
    font-weight: 500;
    font-size: 0.26rem;
    margin-top: 0.27rem;
  }
  .ruleItem {
    .lastTips {
      margin-top: 5.8rem;
      text-align: center;
      color: #6628af;
    }
  }
  .wardItem {
    .lastTips {
      margin-top: 2rem;
      text-align: center;
      color: #6628af;
    }
  }
  .mt {
    margin-top: 0.35rem;
  }
}
@import "../../assets/scss/common.scss";
</style>
