export default {
    //html/index.html
    tab2_notStart: "決賽還沒開始",
    title: "人氣大作戰",
    noAct: "活動未開始",
    actEd: "活動已結束",
    rule_tips: "活動規則",
    loading: "加載中...",
    rank_noData: "暫無歌友上榜",
    //footer
    fans_tips: "粉絲守護團>>",
    user_fan_group: "的粉絲守護團",
    user: "用戶",
    user_score: "貢獻人氣值",
    fans_score_tips:
        "*貢獻人氣值為粉絲對同一名主播所貢獻的人氣值總和，榜單顯示前20名",
    look_then: "查看他人資料頁",
    //TabsScrollLoadList
    rank_tab1: "真愛日榜", //真愛日榜
    rank_tab2: "真愛總榜", //真愛總榜
    rank_over: "當前階段已結束",
    day: "天",
    houer: "時",
    min: "分",
    second: "秒",
    rank_listHeader1: "排名", //名次
    rank_listHeader2: "主播&推薦官", //真愛情侶
    rank_listHeader3: "主播暱稱", //真愛值
    rank_listHeader4: "人氣值", //真愛值
    rank_listHeader5: "主播",

    //timePeople
    people_scoreTips:
        " 在6月3日-6月9日期間，每日20：00、21：00、22：00、23：00每小時人氣值第一名榮登人氣席位，並獲得對應小時人氣值10%加成。（席位中展示的人氣值不包含10%加成，加成分數直接增加到晉級賽、決賽）",

    //rule
    rule_title: "規則&獎勵",
    rule_tab1: "規則",
    rule_tab2: "獎勵",
    rule_tm: "活動時間：6月3日 18:00- 6月9日23:59:59",
    rule_item: [
        {
            title: "一、參賽對象",
            p1: "活動前以及晉級賽期間成為官方主播、官方房主的玩家"
        },
        {
            title: "二、晉級賽段",
            p1: "1、比賽時間：6月3日 18:00-6月7日23:59:59",
            p2:
                "2、每位參賽官方主播/官方房主在晉級賽段中收到指定禮物可以登上晉級賽榜單，人氣榜單按照官方主播/官方房主的人氣值從高到低排序，若出現同分，則先達到的優先排序；晉級賽結束時的前十名可以進入決賽；1金幣=2人氣值"
        },
        {
            title: "三、決賽",
            p1: "1、比賽時間：6月8日 00:00-6月9日23:59:59",
            p2:
                "2、晉級賽的前十名可進入決賽爭奪人氣之星，官方主播/官方房主的人氣值重新累計（不包含晉級賽的人氣值），按照官方主播/官方房主的人氣值從高到低排序，若出現同分，則先達到的優先排序；1金幣=2人氣值"
        },
        {
            title: "四、人氣加成",
            p1:
                "在6月3日-6月9日期間，每日20:00、21:00、22:00、23:00每小時人氣值第一名榮登人氣席位，並獲得對應小時人氣值10%加成。（席位中展示的人氣值不包含10%加成，加成人氣值直接增加到晉級賽/決賽）",
            p2:
                "小時榜說明：20:00小時榜統計的是19:00:01-20:00:00時間內的官方主播、官方房主收到指定禮物的數據，21:00、22:00、23:00如此類推"
        },
        {
            title: "五、推薦官",
            p1:
                "在晉級賽段，貢獻指定禮物的金幣價值最高的玩家會成為相應官方主播/官方房主的推薦官，若貢獻金幣的價值相同，先達到的優先排序；官方主播/官方房主不能成為自己的推薦官"
        },
        {
            title: "六、指定禮物"
        }
    ],
    rule_tipsList: {
        title: "注意",
        p: [
            "1、活動中，若發現玩家用不正當手段參與活動，小音有權在不事先通知的情況下按照情節嚴重對參與玩家、違規者取消上榜資格、封禁賬號、收回該玩家所有獎勵等處罰，包括但不限於：",
            "a）活動期間對參與活動的玩家進行惡意攻擊、造謠、影射",
            "b）不正常手段獲得金幣、活動的指定禮物，並進行惡意刷分",
            "c）官方主播/官方房主使用小號成為大號的推薦官，一經查出，小號不可獲得推薦官獎勵",
            "2、本活動與蘋果公司無關"
        ]
    },
    gift_title1: "決賽獎勵",
    top1_title: "第一名的頭號粉絲獎勵",
    gift_top3: [
        {
            title: "第一名官方主播/官方房主",
            p: "星光璀璨-top1勛章（10天）+琴音裊裊-背包禮物*1",
            p2:
                "頭號粉絲頭像框（10天）+10%儲值返利券+琴音裊裊-背包禮物*1+守護者勛章（10天）"
        },
        {
            title: "第二名官方主播/官方房主",
            p: "星光璀璨-top2勛章（7天）+貓貓星雲-背包禮物*1",
            p2:
                "頭號粉絲頭像框（7天）+10%儲值返利券+貓貓星雲-背包禮物*1+守護者勛章（7天）"
        },
        {
            title: "第三名官方主播/官方房主",
            p: "星光璀璨-top3勛章（7天）+魅力四射-背包禮物-1",
            p2:
                "頭號粉絲頭像框（5天）+10%儲值返利券+魅力四射-背包禮物*1+守護者勛章（5天）"
        }
    ],
    gift_other: [
        {
            title: "晉級賽獎勵",
            p: [
                "第一到三名官方主播/官方房主及對應推薦官：",
                "紫曇花-背包禮物*1+星空瓶-背包禮物*1+緋紅淡香-背包禮物*1+完美綻放-背包禮物*1",
                "第四到五名官方主播/官方房主及對應推薦官：",
                "紫曇花-背包禮物*1+星空瓶-背包禮物*1"
            ]
        },
        {
            title: "注意",
            p: [
                "1、活動中的禮物獎勵有效期均為7天，獎勵於活動結束後7個工作日內發放",
                "2、儲值返利券為活動結束後的3天內儲值任意金幣，按照其中最高一筆儲值進行金幣返利",
                "3、晉級賽和決賽中，人氣值低於8000的主播/官方房主不可獲得晉級賽/決賽獎勵；"
            ]
        }
    ],
    lastTips: "*活動最終解釋權歸活動主辦方所有",
    rule_gift: [
        {
            img: require(`../../img/ruleGift/gift1.png`),
            price: "50",
            name: "pick you",
            addScoreStr: "+100人氣值"
        },
        {
            img: require(`../../img/ruleGift/gift2.png`),
            price: "200",
            name: "彩虹燈",
            addScoreStr: "+400人氣值"
        },
        {
            img: require(`../../img/ruleGift/gift3.png`),
            price: "2200",
            name: "發射愛心",
            addScoreStr: "+4400人氣值"
        }
    ],
    luck_gift: [
        {
            img: require(`../../img/ruleGift/gift4.png`),
            name: "星光璀璨<br/>勛章"
        },
        {
            img: require(`../../img/ruleGift/gift5.png`),
            name: "琴音裊裊"
        },
        {
            img: require(`../../img/ruleGift/gift6.png`),
            name: "貓貓星雲"
        },
        {
            img: require(`../../img/ruleGift/gift7.png`),
            name: "魅力四射"
        }
    ],
    luck_gift2: [
        {
            img: require(`../../img/ruleGift/gift8.png`),
            name: "紫曇花<br/>背包禮物"
        },
        {
            img: require(`../../img/ruleGift/gift9.png`),
            name: "星空瓶<br/>背包禮物"
        },
        {
            img: require(`../../img/ruleGift/gift10.png`),
            name: "緋紅淡香<br/>背包禮物"
        },
        {
            img: require(`../../img/ruleGift/gift11.png`),
            name: "完美盛放<br/>背包禮物"
        }
    ]
};
