<template>
  <div class="rule">
    <div class="title">活動攻略</div>
    <h3>歡歌頭號玩家</h3>
    <h6>活動時間</h6>
    <p>1月8日18:00:00-1月27日20:00:00</p>
    <h6>活動攻略</h6>
    <p>1、可通過完成每日任務、幫歌友加油及被歌友加油獲得遊戲幣</p>
    <p>2、可使用遊戲幣參與打地鼠遊戲解鎖各等級獎勵、幸運大轉盤抽獎、兌換各大年度賽事選票送給對應活動參賽者</p>
    <h3>年度魅力歌手</h3>
    <h6>活動時間</h6>
    <p>1月9日18:00:00-1月18日20:00:00</p>
    <h6>活動攻略</h6>
    <p>1、上傳多首作品參賽，按照獲得的閃耀值排名。閃耀值=作品收到魅力歌手選票魅力值+作品收到金幣禮物魅力值</p>
    <p>2、可點擊獲取魅力歌手選票跳轉至歡歌頭號玩家活動獲取選票</p>
    <p>3、閃耀日榜前100名用戶中的隨機20位，可獲得水晶巧克力背包禮物（50金幣）*3+新年快樂座駕（7天）；中獎概率=本人日榜閃耀值/前100名用戶總閃耀</p>
    <p>4、2019作品總收金幣禮排名前100名用戶可獲得總榜閃耀值2%-10%加成</p>
    <p>5、閃耀總榜前3名用戶將受邀參加年度之星演唱會並獲得現金分成</p>
    <h3>年度人氣男女神</h3>
    <h6>活動時間</h6>
    <p>1月13日12:00-1月22日23:00</p>
    <h6>活動攻略</h6>
    <p>1、點擊報名參賽即可參與活動，報名後的數據才會被計算</p>
    <p>2、在K房收穫人氣票和禮物將積累應援值，邀請好友為你應援可獲得額外加成，前100名晉級排位賽</p>
    <p>3、排位賽依據性別分為男神、女神賽道，前15名晉級總決賽並在K房決賽一決勝負</p>
    <p>4、男神、女神榜前十名可獲得豐厚獎勵，其中前三名將受邀參與年度之星演唱會並獲得現金分成</p>
    <h3>年度好聲音</h3>
    <h6>報名時間</h6>
    <p>1月17日18:00:00-1月20日12:00:00</p>
    <h6>評比時間</h6>
    <p>1月20日12:15:00-1月24日20:00:00</p>
    <h6>活動攻略</h6>
    <p>1、僅歷史上獲得過好聲音活動前300名的用戶報名參加，每個UID僅可提交一首獨唱作品參賽</p>
    <p>2、比賽評分採用盲評形式：所有歌友包括參賽用戶均可參與。評分（1星星=1分，滿分5分）</p>
    <p>3、以評比時間內累計的總分作為排名依據</p>
    <p>4、榜單前3名用戶將受邀參加年度之星演唱會並獲得現金分成</p>
    <h3>年度金牌家族</h3>
    <h6>活動時間</h6>
    <p>1月19日14:30-1月27日19:00</p>
    <h6>活動攻略</h6>
    <p>1、家族長和副族長點擊活動報名按鈕即視為家族報名成功，並開始累計活動數據</p>
    <p>2、積累家族基金可開啟寶箱並對家族成員隨機發放獎勵，每天最多開啟2個寶箱</p>
    <p>3、金牌家族榜依據總榮耀值由高到低排名，前十名家族可獲得豐厚獎勵，其中前三名將受邀參與年度之星演唱會並獲得金幣分成</p>
    <h3>年度之星演唱會</h3>
    <h6>活動時間</h6>
    <p>2月7日20:00:00開始</p>
    <h6>活動攻略</h6>
    <p>1、活動邀請各年度系列活動前三名共十五位擔任嘉賓並出席演唱，家族榜前三名由家族長推薦嘉賓出席，活動期間收穫金幣禮物將獲得對應金幣或現金返利</p>
    <p>2、活動期間贈送任意金幣禮物獎勵棒棒糖x1，在線60分鐘獎勵200金豆</p>
    <p>3、現場豐厚豪禮新年座駕、VIP、背包禮物、海量金幣送不停</p>
    <h6>PS:</h6>
    <P>1、更詳細的活動規則請在各個活動的活動規則查看</P>
    <P>2、2019歡歌年度之星活動頁面上展示的年度之星獎勵為年度系列活動的獎勵合集，各個活動的具體獎勵請在各活動獎勵中查看</P>
    <p>3、參與年度活動獲得多個認證則任選發放其中一個</p>
    <p>4、同一嘉賓在年度系列活動中每獲得一個前三名席位可在年度之星演唱會演唱一首歌曲，返利按最高名次比例計算</p>
    <P class="lastTips">本系列活動最終解釋權歸歡歌所有</P>
  </div>
</template>

<script>
export default {

}
</script>

<style lang="scss">
body {
  background-color: #050126;
}
.lastTips {
  font-size: 80%;
  color: #776fb6 !important;
  text-align: center;
  margin-top: 1.25rem;
}
.rule {
  padding: 0.52rem 0.33rem;
  .title {
    font-size: 120%;
    text-align: center;
  }
  h3 {
    width: 2.95rem;
    height: 0.68rem;
    line-height: 0.68rem;
    background: url(../../assets/img/ruleTitleBg.png);
    background-size: 100% 100%;
    text-align: center;
    margin: 0.32rem auto;
  }
  h6 {
    font-size: 86%;
    color: #e16826;
    margin: 0.14rem 0;
  }
  p {
    font-size: 80%;
    color: #fed6a1;
    padding-left: 0.2rem;
  }
}
@import "../../assets/scss/common.scss";
</style>
