<template>
  <div class="rule">
    <div class="tabs">
      <span :class="{act:type==1}" @click="tabClick(1)">الجوائز للقائمة العامة</span>
      <span :class="{act:type==2}" @click="tabClick(2)">القواعد</span>
    </div>
    <div class="gift" v-if="type == 1">
      <h3>الجوائز للقائمة العامة</h3>
      <img src="../../assets/img/gift.png" alt="" class="giftImg">
      <h6>الجوائز للقائمة أفضل 10 في المنافسة</h6>
      <p>المركز الأول</p>
      <p>شارة متدرب موسيقى(7 يوما)+3000عملة+ VIP(30 يوما)+1000 فول</p>
      <p>المركز الثاني</p>
      <p>شارة متدرب موسيقى(7 يوما)+2000عملة+ VIP(30 يوما)+800 فول</p>
      <p>المركز الثالث </p>
      <p>شارة متدرب موسيقى(7 يوما)+1500عملة+ VIP(30 يوما)+600 فول</p>
      <p>المراكز 10-4</p>
      <p>شارة متدرب موسيقى(7 يوما)+1000عملة+ VIP(30 يوما)+500 فول</p>
      <h6>الجوائز للقائمة أفضل 100 في موسم السباق </h6>
      <p>المراكز 3-1: عملاق الموسيقى </p>
      <p>شارة عملاق الموسيقى (30 يوما)+5000عملة+ VIP(30 يوما)+5000 فول</p>
      <p>المراكز 10-4: أستاذ العظيم الموسيقى </p>
      <p>شارة أستاذ العظيم الموسيقى (30 يوما)+3000عملة+ VIP(30 يوما)+3000 فول</p>
      <p>المراكز 20-11: نجمة الموسيقى </p>
      <p>شارة نجمة الموسيقى (30 يوما)+1000عملة+ VIP(30 يوما)+2000 فول</p>
      <p>المراكز 50-21: سيد الموسيقى</p>
      <p>شارة سيد الموسيقى (30 يوما)+500عملة+ VIP(30 يوما)+1000 فول</p>
      <h6>الجوائز لنشر الأعمال المنافسة:</h6>
      <p>يقدم كل مستخدم أغنية مسابقة (فقط أول أغنية المقدمة يوميا) سيحصل على 1 هدية عشوائية في حقيبته :مروحة هوائية الورقية （100فول ذهبي）/حقيبة هدية حلوى（200 فول ذهبي）/أحلام سعيدة （عملة）
        /Drinks*1（عملتان）/1*بيض（عملتان）/1*جيد（3 عملات）/1*مالك المايك（5 عملات）/1*أكون معك（10 عملات）</p>
      <h6>جوائز المحكم</h6>
      <p>1. سيحرز الحكام أول 30 مجموعة من الأغاني كل يوم وستحصل كل مجموعة من الأغاني على 5 فول ذهبي<br />
        ستتلقى كل 8 أصوات متتالية التي تفوز بلتصويت المسابقة الحالية هدايا عشوائية: (عملتان)Flowers*10\Drinks*1（100 فول ذهبي）\VIP(يومين)\سيارة طائر اللهب(يومين)<br />
        سيحصل الحكام على 30 عملة للحصول على لقب آذان ذهبية و 20 عملة للأذان البلاتينية.</p>
      <h6>امتياز التصويت</h6>
      <img src="../../assets/img/chTab.png" alt="" class="chTabImg">
      <!-- <p>PS.</p>
      <p>1、稱號展示在下一期的活動中</p>
      <p>2、如本期獲得金耳朵稱號，下期每投一票相當於普通用戶投2票</p>
      <p>3、本期獲得的評委稱號及投票特權僅在下一期活動中生效</p> -->
      <p>
        الوصف الآخر:<br />
        1. سيتم عرض القب في المنافسة التالي<br />
        2. إذا حصلت على لقب الأذن البلاتينية في هذا المنافسة ، فإن كل تصويت في المنافسة التالي يعادل صوتين للمستخدمين العاديين<br />
        3. لقب الحكّم وامتيازات التصويت التي تم الحصول عليها في هذه المنافسة لن تدخل حيز التنفيذ إلا في فترة المنافسة التالية
      </p>
      <!-- <h6>獎勵說明：</h6>
      <p>1、背包禮物獎勵有效期為7天</p>
      <p>2、發佈作品獎勵和評委金豆獎勵即時發放，連投獎勵將由系統在活動結束時發放，本期打擂榜前10名將在活動結束後7天內發放，本賽季前100名獎勵將在本賽季活動結束後7天內發放</p> -->
    </div>
    <div class="ruleTips" v-else>
      <div class="actTime">
        <p>وقت المسابقة</p>
        <p class="timeItem dl">{{stime}}-{{etime}}</p>
        <p>وقت التسجيل في PK</p>
        <p class="timeItem dl">{{pstime}}-{{petime}}</p>
        <p>وقت للمطابقة المنافس في PK</p>
        <p class="timeItem">قم بمطابقة المنافس كل ساعتين في فترة المطابقة 00: 00: 02-00: 00: 00 و 00: 22:00-00: 00: 14، أي 00:00:00و02:00:00و14:00:00و16:00:00و18:00:00و20:00:00و22:00:00؛ ومع ذلك ، فإن
          اليوم الأخير من المسابقة سيطابق المنافس PK فقط عند 00:00:00 و 02:00:00 ، ولن يكون هناك تطابق بعد ذلك.</p>
        <p>وقت موسم السباق </p>
        <p class="timeItem df"><span class="dl">{{zsetime}}-{{zeetime}}</span> كل خميس ~ الأحد </p>
        <!-- <p>活動時間規律說明：</p>
        <div class="timeTips">
          <p>每期時間：</p>
          <p>每週五18:00:00-每週一20:00:00</p>
          <p>賽季時間：</p>
          <p>每3個自然月為一個賽季</p>
        </div> -->
      </div>
      <h3>القواعد</h3>
      <h6>شروط الاشتراك في المسابقة</h6>
      <div class="mTips">
        <p>1. من الضروري غناء المرافقة الرسمية الصادرة بعد {{stime}} للمشاركة في المسابقة (يغنى المرافقة التي تقفز بعد النقر فوق الزر PK) ، والغناء المرافق الأخرى لا يمكن المشاركة</p>
        <p>2. تقتصر أنواع الأعمال المشاركة في المسابقة على عمل فردي</p>
        <p>3. يمكن اختيار عمل واحد فقط لكل مرافق للمشاركة في المسابقة</p>
        <p class="red">4. يمكن اختيار 20 مرافقًا على الأكثر للمشاركة في PK في كل مسابقة</p>
        <p>5. يجب أن تكون الأغنية الغنائية أغنية كاملة(مدة الأغنية أطول\أقصر بـ 30 ثانية على الأكثر من مدة المصاحبة) ، وإلا فلا يمكن تقديم الأغنية للمنافسة</p>
        <p>6. إذا نجحت في اختيار أغنية PK للمشاركة في المنافسة ومطابقة المنافس ،
          ويُعتبَر حذف العمل PK الانسحابَ في المسابقة. ستكون نتائج مسابقة الأغنية لكلا الطرفين غير صالحة ، والآخر سيشارك الحزب في PK التالية من المنافسة ويعيد المشاركة في PK.</p>
        <p>7. سيقوم النظام تلقائيًا بمطابقة اثنين من المتسابقين من نفس الأغنية لتشكيل مجموعة ، ودفعهم إلى لجنة التحكيم العامة للتصويت الأعمى. اعتبارًا من نهاية المنافسة ، يفوز المتسابق الذي يحصل على
          المزيد من الأصوات لكل أغنية</p>
        <p>8. إذا تجاوز العدد الإجمالي لأصوات اثنين من المتنافسين في أغنية ما 50 ، وحصل حزب واحد على 80٪ أو أكثر من الأصوات (أي عدد الأصوات التي حصل عليها حزب واحد / مجموع أصوات كلا الطرفين من
          الأغنية * 100٪ ≥80٪) ، يمكن للفائز إضافة نقطتين ، ويخسر الخاسر نقطة واحدة فقط ؛ إذا لم يصل مجموع أصوات الأغنية إلى 50 أو لم يكن عدد الأصوات التي حصل عليها الفائز تصل إلى 80٪ ، يمكن للفائز
          زيادة نقطة واحدة ، ويخسر الخاسر نقطة واحدة فقط ؛
          إذا كان التصويت متعادلًا ، فلن يقوم أي من الطرفين بإضافة أو تقليل النقاط ، ولن يتم احتساب المستخدم الذي صوت على أنه النجاح التصويت</p>
        <p class="red">9. بعد تقديم الأغنية ، إذا تم حذف أغنية لPK أثناء المسابقة ، فسيتم خصم نقطتين من النتيجة</p>
      </div>
      <h6>القواعد للقائمة الترتيب في المنافسة</h6>
      <p>1. وفقًا لترتيب الدرجات التي تم الحصول عليها في المنافسة الحالية ، إذا كانت الدرجات متشابهة ، فسيتم ترتيب الأغاني في المنافسة الحالية التي حصلت على عدد أكبر من الأصوات في المرتبة الأعلى</p>
      <h6>القواعد لملك الأغاني في موسم السباق</h6>
      <p>1. يتم قائمة ملك الأغاني لهذا الموسم وفقًا للترتيب ، أي الترتيب الإجمالي للنتائج التي تم الحصول عليها في جميع مراحل المسابقة ؛ إذا كان الترتيب نفسه ، فسيكون الترتيب الذي يحصل على عدد أكبر من
        الأصوات في المقدمة.</p>
      <p>2. في بداية كل موسم ، المستوى الافتراضي للاعب هو Lv.0. في كل مرة تحصل فيها المنافسة على نقطة واحدة ، ستزداد بمقدار مستوى واحد ، وسيتم تخفيض كل نقطة بمستوى واحد ، وقد يكون المستوى سالبًا .</p>
      <h3>الوصف الآخر</h3>
      <p>أثناء المسابقة ، إذا تبين أن المستخدم يستخدم الوسائل غير المناسبة للمشاركة في النشاط ، يحق للمسؤول إلغاء المؤهل دون إشعار مسبق ، وفي الحالات الشديدة ، سيتم حظر رقم حساب المشارك ، بما في ذلك
        على سبيل المثال لا الحصر:</p>
      <p>1. يتم عملك النشاط يغنيه شخص آخر أو يغنيه المطرب الأصلي ؛</p>
      <p>2.سرق حساب الآخر الموجود أو تستعيره للاشتراك في المسابقة</p>
      <p>3.تسجل حسابات كثيرة للاشتراك في المسابقة</p>
      <p>4.تعلق على الأعمال المسابقة بالكلمات السيئة أو ترسلهم إعلانات في فترة المسابقة</p>
      <p>5.تشترك في المسابقة عن طريق غير لائق </p>
      <!-- <p>6）本期打擂歌單會在上期的打擂歌單預告上進行細微調整 </p> -->
      <p class="mt"> إذا تم العثور على مستخدم يقوم بالغش ، بغض النظر عما إذا كان متسابقًا أم لا ، فسيتم حظر جميع حسابات هذا المستخدم بشكل دائم. يحق لـSuper voice سحب كل الجوائزمن لهذا المستخدم.</p>
    </div>
    <p class="lastTips">التفسير النهائي لهذا النشاط ينتمي إلى المنظم</p>
  </div>
</template>

<script>
import getDate from "../../utils/getDate"
export default {
  data () {
    return {
      type: 1,
      time: {}
    }
  },
  created () {
    document.title = 'الجوائز'
    this.time = JSON.parse(sessionStorage.getItem('time'))
    console.log(this.time)
  },
  computed: {
    stime () {
      return getDate(new Date(this.time.stime * 1000), 3)
    },
    etime () {
      return getDate(new Date(this.time.etime * 1000), 3)
    },
    pstime () {
      return getDate(new Date(this.time.pstime * 1000), 3)
    },
    petime () {
      return getDate(new Date(this.time.petime * 1000), 3)
    },
    zsetime () {
      return getDate(new Date(this.time.zsetime * 1000), 3)
    },
    zeetime () {
      return getDate(new Date(this.time.zeetime * 1000), 3)
    },
    rStime () {
      return getDate(new Date(this.time.stime * 1000), 1)
    },
    rEtime () {
      return getDate(new Date(this.time.etime * 1000), 1)
    }
  },
  methods: {
    tabClick (val) {
      this.type = val
    }
  }
}
</script>

<style lang="scss">
body {
  .df {
    display: flex;
  }
  .dl {
    direction: ltr;
    text-align: right;
  }
  background: rgba(117, 67, 240, 1);
  .mTips {
    p {
      margin-bottom: 0.07rem;
    }
  }
  .red {
    color: red !important;
  }
  .rule {
    padding: 0.29rem 0.44rem;
    .tabs {
      display: flex;
      align-items: center;
      justify-content: space-between;
      width: 6.22rem;
      height: 0.88rem;
      background: url(../../assets/img/tabs.png);
      background-size: 100% 100%;
      margin: 0 auto;
      span {
        width: 3.26rem;
        height: 0.8rem;
        text-align: center;
        line-height: 0.8rem;
        color: rgba(255, 220, 42, 1);
        font-weight: bold;
        &.act {
          color: rgba(174, 72, 0, 1);
          background: url(../../assets/img/actTab.png);
          background-size: 100% 100%;
        }
      }
    }
    h3 {
      text-align: center;
      margin: 0.3rem 0 0.2rem;
    }
    h6 {
      font-size: 0.26rem;
      margin: 0.49rem 0 0.25rem;
    }
    p {
      color: rgba(229, 222, 255, 1);
      font-size: 0.24rem;
      padding-left: 0.22rem;
    }
    .giftImg {
      width: 6.56rem;
      height: 6.5rem;
      display: block;
    }
    .chTabImg {
      width: 5.65rem;
      height: 4.22rem;
      margin: 0 0 0.25rem 0.22rem;
    }
    .lastTips {
      color: rgba(209, 190, 255, 1);
      margin: 0.78rem 0 0.92rem;
      text-align: center;
    }
    .ruleTips {
      h6 {
        margin: 0.35rem 0 0.25rem;
      }
      .actTime {
        margin-top: 0.6rem;
        .timeItem {
          margin-bottom: 0.3rem;
          //   display: flex;
          text-align: right;
          span {
            display: block;
          }
        }
        .timeTips {
          padding-left: 0.45rem;
        }
      }
    }
    .mt {
      margin-top: 0.3rem;
    }
  }
}
@import '../../assets/scss/common.scss';
</style>
