export default {
    //html/index.html
    title: 'लकी टर्नटेबल', //幸運轉盤
    title_box: 'सरप्राइज बॉक्स',//驚喜寶箱
    //common
    common_luck: 'बधाई हो!',//恭喜獲得
    common_ok: 'ठीक है',//確定
    common_noOpen: 'लोड रहा है, कृपया बाद में कोशिश करें!',//資源未加載完成，請稍後再試！
    common_loading: 'लोड रहा है',//加載中...

    //box
    box_tips: '$ कॉइन रिचार्ज कर एक चाबी प्राप्त सकता है',// 繼續儲值$金幣即可獲得一把鑰匙
    box_tmTips: '(22 फ़रवरी के 0 बजे से गिनेगा)',//（2月22日0時起計算）
    box_giftTips: 'इस इनाम का प्रयोग करने के लिए सबसे नया वर्शन अपडेट करना चाहिए',//該獎品需要更新到最新版本才可使用
    box_openBox: 'बॉक्स खोलें',//去開寶箱
    box_noOpen_tips1: 'आपका बॉक्स काफी नहीं है, चलें और प्राप्त करें!', //您的寶箱不足哦,快去獲取寶箱吧
    box_noOpen_tips2: 'आपकी चाबी काफी नहीं है, बॉक्स खोल न सकता!', // 您的鑰匙不足哦,不能開啟寶箱！
    box_must: '$ बार में अवश्य मिलेगा',//第$次必中

    //emoji
    emoji_title: 'इमोजी',//貼圖
    emoji_getNums: '$ टुकड़े में विनिमय करें',//$碎片兌換
    emoji_get_suc: 'विनिमय करने की बधाई हो! इस इमोजी का प्रयोग रूम में कर सकता है!',//恭喜你兌換獲得貼圖成功，在K房即可使用！
    emoji_get_noupData: 'इमोजी लोड करना विफल है!',//貼圖加載失敗！
    emoji_get_noGet: 'आपका टुकड़ा काफी नहीं है~ चलें और टुकड़े प्राप्त करें!',//您的貼圖碎片不足哦~快去獲取碎片吧！

    //footer
    footer_rule_title: 'नियम',//遊戲規則
    footer_rule_p1: '1.कुल खर्च किए प्रत्येक 100 कॉइन के लिए टर्नटेबल ड्रा आयोजित किया जाएगा;', //1.每累計消費100金幣即可進行轉盤抽獎；
    footer_rule_p2: '2.कुल रिचार्ज किए प्रत्येक 300 कॉइन के लिए एक चाबी प्राप्त किया जाएगा, जिससे सरप्राइज बॉक्स खोल सकता है;',//2.每累計儲值300金幣即可獲得一把驚喜鑰匙，驚喜鑰匙可用於開啟驚喜寶箱；
    footer_rule_p3: '3.उपहार बॉक्स में दुर्लभ उपहार के विनिमय करने के लिए उपहार टुकड़ा उपलब्ध है। वह उपहार KTV रूम के लिए है;',//3.禮物碎片可用於兌換禮物禮盒中的稀有禮物，稀有禮物為k房禮物；
    footer_rule_p4: '4.इमोजी टुकड़ा इमोजी का एक पूर्ण सेट के विनिमय के लिए उपलब्ध है, जिस इमोजी की समय सीमा स्थायी है। प्रत्येक उपयोगकर्ता हर प्रकार के इमोजी के विनिमय के लिए केवल एक बार है, दुबारा विनिमय कर नहीं सकता;',//4.貼圖碎片可用於兌換整套貼圖，兌換的貼圖有效期為永久，每位玩家每種貼圖只可兌換一次，已擁有對應貼圖則無法再進行兌換；
    footer_rule_p5: '5.तीसरी और आठवां बार में दुर्लभ प्रॉप्स एवं बहुत कॉइन मिलेंगे;', //5.幸運寶箱第三次及第八次必中稀有道具及高價值金幣；
    footer_rule_p6: '6.हर महीने की शुरुआत में दुर्लभ प्रॉप्स और प्रोसेस रेट रीसेट करेगा;', //6.每月初會進行稀有道具更換，並重置必中進度；
    footer_rule_p7: '7.जो प्रॉप्स समय सीमा के साथ हैं, वे समय को संचित रूप से जोड़ सकते हैं', //7.期限道具可以進行使用期限累計疊加
    footer_history_title: 'ड्रा रिकॉर्ड',//抽獎記錄
    footer_history_noData: 'खाली है!',//暫無抽獎信息！
    footer_co: '', //從
    footer_get: 'से',//抽出
    footer_emty: 'प्राप्त है',
    //giftBox
    giftBox_title: 'उपहार बॉक्स ',//禮盒
    giftBox_tips: 'टुकड़े से दुर्लभ उपहार का विनिमय कर सकता है',//集齊碎片兌換稀有禮物
    giftBox_exchange: 'विनिमय करें',//兌換
    giftBox_noGet: 'आपका उपहार टुकड़ा काफी नहीं है~ चलें और टुकड़ा प्राप्त करें!',//您的禮物碎片不足哦~快去獲取碎片吧！

    //luckBox
    luckBox_title: 'उपहार बॉक्स ',//寶箱獎勵

    //roolMsg
    roolMsg_gx: 'Congratulations to ',//恭喜

    //tabs
    tabArr: [
        {
            name: 'उपहार बॉक्स '
        },
        {
            name: 'उपहार बॉक्स '
        },
        {
            name: 'इमोजी'
        }
    ],


    //turn
    turn_tips1: '$ कॉइन खर्च कर एक ड्रा टिकट प्राप्त सकता है',// 繼續消費$金幣即可獲得一張抽獎券
    turn_newVer: 'इस इनाम का प्रयोग करने के लिए सबसे नया वर्शन अपडेट करना चाहिए',//該獎品需要更新到最新版本才可使用
    turn_noGet: 'आपका ड्रा टिकट काफी नहीं है, चलें और प्राप्त करें!',//您的抽獎券不足哦，快去獲得抽獎券吧！
}