const Lang = {
    Rules: 'الجوائز&القواعد', //獎勵&規則
    ActNot: 'لم يبدأ النشاط', //活動未開始
    ActEnd: 'انتهى النشاط', //活動已結束
    SingUp: 'التسجيل الآن',  //立即報名
    Daily_b: 'نقد اللعبة الحالي: ', //當前可用遊戲幣：
    Score: 'النقاط:',  //分數：                 
    Lv: 'الدردجة.',    // 等級 
    Lv2: 'الدردجة',
    TargetScore: 'النقاط المستهدفة',   //目標分數
    giftItem: 'الجائزة',          //獎勵
    ReceivingSituation: 'حالة الاستلام',       //領取情況
    PlayValue: 'قيمة اللعب:',     //玩樂值    
    Determine: 'عرفت',  //我知道啦
    GradeGift: 'جوائز لدرجات', //等級獎勵    
    Receive: 'الاستلام',  //領取      
    Received: 'تم الاستلام',  //已領取   
    TotalScore: 'نقاط هذه الجولة',//當局分數 
    DownTime: 'العد التنازلي', //倒計時
    CombatantNumber: 'الضرب المستمر',//連擊數
    GameB: 'نقود اللعبة：', //遊戲幣：
    GameB2: 'نقود اللعبة',  //遊戲幣
    duce: 'مرحلة',  //進度
    StartGame: 'بدء اللعبة',  //開始遊戲
    OneGameB: '(20 نقد اللعبة\مرة)', //20遊戲幣/次
    mouseTips1: 'إضافة النقاط بعد ضرب غوفر مع تلسكوب، ونقاط أكثر بعد ضربه مستمرا',  //打擊紫色地鼠加分，連擊分數更高 
    mouseTips2: 'تخفيض النقاط بعد ضرب غوفر مع مجرفة',   //打擊綠色地鼠減分  
    noCoinsTips1: 'رصيد نقد اللعبة لك ليس كافيا، لا يمكن بدئه',//您的遊戲幣餘額不足，無法開始遊戲    
    noCoinsTips2: 'أسرع إلى كسب نقد اللعبة!',  //快去賺取遊戲幣吧！
    //noCoinsTips3: 'Koin game  Anda tidak cukup,gak bisa tebus', //您的遊戲幣餘額不足，無法兌換
    noCoinsTips4: 'رصيد نقد اللعبة لك ليس كافيا، لا يمكن جري اليانصيب', //您的遊戲幣餘額不足，無法抽獎  
    goGetConis: 'ذهاب لكسب نقد اللعبة', //去賺取遊戲幣
    NowScore: 'نقاط هذه الجولة:', //本局獲得分數
    AchieveLv: 'درجتك:',  //達到等級:
    Again: 'جولة قادمة',  //再來一局   
    upgraded: 'عفوا، طبعة تطبيقك قديم، لا يمكن لعب هذا النشاط بهذه الطبعة، تفضل بتحديثه أولا', //抱歉，您的操作系統版本較低，不支持此遊戲請先升級操作系統哦！  ???
    NoSingUp: 'لا يمكن اشتراك هذا النشاط بسبب عدم التسجيل، تفضل بالتسجيل أولا',  //未報名無法參與活動，請先報名哦  ???
    upScoreIng: 'يجري تحميل النقاط، تفضل بالانتظار',  //分數正在上報,請稍等~   ??? 
    tabs1: 'ضرب غوفر سعيدا',  //  歡樂打地鼠
    tabs2: 'القرص الدوار بالحظ',  //  幸運大轉盤
    bottomTabs1: 'كسب نقد اللعبة', //賺取遊戲幣
    bottomTabs2: 'قائمة غوفر سعيد', //歡樂地鼠榜
    bottomTabs3: 'قائمة أول لاعب', //頭號玩家榜
    rankTips: 'حسب النقاط التي تحصل عليها في لعبة ضرب غوفر سعيدا',  //根據歡樂打地鼠項目獲得的分數排名 ?? 
    rankTips2: 'قيمة اللعب = عدد نقود اللعبة المستخدمة',  //玩樂值=使用的遊戲幣數量  ??
    Loading: 'في التحميل',  //加載中...  
    deng: 'تتطلع إليه!',  //敬請期待！ 
    noPeople: 'لا يوجد أي مشترك يدخل في القائمة',  //目前暫無歌友上榜  ?? 
    wait: 'ننتظر إليك',  //虛位以待，等你來哦！ ??
    Invitation: 'دعوة الأصدقاء لدعمك',  //邀請好友加油
    ComeOn: 'مساعدة الأصدقاء على دعمهم', //為好友加油
    dayTask: 'مهام يومية', //每日任務
    reached: 'تم الإكمال',  //已達成   
    lookWhole: 'نظر الكل',  //查看全部
    nowTis: 'المرحلة الحالية',   //當前階段
    GiftHistory: 'تفاصيل اليانصيب', //抽獎記錄
    numB1: '20 نقد اللعبة',  //20遊戲幣
    numB2: '100 نقد اللعبة',  //100遊戲幣
    fiveTips: 'مبروك! تصل إليك الجوائز التالية بعد يانصيبك خمس مرات مستمرة',   //恭喜您連抽5次獲得以下獎品 ?? 
    fiveTips2: 'تصل إلى حسابك، تفضل بالتحقق!',  //獎品已派發到您的賬戶上，請注意查收！
    DetailsOfPrizes: 'تفاصيل الجوائز',//獎品明細
    PrizesTime: 'الوقت',    //抽獎時間
    GetPrizes: 'الجوائز',//獲得的獎品
    noPrizes: 'لا يوجد تسجيل الجوائز الآن',//暫無獲獎記錄  
    ChoiceFriend: 'اختر أصدقاء لدعمهم', //選擇要加油的好友
    TheThree: 'يمكن أن تقوم بدعم 3 أصدقاء كل يوم على أكبر الحد، وأعلى الحد لعدد الأصدقاء للمساعدة على الدعم هو 3 كل يوم    ', //每日最多幫3個好友加油，每日最多被3個好友加油  ???
    ComeOnSuc: 'بعد دعم واحد، يمكن أن تحصل الطرفان على 5 نقود اللعبة.',//幫對方加油一次，雙方均增加5個遊戲幣   ??
    Determine: 'تحديد', //確定
    noFriend: 'لا يوجد أصدقاء يحتاجون إلى الدعم',//暫無需要加油的好友  ?? 
    ComeOned: 'تم الدعم', // 已加油
    fireeComeon: 'الدعم من 3 أشخاص', //已被三人加油  ??
    CommonTips: 'الدعم', // 加油
    queryNoId: 'ابحث عن UID أصدقائك',  //請輸入搜尋ID！  ??
    queryNodata: 'لم يوجد هذا المستخدم، تفضل بتحديد نجاحه في الاشتراك',//沒有搜尋到該用戶</br>請先確認該用戶是否成功參賽唷！  ??
    queryUs: 'لا يمكن البحث عن نفسك',//不能搜尋自己哦！  ??
    CommeonFail: 'فشل في الدعم، يصل عدد دعمك إلى الحد الأكبر، مرحبا بك لدعم أصدقائك غدا',//加油失敗！今日加油次數已達到上限</br>歡迎明天繼續為好友加油喔！ ??
    CommeonSuc: 'نجاح في الدعم، تحصل الطرفان على 5 نقود اللعبة',//加油成功！雙方各增加5個遊戲幣
    CongratulationsOneGift: 'مبروك! تحصل على',//恭喜您成功抽中了
    CongratulationsGoPack: 'تصل إلى حسابك، تفضل بالتحقق!',//已發放到您的賬戶，請查收！
}
export default Lang