export default {
    //html/index.html
    title: "ভাগ্যবান চাকা",
    loading: "লোড হচ্ছে...",
    no_data: "তথ্য নয়",
    end_data: "ডেটা লোড করা হয়েছে",
    draw1:'1 বার ড্র',
    draw10: '10 বার ড্র',
    
    record_title: '7 দিনের খেলার রেকর্ড',
    rank_title: 'আজকের ভাগ্যবান র‍্যাঙ্কিং',
    
    balance_tips: 'কয়েন যথেষ্ট নয়<br />ক্রয় সম্পন্ন করতে অক্ষম',
    go_value: 'রিচার্জ করতে যান',
    
    awards_title: 'পেয়েছেন',
    ok:'নিশ্চিত',
    
    rule_title:'গেমপ্লে বিধি',
    rule: [
        'একটি লাকি ড্র শুরু করতে কয়েন ব্যয় করুন, এবং পুরস্কারগুলি আপনার অ্যাকাউন্টে অবিলম্বে জারি করা হবে!',
        'প্রোপের সময়কাল 30 দিন। আপনি যদি একই প্রপস একাধিকবার পান, সময়কাল জমা হবে!',
        'উপহারটি 15 দিনের জন্য বৈধ, এবং মেয়াদ শেষ হওয়ার তারিখের পরে পাঠানো না হলে উপহারটি ব্যাকপ্যাক থেকে সরানো হবে!',
        'এই গেমপ্লেটির  Apple সাথে কোন সম্পর্ক নেই, এবং সমস্ত ব্যাখ্যার অধিকার প্ল্যাটফর্মের মালিকানাধীন!',
    ],

    //html/app_share.ejs
    share_title: 'ভাগ্যবান টার্নটেবল',
    share_desc: '',
}