export default {
    title: 'उपहार चुनौती का नियम',//禮物挑戰規則
    tips:[
        '1. उपहार चुनौती शुरू करने के बाद, माइक का प्रयोग किया उपयोगकर्ता प्राप्त उपहार के अनुसार चुनौती स्कोर गिनें, समय सीमा समाप्त के बाद स्कोर के अनुसार परिणाम देखें;',
        '2. अटैक उपहार देने से स्कोर कम कर सकता है, कॉइन उपहार देने से स्कोर बढ़ कर सकता है, स्कोर ऋणात्मक संख्या हो सकता है;',
        '3. यह चुनौती स्वचालित लूप में होती है, हर सोलो उपयोगकर्ता को स्कोर चुनौती करनी चाहिए, कोरस आर्डर के लिए अनुपलब्ध है;',
        '4. खेल स्थित बदलने के बाद अगली बार में लागू है, इस बार पर प्रभावित नहीं है;',
        '5. उपहार चुनौती पर रूम मोड प्रभाव करता है, यदि मोड बदलें, तब उपहार चुनौती अनिवार्य रूप में बंद होगा, वर्तमान उपयोगकर्ता रैंक में स्थान नहीं ले पाता',
    ]
}