export default {
    //html/index.html
    need_coins: "你的金幣不足哦~",
    title: "趣味射氣球",
    noAct: "活動未開始",
    actEd: "活動已結束",
    ok: "確認",
    rule_tab1: "規則",
    rule_tab2: "獎勵",
    noData: "暫無數據",
    //balloon
    balloon_one: "射一次",
    balloon_ten: "射十次",
    // ballTips:
    //     " 長按砲台可調整角度，鬆手後即射出彈珠/飛鏢，彈珠砲台50金幣/次，飛鏢砲台100金幣/次",
    balloon_tab1: "彈珠炮台",
    balloon_tab2: "飛鏢炮台",
    queryTips: " 使用【%a】射擊%b次氣球，需要消耗%c金幣",
    cancel: "我再想想",
    determine: "確定射擊",
    prizeTips: "恭喜擊中",
    prizeTips2: "神射手降臨！你擊中了大獎勵～",
    getEd: "開心收下",
    bean: "金幣",
    coins: "金豆",
    //footer
    hitValue: "命中值",
    shoot: "射氣球",
    //Grand
    no_people: "虛位以待",
    grandTips: " 在射氣球的過程中，有可能射中氣球大獎（2000-10000金幣）",
    grandTips2: "飛鏢砲台射中機率更高",
    //index
    rule_tips: "規則獎勵",
    rule_tips2: "我的獎品",
    //rule
    rule_tm: "活動時間：6月11日 20：00-6月18日23：59：59",
    rule_item: [
        {
            h6: "趣味射氣球",
            p: [
                "1、投入金幣即可參與射氣球，彈珠砲台50金幣/次，飛鏢砲台100金幣/次，100%中獎；有機會擊中金豆、金幣、背包禮物（招財喵、幸運鵝）、氣球大獎（2000-10000金幣）"
            ],
            img: require("./img/ruleTable.png")
        },
        {
            h6: "射手排行榜規則",
            p: [
                "1、彈珠砲台和飛鏢砲台共用一個射手榜",
                "2、射手榜按照命中值從高到低排序，若命中值一致，則先達到的優先",
                "3、射中的獎勵提供指定的命中值",
                "射氣球所得的1金豆=1命中值、1金幣=1命中值、1個背包禮物=200命中值"
            ]
        },
        {
            h6: "射手排行榜獎勵",
            giftList: [
                {
                    img: require("../../img/rule_gift1.png"),
                    name: "超級射手-勛章"
                },
                {
                    img: require("../../img/rule_gift2.png"),
                    name: "紫色魅影-座駕"
                }
            ],
            p: [
                "第一名：超級射手-認證（7天）+超級射手-勛章（10天）+紫色魅影-座駕（10天）",
                "第二名：超級射手-勛章（7天）+紫色魅影-座駕（7天）",
                "第三名：超級射手-勛章（5天）+紫色魅影-座駕（5天）"
            ]
        },
        {
            h6: "注意事項",
            p: [
                "1、活動中，若發現玩家用不正當手段參與活動，小音有權在不事先通知的情況下按情節嚴重對參與玩家、違規者取消上榜資格、封禁賬號、收回該玩家所有獎勵等處罰，包括但不限於：",
                "a）不正當獲得金幣、活動指定禮物，並惡意刷分",
                "b）活動期間對參與活動的玩家進行惡意攻擊、造謠",
                "2、活動中送出的所有禮物有效期均為7天",
                "3、本活動與蘋果公司無關"
            ]
        }
    ]
};
