export default {
    //html/index.html
    title: "عجلة الحظ",
    loading: "جار التحميل...",
    no_data: "لايوجد بيانات",
    end_data: "تم تحميل البيانات",
    draw1:'1 مرة',
    draw10: '10 مرات',
    
    record_title: 'سجل اللعبة لمدة 7 أيام',
    rank_title: 'ترتيب اليوم المحظوظ',
    
    balance_tips: 'رصيد غير كافٍ من العملات الذهبية <br /> لا يمكن إتمام عملية الشراء',
    go_value: 'اذهب لإعادة الشحن',
    
    awards_title: 'تهانينا على الحصول على',
    ok:'تأكيد',
    
    rule_title:'قواعد اللعب',
    rule: [
        'أنفق مبلغًا معينًا من العملات الذهبية لبدء السحب ، وستُضاف الجوائز التي تم ربحها إلى حسابك على الفور!',
        'مدة مورد المتجر هي 30 يومًا. إذا حصلت على نفس مورد المتجر عدة مرات ، فسيتم تجميع مدة المورد!',
        'مورد الهدية صالح لمدة 15 يومًا ، وستتم إزالة الهدية من الحقيبة إذا لم يتم إرسالها بعد تاريخ انتهاء الصلاحية!',
        'جميع حقوق التفسير مملوكة للمنصة!',
    ],

    //html/app_share.ejs
    share_title: 'عجلة الحظ',
    share_desc: '',
}