export default {
    //html/index.html
    title: "交友禮包,限時領取",
    ruleTips: "規則獎勵",
    day: "天",
    getEd: "已獲得",
    charge: "立即儲值",
    chareTips: "在平台首儲達到%c金幣，可獲得交友禮包喔",
    chareTips2: "平台首儲<em>%c</em>金幣以上",
    chareTips3: "*首儲金額為一次性儲值金額，<em>非</em> 累積儲值金額",
    tm: "活動時間:",
    ruleTipsMsg1: "交友禮包",
    ruleTipsMsg2:
        "在活動期間內完成平台的首次儲值達到指定金幣數，可獲得對應的交友禮包，交友禮包僅可獲得一次，每檔獎勵不疊加。<br />劃卡特權說明：此特權可挑選劃卡喜歡我的人立即配對聊天，擁有特權期間無互動時間限制，可隨時立即聊天。點擊APP-配對頁右上方的愛心圖標，即可查看誰喜歡我。",
    ruleTipsMsg3: "注意",
    ruleTipsMsg4:
        " - 活動中，若發現玩家用不正當手段參與活動，小音有權在不事先通知的情況下按情節嚴重對參與玩家、封禁帳號、收回玩家所有獎勵等處罰，包括但不限於：<br />a) 活動期間對其他玩家惡意評論、造謠、映射等<br />b)非法獲得金幣、指定禮物<br />-此活動與蘋果公司無關",
    ruleTipsMsg5: "*活動最終解釋權歸活動主辦方所有"
};
