const lang = {
    rule: '活動規則',  //活動規則
    detail: '領取詳情',//領取詳情
    Invitation: '填邀請碼',//填邀請碼
    noStart: '活動未開始', //活動未開始
    actEnd: '活動已結束', // 活動已結束
    ok: '我知道了',
    nowVip: '當前會員等級',  //当前会员等级
    ci: '剩餘抽獎次數',//剩余抽奖次数
    goVip: '增加次數', //增加次数
    thankGift: '刮獎次數已用完，</br>馬上購買會員增加次數',   //感谢你为好友助力，你获得礼包
    buyTime: '購買時長',  //购买时长
    buyNum: '抽獎次數',  //购买次数
    timeTips: '個月',//月
    year: '年', // 年
    buy: '購買', //购买
    showCodeTitle: '完成神秘任務,領取神秘獎勵',//完成神秘任务，领取神秘奖励
    codeTips1: '邀請好友下載歡歌或高歌，成功註冊和登錄，進入活動頁面，右上角輸入妳的邀請碼，若1位好友成功為你助力，你將可以領取獎勵。',
    inivCode: '我的邀請碼：',//我的邀请码
    goIniv: '分享',//去邀请
    inivTips1: '成功邀请1個好友獎勵20金幣', //送20 金币
    inivTips2: '註意：邀請的好友不得使用同設備或同IP的賬號，否則助力無效，邀請的好友必須是活動開始後新註冊的用戶，且不能為其他人成功助力過。',
    luckEd: '刮到', //刮到
    share1: '免費下載', //免费下载
    share2: '我正在參加歡歌的會員特權週活動，現在下載APP，成功註冊登錄，在活動頁面輸入邀請碼，為我助力吧。', //我正在参加活动
    shareCode: '邀請碼', //邀请码
    shareCode2: '長按複製', //长按复制
    share3: '助力步骤指引',
    share4: '前去助力', // 去助力
    detailTitle: '領取詳情',//领取详情
    detailTime: '領取時間', //领取时间
    detailGifts: '獎品', // 奖品
    detailState: '獎品狀態',//奖品状态
    noData: '暫無數據',//暂无数据
    giftEnd: '已領取', //已领取
    taskTitle: '神秘任務',//神秘任务
    taskCode: '邀請碼', // 邀请码
    coinsTwo: '領取20金幣', //领取20金
    goShare: '去邀請', //去邀请
    sucCode: '成功填寫邀請碼',//成功填写邀请码
    main1: '填寫好友邀請碼，</br>你將獲得1份助力禮包。',//填写好友邀请码
    main2: '邀請碼',//邀请码
    main3: '長按粘貼',//长按粘贴
    main4: '提交', //提交
    main5: '恭喜你獲得以下禮物', //获得的礼物
    main6: '確定',//确定
    zsGift: '恭喜你獲得VIP專屬禮物',//恭喜你获得VIP专属礼物
    otherGift: '恭喜獲得', // 恭喜获得X
    shareTips: '長按複製這條連接粘貼發送給其他軟件上的朋友請他為你助力', // 
    zsOk: '我知道了',//好
}
export default lang