<template>
  <div class="rules">
    <p class="activeTime"><strong>وقت بدء النشاط:</strong>12:00 في يوم 12 من أكتوبر-16:00 في يوم 19 من أكتوبر بتوقيت دبي</p>
    <h4>القواعد</h4>
    <div class="wardTop">
      <p>1. انقر فوق زر تسجيل صفحة النشاط للمشاركة في النشاط ، وسيتم احتساب قائمة الشعبية وبيانات قائمة الدعم بعد نجاح التسجيل.</p>
      <p>2. المستخدم في غرفة الغناء لتلقي الهدايا أو الهدايا للحصول على قيمة الدعم / شعبية ، يتم تصنيف القائمة وفقا للقيمة المقابلة ، والحساب على النحو التالي:</p>
      <p>قائمة الشعبية: قيمة الشعبية = قيمة السحر المكتسبة في غرفة الغناء خلال الحدث</p>
      <p>خلال الحدث ، سيحصل الأشخاص الخمسة الذين يقدمون الهدايا في غرفة الغناء على 5/4/3/2/1٪ من إجمالي قيمة الشعبية.</p>
      <p class="yingyuan">قائمة الدعم: قيمة الدعم = قيمة المساهمة للمتسابقين في غرفة الغناء خلال الحدث</p>
      <p>3. خلال الحدث ، سيتم استلام الهدية أو تقديمها ، وستزداد قيمة الهدية بنسبة 5٪ ، وهدايا الدعم هي: بالون الدعم (10 عملة ذهبية) ، بطاقة الدعم الخفيفة (100 عملة ذهبية) ، التركيز الكامل (1255 عملة ذهبية)</p>
      <p>العشرة الأوائل في القائمة تلقت الجائزة ، بنفس القيمة ، في المرتبة الأولى وصول عالية.</p>
    </div>
    <h4>ملاحظة
    </h4>
    <p>1. يمكن للمستخدم نفسه تسجيل حساب واحد فقط للمشاركة في النشاط ، ولا يسجل عدد مانح الهدايا تسجيل بيانات مستخدم متعددة لنفس الجهاز.</p>
    <p>2. إذا وجد المستخدم أي انتهاك للقواعد ، فسيتم إلغاء مؤهلات ومكافآت نشاط المستخدم مباشرةً.</p>
    <div class="bottmMsg">
      التفسير النهائي لهذا النشاط ينتمي إلى منظم الحدث
    </div>
  </div>
</template>

<script>
export default {

}
</script>

<style lang="scss" scoped>
.rules {
  padding-bottom: 1rem;
  h4 {
    margin-top: 0.7rem;
    color: #ffefbb;
    font-weight: 600;
  }
  .activeTime {
    margin-top: 0.51rem;
    text-align: right;
    font-size: 80%;
    strong {
      display: block;
      text-align: right;
      color: #ffefbb;
      font-weight: 600;
      margin-bottom: 0.24rem;
    }
  }
  .wardTop {
    .topTitle {
      font-size: 88%;
      color: #19ffe7;
      margin-top: 0.3rem;
    }
    > h5 {
      font-size: 75%;
      margin-top: 0.2rem;
    }
    p {
      font-size: 80%;
    }
    .yingyuan {
      margin: 0.2rem 0;
    }
  }
  p {
    margin-top: 0.1rem;
    line-height: 0.36rem;
    font-size: 80%;
  }
  .bottmMsg {
    text-align: center;
    font-size: 80%;
    color: #f4a2ff;
    margin-top: 0.87rem;
  }
}
</style>
