export default {
    //html/index.html
    title: 'समझौता',

    // router/index
    page_data: 'डेटा शर्तों को पूरा है',
    page_bind: 'फ़ोन नंबर से जोड़ें',
    page_apply: 'समझौता का आवेदन करें',
    page_agreement: 'प्लेटफार्म लाइसेंस समझौता',

    // Index
    sign: 'समझौता करें',
    signed: 'समझौता किया',
    sign_rule: 'समझौता का विवरण:',
    sign_rule_1: '1. बिना समझौता किया उपयोगकर्ता डायमंड कमाई की निकासी कर नहीं सकता, केवल कॉइन का विनिमय कर सकता है, और हर बार कम से कम 20000 डायमंड से विनिमय करना चाहिए;',
    sign_rule_2: '2. उपयोगकर्ता समझौता करने के बाद तो डायमंड कमाई की निकासी कर सकता है, जो उपयोगकर्ता का समझौता लेवल ऊंचा है उसका निकासी अनुपात और कॉइन का विनिमय अनुपात अधिक ऊँचा है, और हर बार न्यूनतम 100 डायमंड से विनिमय कर सकता है।',

    // Task
    data_name: 'डेटा शर्तों को पूरा है, समझौता करें',
    data_desc: 'शर्तों को पूरा करने के बाद समझौता का आवेदन कर सकता',
    bind_name: 'फ़ोन नंबर से जोड़ें',
    bind_desc: 'कृपया फ़ोन नंबर से जोड़ें',
    sign_name: 'अभी समझौता करें',
    sign_desc: 'विशेष फंक्शन का मज़ा लें',
    do: 'पूरा करें',
    done: 'पूरा है',
    sign_tips: 'पिछली दो शर्तों को पूरा नहीं किया\nसमझौता कर न सकता',
    ok: 'ठीक है',

    // Bind
    bind_succ: 'आपका खाता जोड़ दिया गया\nफ़ोन नंबर: %s',

    // Data
    count_title: 'शर्तों को पूरा करने के लिए',
    count_income: 'डायमंड कमाई',
    count_numbers: '（{0}/{1}）',
    count_time: 'यह सांख्यिकीय अवधि {0} {1} से {2} {3} तक है\nअगली अवधि शुरू होने के लिए {4} दिन बाकी हैं, कृपया चक दे',
    done_tips: 'आपने शर्तों को पूरा किया, \nजल्दी समझौता का आवेदन करें',
    undone_tips: 'आपने शर्तों को पूरा नहीं किया, \nअभी समझौता का आवेदन कर नहीं सकता',
    done_give: 'समझौता करने के बाद यह प्राप्त सकता:',
    done_give_1: '1. डायमंड कमाई की निकासी कर सकता है, जो उपयोगकर्ता का समझौता लेवल ऊंचा है उसका निकासी अनुपात अधिक ऊँचा है;',
    done_give_2: '2. विनिमय अनुपात अधिक ऊँचा है, और हर बार न्यूनतम 100 डायमंड से विनिमय कर सकता है।',

    // Apply
    apply_title: 'अगला:',
    apply_desc: 'समझौता करने के लिए अवतार कार्ड की जांच करनी चाहिए, जांच करने के बाद स्वीकृत और आवेदन करना सफल है',
    card_title: 'हाथ में आधार कार्ड रखिए और नमूना ग्राफ के अनुसार फोटो खींचे',
    card_desc: 'पहचान सत्यता की पुष्टि के लिए आपको पहचान की जांच करनी चाहिए,\nकृपया नमूना ग्राफ के अनुसार फोटो प्रस्तुत करें, यदि कोई नकली फोटो है तो खाते को हमेशा के लिए लॉक होगा।',
    re_upload: 'पुनः भेजें',
    upload_title: 'कृपया फोटो पुनः भेजें',
    upload_desc: 'अपलोड करने के बाद हम जल्दी जांच करेंगे',
    agree_agreement: 'समझौता का आवेदन करना मतलब यह है कि',
    apply_agreement: '《प्लेटफार्म लाइसेंस समझौता》से सहमत करेगा',
    submit_apply: 'प्रस्तुत और समझौता का आवेदन करें',
    card_submited: 'फोटो भेज किया गया\nदुबारा मत करो\nसीधे समझौता का आवेदन कर सकता',

    // Result
    re_submit: 'पुनः आवेदन करें',
    result_checking: 'आवेदन भेजना सफल है\nहम जल्दी जांच करेंगे',
    result_success: 'आपको समझौता करने की बधाई हो',
    result_fail: 'आपका आवेदन इनकार दिया गया',
    result_fail_reason: 'कारण: %s',
    result_fail_contact: 'अधिक जानने के लिए कृपया आधिकारिक ID%s से संपर्क करें',
    result_reject: 'आपका आवेदन अनुपलब्ध है, हम जल्दी ही एंकर के लिए समझौता की घोषणा करेंगे, कृपया इंतजार करें।',
    sign_give: 'समझौता करने के बाद यह प्राप्त सकता:',
    sign_give_1: '1. पोस्ट कार्य या अपने रूम को अधिक सुझाव मिलेंगे;',
    sign_give_2: '2. अधिक दर्शक और फैंस को मिलेंगे;',
    sign_give_3: '3. डायमंड कमाई की निकासी कर सकता है, जो उपयोगकर्ता का समझौता लेवल ऊंचा है उसका निकासी अनुपात अधिक ऊँचा है;',
    sign_give_4: '4. विनिमय अनुपात अधिक ऊँचा है, और हर बार न्यूनतम 100 डायमंड से विनिमय कर सकता है।',
}