<template>
  <div class="rule">
    <div class="activeTime">
      <p>وقت النشاط</p>
      <p>وقت النشاط:4/23 12:00- 4/29 23:00 (بتوقيت دبي)</p>
    </div>
    <div class="ruleBox">
      <h5>القواعد </h5>
      <p>1. انقر فوق زر تسجيل صفحة النشاط ، ويحتاج صاحب الغرفة إلى ملء رقم الغرفة للتسجيل بنجاح ، وسيتم احتساب بيانات قائمة غرفة الغناء وقائمة المساهمة بعد نجاح التسجيل.</p>
      <p>2. تعتمد قائمة غرفة الغناء على الترتيب التراكمي لقيمة سحر غرفة الغناء ، ويتم ترتيب قائمة المساهمة وفقًا لقيمة العملة الذهبية للمساهمة.</p>
      <p>3. في قائمة غرفة الغناء ، تصبح الغرفة ذات أعلى قيمة لقيمة السحر هي أفضل غرفة للغناء ، حيث أصحاب الغرفة الثلاثة سيحصلون المكافئة ، وتلقى العشرة الأوائل من قائمة المساهمة مكافأة سخية.</p>
    </div>
    <div class="order">
      <h5> ملاحظة</h5>
      <p>1. يمكن للمستخدم نفسه تسجيل حساب واحد فقط للمشاركة في النشاط ، ولا يسجل عدد مانح الهدايا تسجيل بيانات مستخدم متعددة لنفس الجهاز.</p>
      <p>2. إذا وجد المستخدم أي انتهاك للقواعد ، فسيتم إلغاء مؤهلات ومكافآت نشاط المستخدم مباشرةً.</p>
      <p>3.نقدم نسخة الأيفون و اسمه KaraYo، و هو نفس تطبيق سوبر فويس، لكنه خاص بالأيفون. مرحبا لكم لتحميله في متجر التطبيقات للأيفون ,و دعوة أصدقائك.</p>
    </div>
    <p class="tips">التفسير النهائي لهذا النشاط ينتمي إلى منظم الحدث</p>
  </div>
</template>
<script>
export default {

}
</script>
<style  lang="scss" scoped>
.activeTime {
  text-align: center;
  margin-top: 0.47rem;
}
h5 {
  font-size: 140%;
  color: #ffdb5e;
  text-align: center;
  margin-top: 0.37rem;
}
.ruleBox {
  padding: 0 0.24rem;
  p {
    color: #e8ceff;
  }
}
.order {
  padding: 0 0.24rem;
  p {
    color: #e8ceff;
  }
}
.tips {
  padding: 0 0.24rem;
  text-align: center;
  color: #646dff;
  font-size: 120%;
  margin-top: 2rem;
}
</style>
