<template>
  <div class="ward">
    <div class="activeTime">
      <p>وقت النشاط</p>
      <p>الساعة 12 يوم 24 مارس- الساعة 23 يوم 30 مارس (بتوقيت دبي)</p>
    </div>
    <h5>الجوائز</h5>
    <div class="wardBox">
      <h6>قائمة غرفة الغناء </h6>
      <p>صاحب الغرفة الأولي : سيارة الدخول الرائع(14 يوم) + 1500 عملة ذهبية+اطار الغرفة "البطل"(14 يوما)</p>
      <p>صاحب الغرفة الثانية : سيارة الدخول الرائع(14 يوم) + 1200 عملة ذهبية+اطار الغرفة "الشجاع"(14 يوما)</p>
      <p>صاحب الغرفة الثالثة : سيارة الدخول الرائع(14 يوم) + 1000 عملة ذهبية+اطار الغرفة "المحارب"(14 يوما)</p>
    </div>
    <div class="gongx">
      <h5>قائمة المساهمة </h5>
      <h6>المركز الاول</h6>
      <p>شارة غرفة الغناء (30 يومًا) + هدية باقة الوردة للحقيبة 5 * (510 عملة ذهبية) + 15% من عملاته الذهبية المستهلكة خلال فترة النشاط + +اطار أفصل داعم (14 يوما)</p>
      <h6>المركز الثاني</h6>
      <p>شارة غرفة الغناء (30 يومًا) + هدية باقة الوردة للحقيبة 3 * (510 عملة ذهبية) + 10% من عملاته الذهبية المستهلكة خلال فترة النشاط + +اطار أفصل داعم (14 يوما)</p>
      <h6>المركز الثالث</h6>
      <p>شارة غرفة الغناء (30 يومًا) + هدية باقة الوردة للحقيبة 2 * (510 عملة ذهبية) + 8% من عملاته الذهبية المستهلكة خلال فترة النشاط + +اطار أفصل داعم (14 يوما)</p>
      <h6>المركز 4-10</h6>
      <p>شارة غرفة الغناء (30 يومًا) + هدية باقة الوردة للحقيبة 1 * (510 عملة ذهبية) + 5% من عملاته الذهبية المستهلكة خلال فترة النشاط + +اطار أفصل داعم (14 يوما)</p>
      <p> ملاحظة: سوف تُعطَى هذه الجوائز أثناء خمسة الأيام بعد انتهاء النشاط</p>
    </div>
    <p class="tips">التفسير النهائي لهذا النشاط ينتمي إلى منظم الحدث</p>
  </div>
</template>
<script>
export default {

}
</script>
<style lang="scss" scoped>
.activeTime {
  text-align: center;
  margin-top: 0.47rem;
}
h5 {
  font-size: 140%;
  color: #ffdb5e;
  text-align: center;
  margin-top: 0.37rem;
}
.wardBox {
  padding: 0 0.24rem;
  h6 {
    font-size: 110%;
    color: #ffdb5e;
  }
  p {
    color: #e8ceff;
  }
}
.gongx {
  padding: 0 0.24rem;
  margin-top: 0.39rem;
  h5 {
    font-size: 110%;
    color: #ffdb5e;
    text-align: right;
  }
  h6 {
    color: #c9ffe2;
  }
  p {
    color: #e8ceff;
  }
}
.tips {
  padding: 0 0.24rem;
  text-align: center;
  color: #646dff;
  font-size: 120%;
  margin-top: 2rem;
}
</style>
