<template>
  <div class="wards">
    <p class="activeTime">الوقت:12:00 في يوم 11 من نوفمبر-23:00 في يوم 18 من نوفمبر بتوقيت دبي</p>
    <h5>جوائز لقائمة الأعمال</h5>
    <div class="wardTop">
      <h5>المركز الأول:</h5>
      <p>هدية كاروسيل الحصان للحقيبة*5(ثلاثون يوما) + شارة ملك الهدايا(ثلاثون يوما) + VIP لثلاثين يوما + 3000 عملة + 3000 فول</p>
      <h5>المركز الثاني:</h5>
      <p>هدية كاروسيل الحصان للحقيبة*3(ثلاثون يوما) + شارة ملك الهدايا(عشرون يوما) + VIP لثلاثين يوما + 2000 عملة + 2000 فول</p>
      <h5>المركز الثالث:</h5>
      <p>هدية كاروسيل الحصان للحقيبة*1(ثلاثون يوما) + شارة ملك الهدايا(عشرة أيام) + VIP لثلاثين يوما + 1000 عملة + 1000 فول</p>
      <h5>المراكز 4-5:</h5>
      <p>شارة ملك الهدايا(عشرة أيام) + VIP لثلاثين يوما + 1000 عملة + 1000 فول</p>
      <h5>المراكز 6-10:</h5>
      <p>VIP لثلاثين يوما + 800 عملة + 800 فول</p>
    </div>
    <h5>جوائز لقائمة غرفة الغناء</h5>
    <div class="kRoomTop">
      <h5>المركز الأول:</h5>
      <p>هدية كاروسيل الحصان للحقيبة*5(ثلاثون يوما) + شارة ملك الهدايا(ثلاثون يوما) + VIP لثلاثين يوما + 3000 عملة + 3000 فول</p>
      <h5>المركز الثاني:</h5>
      <p>هدية كاروسيل الحصان للحقيبة*3(ثلاثون يوما) + شارة ملك الهدايا(عشرون يوما) + VIP لثلاثين يوما + 2000 عملة + 2000 فول</p>
      <h5>المركز الثالث:</h5>
      <p>هدية كاروسيل الحصان للحقيبة*1(ثلاثون يوما) + شارة ملك الهدايا(عشرة أيام) + VIP لثلاثين يوما + 1000 عملة + 1000 فول</p>
      <h5>المراكز 4-5:</h5>
      <p>شارة ملك الهدايا(عشرة أيام) + VIP لثلاثين يوما + 1000 عملة + 1000 فول</p>
      <h5>المراكز 6-10:</h5>
      <p>VIP لثلاثين يوما + 800 عملة + 800 فول</p>
    </div>
    <h5>جوائز لقائمة الشعبية</h5>
    <div class="peopleTop">
      <h5>المركز الأول:</h5>
      <p>هدية الملاك الحارس للحقيبة*1(ثلاثون يوما) + شارة الملك الشعبي(ثلاثون يوما) + VIP لثلاثين يوما + 1500 عملة + 1500 فول</p>
      <h5>المركز الثاني:</h5>
      <p>هدية الملاك الحارس للحقيبة*1(ثلاثون يوما) + شارة الملك الشعبي(عشرون يوما) + VIP لثلاثين يوما + 1000 عملة + 1000 فول</p>
      <h5>المركز الثالث:</h5>
      <p>هدية الملاك الحارس للحقيبة*1(ثلاثون يوما) + شارة الملك الشعبي(عشرة أيام) + VIP لثلاثين يوما + 800 عملة + 800 فول</p>
      <h5>المراكز 4-5:</h5>
      <p>شارة الملك الشعبي(عشرة أيام) + VIP لثلاثين يوما + 600 عملة + 600 فول</p>
      <h5>المراكز 6-10:</h5>
      <p>VIP لثلاثين يوما + 300 عملة + 300 فول</p>
    </div>

    <h5>جائزة إعادة العملات:</h5>
    <div class="fanhuan">
      <p>1.إهداء هدايا حمص(10 عملات) وكباب(59 عملة) كبس(299 عملة) للأعمال المشتركة، سوف تصل إليك 5% عملات من الهدايا التي تهديها في 00:00 في اليوم القادم. مثلا، إذا تهدي هدية كبس لعمل مشترك ما، فستصل إليك 15 عملة في 00:00 في اليوم القادم</p>
      <p>2.إهداء هدايا الشاي الأسود(10 عملات) وفلافل(59 عملة) وشرائح البقر(299 عملة) في غرفة الغناء، سوف تصل إليك 5% عملات من الهدايا التي تهديها في 00:00 في اليوم القادم. مثلا، إذا تهدي هدية شرائح البقر في غرفة الغناء، فستصل إليك 15 عملة في 00:00 في اليوم القادم</p>
    </div>

    <h5>وصف للجوائز:</h5>
    <p>1. ستُعَطى هدية كاروسيل الحصان للحقيبة وهدية الملاك الحارس للحقيبة في حقيبة الفائزين. يمكن للمستخدمين بنظام أندرويد أن يستخدموا هذه الهدية بعد تحميل أحدث طبعة لSuper Voice</p>
    <p>2. سوف تُعطَى هذه الجوائز أثناء خمسة الأيام بعد انتهاء النشاط</p>
    <p class="btnMsg">التفسير النهائي لهذا النشاط ينتمي إلى المنظم</p>
  </div>
</template>

<script>
export default {

}
</script>

<style lang="scss" scoped>
.wards {
  p {
    font-size: 80%;
    line-height: 0.36rem;
  }
  .activeTime {
    color: #fff;
    text-align: center;
    margin-top: 0.51rem;
  }
  > h5 {
    text-align: center;
    font-size: 120%;
    color: #ffe65a;
    margin-top: 0.57rem;
  }
  .wardTop {
    > h5 {
      color: #b9fffb;
      font-size: 80%;
      margin-top: 0.2rem;
    }
    p {
      color: #fff;
      font-size: 80%;
    }
  }
  .kRoomTop {
    > h5 {
      color: #b9fffb;
      font-size: 80%;
      margin-top: 0.2rem;
    }
    p {
      color: #fff;
      font-size: 80%;
    }
  }
  .peopleTop {
    > h5 {
      color: #b9fffb;
      font-size: 80%;
      margin-top: 0.2rem;
    }
    p {
      color: #fff;
      font-size: 80%;
    }
  }
  .fanhuan {
    p {
      color: #fff;
      margin-top: 0.27rem;
    }
  }
  p {
    color: #fff;
  }
  .btnMsg {
    margin-top: 0.2rem;
    text-align: center;
  }
}
</style>
