const wardsImg = {
    1 : "ward1",   //語聊房揹包禮物
    2 : "ward2", //作品揹包禮物
    3 : "ward3", //Ｋ房揹包禮物
    4 : "ward4", //3%储值返利券   4
    5 : "ward4", //5%储值返利券   4
    6 : "ward4", //10%储值返利券  4
    7 : "ward5", //150返30送礼返利券
    8 : "ward6", //500返120送礼返利券
    9 : "ward7", //1000返300送礼返利券
    10: "ward8", //50老虎币
    11: "ward9", //100老虎币
    12: "ward10", //150老虎币
    13: "ward11", //10金币
    14: "ward12", //20金币  12
    15: "ward12", //30金币  12
    16: "ward12", //50金币  12
    17: "ward12", //60金币 12
    18: "ward13", //20金豆  
    19: "ward14",  //50金豆 
    20: "ward15", //80金豆  15
    21: "ward15", //100金豆 15
    22: "ward15", //150金豆 15
    23: "ward15", //200金豆
    24: "ward16", //骑士贵族
    25: "ward17", //子爵贵族
    26: "ward18", //伯爵贵族
    27: "ward19", //会员3天
    28: "ward20", //8位靓号
    29: "ward21" //double卡
}
export default wardsImg