export default {
    //html/index.html
    title: 'लाटरी', //抽奖
    page_start: 'Initiator',//發起者:
    page_noLuck: 'अभी लाटरी नहीं है',//當前暫無抽獎
    page_luckIng: 'लाटरी कर रहा है...',//正在抽獎...
    page_downTime: 'काउंटडाउन',//倒計時
    page_lc: 'बधाई हो:',  //恭喜：
    page_gift: 'पुरस्कार:',//獎品：
    page_gift_tips: '',//送出X即可參加抽獎(印尼全在後半句)
    page_gift_tips2: 'देकर लाटरी में शामिल कर सकते हैं',

    //common
    common_loading: 'लोड रहा है...', // 加載中...
    common_ok: 'पुष्टि करें', //确定
    common_no: 'रद्द करें', //取消
    common_day: 'दिन',//天
    common_min: 'मिनट', //分钟
    common_tips: 'टिप',//提示
    // common_bead: 'Beans',//金豆
    // common_coins: 'Coins',//金幣
    common_noData: 'कोई डेटा नही',//列表为空

    //setting
    setting_instructions: 'नियम ',//抽獎玩法
    setting_tips1: 'आपने पुरस्कार खरीदने के लिए संबंधित कॉइन खर्च किए, और जब उपयोगकर्ता नामित उपहार देता है तब वह लाटरी में शामिल कर सकता है। काउंटडाउन समाप्त के बाद लाटरी ड्रा करेगा, जो सभी शामिल करने वाले में से एक चुनकर उससे संबंधित पुरस्कार देंगे। यदि कोई भी लाटरी में भाग नहीं लेता है, तो पुरस्कार शुरू करने वाले का है।',// 由你發起抽獎並支付一定金幣購買VIP會員或K房禮 物作爲抽獎獎品在倒計時間內，房間內的用戶送出 你指定的抽獎資格禮物即可獲得抽獎機會，倒計時 結束立即開獎，抽取其中一名參與者爲得獎者，獲 得你的獎品。無人參與則獎品歸發起人所有。
    setting_tips2: '1.आपके द्वारा निम्नलिखित पुरस्कार चुनता और कॉइन खर्च है, जिससे लाटरी शुरू कर सकता है।',// 1.由你選擇以下抽獎獎品，並支付對應金幣，可發起抽獎
    setting_tips3: '2.काउंटडाउन के दौरान में जब उपयोगकर्ता नामित उपहार देता है तब वह लाटरी में शामिल कर सकता है। काउंटडाउन समाप्त के बाद लाटरी ड्रा करेगा, जो सभी शामिल करने वाले में से एक चुनकर उससे पुरस्कार देंगे।', //2.在倒計時間內，房間內的用戶送出參與方式指定的抽獎入場券禮物即可獲得抽獎機會，倒計時結束立即開獎，抽取其中一名參與者爲得獎者，獲得你的獎品。
    setting_tips4: '3.यदि कोई भी लाटरी में भाग नहीं लेता है, तो पुरस्कार शुरू करने वाले का है।',//3.無人參與則獎品歸發起人所有。

    setting_type: 'भाग लेने का तरीका:  ', //參與方式：送出A參與抽獎 
    setting_type2: 'दे दें',
    setting_seniority: 'जरूरी शर्तें', // 抽獎資格
    setting_noSet: 'सेट नहीं',//未設置
    setting_giftSet: 'पुरस्कार चुनें',//獎品選擇
    setting_who: 'कौन भाग ले सकते हैं',//誰可參與
    setting_every: 'सभी',//所有人
    setting_other: 'माइक के उपयोग में उपयोगकर्ता',//麥上用戶
    setting_start: 'लाटरी शुरू करें',//開始抽獎
    setting_cGift: 'पुरस्कार चुनें',//選擇抽獎獎品
    setting_vipTips: 'VIP की महीने संख्या चुनें (यदि पहले ही VIP है तो समय संचित होगा) ',//選擇VIP會員月數（已是會員獲得獎品則疊加時長）
    setting_query: 'खरीदने के लिए $ खर्च करने की पुष्टि करें और लाटरी शुरू करें?',//確認支付X購買獎品,並發起抽獎？
    // setting_vip: ' VIP membership',  //VIP
    // setting_gift: 'Platform gift', //禮物
    // setting_car: 'Cars', //座駕
    // setting_frame: '', //頭飾
    // setting_card: '', //名片
    // setting_theme: '',//主題
    setting_commit_tips1: 'कृपया जरूरी शर्तें चुनें!',//請選擇抽獎資格！
    setting_commit_tips2: 'कृपया पुरस्कार चुनें!',//請選擇獎品！
    setting_commit_tips3: 'लाटरी शुरू किया',//抽獎已發起

    //history
    history_title: 'लाटरी रिकॉर्ड',//抽獎記錄
    history_startPeople: 'ने लाटरी',//发起
    history_startPeople2: 'शुरू किया',//抽奖
    history_open: 'लाटरी ड्रा करें',//開獎
    history_threeDay: 'केवल इन 3 दिनों में शुरू किया लाटरी दिखाता ह',//僅顯示最近3天發起的投票

    history_bigLuck: 'सबसे बड़ा पुरस्कार मिला!',//抽到了大獎！
    history_eligibility: 'लाटरी के लिए ज़रूरी शर्तें', // 抽獎資格
    history_startP: 'शुरू करने वाला:',//發起者:
    history_jionsNums: 'भाग लेने लोग:',//參與人數:
    history_tips: '$ उपहार देने से % लाटरी मौका मिलता है',//送出$份禮物，獲得%個抽獎機會

    //config
    tabArr: ["VIP सदस्य", "उपहार", "गाड़ी", "हेडवेअर", null, "नामकार्ड", "विषय "],
    giftType: {
        coin: 'कॉइन',
        bean: 'पॉइंट',
        free: ''
    }
}