export default {
    //html/index.html
    title: "दोस्तों को आमंत्रित कर कैश कमाए", //
    no_start: "इवेंट शुरू नहीं", // 活动未开始
    //index.html
    rule_tips: "नियम व इनाम", // 规则靓丽
    inviteCodeTips: "इनविटेशन कोड", //填写邀请码
    open_type1_title: "कैश पैक ", //领SingStar红包
    exllBtn1: "निकासी>", //提现
    exllBtn2: "विनिमय>", //兑换
    my_money: "मेरे पैसे", //我的余额
    money: "रुपए", // 印度卢比
    exCoinsNeed: "कॉइन का विनिमय करने के लिए <em>$</em> रुपए की ज़रूरत; ", //还差X卢比可以兑换金币
    exMoneyNeed: "निकासी के लिए <em>$</em> रुपए की ज़रूरत", // 还差X卢比可以兑换现金
    share: "  दोस्तों को आमंत्रित कर कैश कमाए", //邀请好友注册领现金
    myCode: " इनविटेशन कोड दर्ज करें:", //我的邀请吗
    code_tips: " कॉपी के लिए लॉन्ग प्रेस", // 长按复制
    //shareCodePup
    share_title: "सिंगस्टार में आने का स्वागत है", // 欢迎来到singStar
    share_tips:
        "दोस्त का इनविटेशन कोड दर्ज करेंताकि दोस्त को कैश इनाम मिल सकेगा", //输入好友邀请码，让好友增加现金
    ok: " ठीक है", //确认

    //exCoins
    exCoins_title: "बधाई हो! अभी विनिमय कर सके", //恭喜达到兑换门栏
    exCoins_tips1: " प्राप्ति रुपए:", //现有
    exCoins_tips2: " 1 रुपए 10 कॉइन का विनिमय कर सके", //1卢比兑换10金币
    exCoins_tips3: "जितने रुपए आप विनिमय करना चाहते हैं, उतने दर्ज़ करें", //输入要兑换的卢比数，取整
    lubi: "रुपए",
    coins: "कॉइन",

    //exMoney
    exMoney_tips1: " बधाई हो! आप नकद निकासी कर सके", //恭喜达到提现门栏
    exMoney_next: "अगला", //下一步
    exMoney_tips2: "निकासी के लिए जानकारी पूरा करें", //填写提现资料
    exMoney_tips3: "निकासी राशि:", //提现卢比
    exMoney_tips4: "प्राप्ति रुपए:", //现有卢比
    exMoney_tips5:
        "निकासी राशि दर्ज़ करने के बाद, आधिकारिक कर्मचारी uid 10 आपसे संपर्क कर बैंक खाते की जानकारी को इकट्ठा करेंगे। इवेंट ख़त्म होने के बाद 7 वर्किंग दिन में कृपया आधिकारिक कर्मचारी uid 10 के मैसेज पर धयान दीजिए। ", //确认提现数值后，xxxx
    exMoney_tips6: "सूचना:", //提示
    exMoney_tips7:
        "बैंक ट्रांसफर का प्रोसेस जटिल है; नकद निकासी के लिए सिंगस्टार सेवा शुल्क नहीं चार्ज करता है। इसलिए कृपया ऐसे झूठ की चेतावनी दीजिए जो सेवा शुल्क की मांग करने वाला।", //银行转账的流程，XXXX
    exMoney_qurey: "सबमिट करें", //确认提交
    exMoney_cancel: "वापस करें", //返回上一步
    id10Tips:
        "सबमिट किया गया, कृपया आधिकारिक कर्मचारी uid 10 के मैसेज पर धयान दीजिए~", //已提交成功，联系ID：10  xxx
    code_suc_tips: "दर्ज किया गया, दोस्त का कैश इनाम बढ़ाया", //输入成功，好友现金增加

    shareHtml_title: "SingStar खेलो और पैसे कमाओ !", //玩singstar赚现金，印度免费xxx
    shareHtml_con:
        "इंडियन ऑनलाइन फ्री Karaoke सोशल एप्प ! मज़े के साथ कैश भी कमा सकते हो ! मेरी इनविटेशन कोड टाइप करो：", //不仅好玩还能赚钱，输入我的邀请码xxx
    shareHtml_tip1: "सिंगस्टार डाउनलोड करके इवेंट पेज में देंखें ", //下载singStar进入活动页面
    shareHtml_tip2: "इनविटेशन कोड दर्ज करें: ", //输入邀请码
    shareHtml_tip3: "जिससे दोस्त कैश कमा सके", //即可帮好友转现金
    shareCode_pvalue: "दोस्त का इनविटेशन कोड दर्ज करें", //输入好友邀请吗
    //roolMsg
    rool_get: "को", //获得
    rool_gift: "रुपए का इनाम मिला", // 路币奖励

    //rule
    rule_title: "नियम व इनाम",
    rule_tm: "इवेंट अवधि: 26 मार्च 18:00:00 से 26 अप्रैल 20:00:00 तक",
    rule_tab1: "इनाम",
    rule_tab2: "आमंत्रण नियम",
    rule_tips_h5: "इनाम",
    rule_tips_p1:
        "इवेंट में जब यूजर कॉइन पैक खोल कर कुल-मिलाकर 30 रुपए प्राप्त करते हैं, तब विनिमय कर सके। और 500 रुपए प्राप्त करके नकद निकासी कर सके। प्राप्ति रुपए यदि इवेंट खत्म होने से पहले विनिमय या नकद निकास नहीं किया जाता है, तब अमान्य हो जाएगा।",
    rule_tips_h52: "आमंत्रण नियम",
    rule_tips_p2:
        " जो यूजर ने इवेंट में भाग लिया, उसका एक विशेष इनविटेशन कोड है। इवेंट के दौरान में यदि एक नया यूजर सिंगस्टार में रजिस्टर करने के तीन दिनों में दोस्त का इनविटेशन कोड दर्ज़ करता है, तब सफल रूप में आमंत्रण करने को माना जाता है। जब भी किसी नए यूजर को सफलतापूर्वक आमंत्रित किया जाता है, तो पैसे बढ़ जाएगा।",
    rule_tips_h4: "नोटिस",
    rule_tips_p3:
        "1. इवेंट में यदि हम एसे यूज़रों से मिलते हैं जो अवैध तरीक़े से इवेंट में भाग लेता है, हम अधिकारी के एसा अधिकार है जो बिना सूचना दिए उस यूज़र को इवेंट से निकाल दे सकते हैं और उसे चेतावनी दे, खाता को ब्लॉक कर तथा इनाम वापस कर सकते हैं। जैसे:",
    rule_tips_p4: "ए) कई खातों द्वारा इवेंट में भाग लेते",
    rule_tips_p5: "बी) इवेंट में दूसरे यूजर को गाली या बुरी टिप्पणी देते",
    rule_tips_p6:
        "2. एक ही डिवाइस या एक ही IP पर लॉगिन हुआ कई खाते को दूसरा खाता माना जाता है। दूसरे खाते द्वारा इवेंट में भाग ले नहीं सकता।",
    rule_tips_p7:
        "*सिंगस्टार इवेंट के लिए अंतिम व्याख्या का अधिकार सुरक्षित रखते हैं।"
};
