<template>
  <div class="rule">
    <h5>年度人物評選</h5>
    <h6>活動時間：</h6>
    <p>2020年11月10日18:00:00-12月28日20:00:00</p>
    <h6>活動攻略：</h6>
    <p>評選項目為十大女歌手，十大男歌手，十大MV，十大單曲項目，項目根據評選選手或評選作品獲得的評選票的高低進行排名，玩家可在【盛典嘉年華】中的【抽獎好禮多】子活動獲取歡卡，使用歡卡可為喜歡的選手或作品投票，每個評選項目每人每天限投1張</p>
    <h5>盛典嘉年華</h5>
    <h6>活動時間：</h6>
    <p>2020年11月10日18:00:00-12月28日20:00:00</p>
    <h6>活動攻略：</h6>
    <p>1.抽獎好禮多——完成每日任務賺取盛典幣抽獎，其中抽中的歡卡可在【年度人物評選】活動投票</p>
    <p>2.助攻MVP——送1金幣禮累積1助攻值，積累助攻值可領取寶箱獎勵</p>
    <p>3.禮物冠名——收到特定禮物個數最高的用戶，獲得該禮物的冠名權（冠名信息展示在禮物購買面板中）。收集禮物還可解鎖等級獎勵</p>
    <p>4.12%儲值返利——在11月26日感恩節及12月25日聖誕節當天儲值任意金幣即送12%返利金幣</p>
    <p>5.高光時刻——在年度最強家族戰、年度魅力歌王大賽、年度C位爭奪賽、年度K房男神女神活動指定日期內的21:00:00-21:10:00，獲得的分數額外加成10%</p>
    <h5>年度魅力歌王大賽</h5>
    <h6>活動時間：</h6>
    <p>2020年11月16日18:00:00-11月25日 20:00:00</p>
    <h6>活動攻略：</h6>
    <p>魅力歌王大賽活動攻略</p>
    <p>1、點擊報名發佈歌曲參賽，根據閃耀值排名。閃耀值=作品收到點讚數+作品收到金幣禮物魅力值。收到特定禮物、活動期間21:00:00-21:10:00內收禮、2020年作品總收金幣禮排名前100名魅力值可獲得加成 </p>
    <p>2、參賽作品每收到100個“玫瑰花束”禮物，即爆1088金幣的紅包</p>
    <p>3、參賽作品在發佈後48小時內收到50000金幣魅力值的禮物，APP內的歡歌榜分數飆升20%</p>
    <p>4、積累閃耀值升級可領取寶箱獎勵</p>
    <h5>年度K房男神女神賽</h5>
    <h6>活動時間：</h6>
    <p>2020年11月23日18:00:00-12月4日23:00:00</p>
    <h6>活動攻略：</h6>
    <p>1、活動將分為男神賽道和女神賽道進行，海選賽根據報名用戶的金幣魅力值+人氣值進行排名，各賽道前100名用戶可晉級應援賽；</p>
    <p>2、應援賽根據晉級用戶的金幣魅力值排名，各賽道前十個獲得50萬金幣魅力值的用戶將直接晉級，應援賽結束時各賽道其餘金幣魅力值前10的用戶再晉級；</p>
    <p>3、巔峰之夜在官方K房11天天歡歌中上麥演唱可獲得額外20%魅力值加成，當晚選出2020年度K房男神女神！</p>
    <h5>年度C位爭奪賽</h5>
    <h6>活動時間：</h6>
    <p>11月30日18:00:00-12月11日23:00:00</p>
    <h6>活動攻略：</h6>
    <p>1.簽約者默認參加比賽，非簽約用戶若在海選賽段期間申請簽約成功，也默認參加比賽 </p>
    <p>2.比賽分為海選、1v1對戰、團戰、出道決戰四個賽段。前三個賽段將以人氣值高低排名，人氣值排名靠前的可以晉級下一輪比賽；出道決戰賽段以出道值爭高低，最終出道值排名前11位的參賽者將在本次比賽成功出道 </p>
    <p>3.每個賽段榜單排名靠前的選手可獲得相應的賽段榜單獎勵；最終出道的11名參賽者將獲得更加豐厚的出道獎勵，其中第1名C位出道者將受邀參與慶功演唱會並獲得相應的現金分成</p>
    <h5>年度主持人巔峰戰</h5>
    <h6>活動時間：</h6>
    <p>2020年12月7日18:00:00-12月25日23:00:00</p>
    <h6>活動攻略：</h6>
    <p>1、活動海選賽段將根據報名用戶上主持麥所在房間的金幣和K房狂歡趴活動時間內上主持麥的時長計算巔峰值，海選賽巔峰值前一百的選手可晉級資格賽；</p>
    <p>2、資格賽根據晉級用戶的巔峰值+人氣值進行排名，每日末位10名用戶將失去晉級總決賽的資格；</p>
    <p>3、最後20名主持將於官方K房11天天歡歌，接受大眾和評委的評選，選出2020年度主持人！</p>
    <h5>年度最強音</h5>
    <h6>活動時間：</h6>
    <p>2020年12月11日18:00:00-12月18日20:00:00</p>
    <h6>活動攻略：</h6>
    <p>1.曾獲得好聲音前300名、擂台賽季前300名的選手可點擊報名參與比賽，參賽後每個UID僅可發佈一首獨唱作品參賽 </p>
    <p>2.已報名的作品均能進入大眾評審環節，比賽採取大眾評審盲評機制，以評比時間內參賽作品累計的總分作為排名依據</p>
    <p>3.排名前10的參賽者可獲得豐厚獎勵，排名前3的參賽者將受邀參與慶功演唱會並獲得相應的現金分成；評委可獲得金豆獎勵</p>
    <h5>年度最強家族戰</h5>
    <h6>活動時間：</h6>
    <p>12月14日12:00:00-12月25日20:00:00</p>
    <h6>活動攻略：</h6>
    <p>1、所有家族自動報名最強家族戰，守護家族賽段根據家族成員完成家族任務和收禮金幣魅力值進行排名，前300名家族可以晉級下一賽段</p>
    <p>2.家族PK賽段隨機匹配家族進行PK，家族特定禮物有3%加成，PK雙方中分數較高的家族晉級第三賽段</p>
    <p>3.家族爭霸賽段，根據家族成員收禮金幣魅力值計算排名，年度積分前五十的家族在本賽段有6%-10%的加成，最終評選出年度最強家族！</p>
    <h5>年度演唱會</h5>
    <h6>活動時間：</h6>
    <p>1月2日 20:00:00-22:00:00</p>
    <h6>活動攻略：</h6>
    <p>將邀請各個活動的優勝者參與年度演唱會，參加年度演唱會者將有機會獲得20%的分成以及各類珍稀禮物~</p>
  </div>
</template>

<script>
export default {
  created() {
    document.title = '規則&獎勵'
  }
}
</script>

<style lang="scss">
body {
  background-color: rgba(10, 6, 5, 1);
  .rule {
    padding: 0 0.3rem;
    h5 {
      font-size: 0.32rem;
      color: rgba(255, 229, 125, 1);
      font-weight: 600;
      text-align: center;
      margin-top: 0.59rem;
    }
    h6 {
      color: rgba(255, 204, 114, 1);
      font-size: 0.28rem;
      margin: 0.25rem 0 0.18rem;
    }
    p {
      font-size: 0.28rem;
      color: rgba(255, 255, 255, 1);
      opacity: 0.6;
    }
  }
}
@import "../../assets/scss/common.scss";
</style>
