export default {
    title: "財富等級", //財富等級
    privilege_title: "等級特權", //等級特權
    require_title: "等級經驗要求", //等級經驗要求
    wealthExp: "財富值", //財富值
    disc: "還需要%s升級", //還需要110升級
    privilege: [
        {
            title: "等級圖標",
            unlock: "Lv.1解鎖",
            tips:
                "等級圖標將展示在房間的公屏發言、資料卡片中，達到的等級越高，等級圖標越尊貴。"
        },
        {
            title: "進場秀",
            unlock: "Lv.10解鎖",
            tips:
                "進入房間時將展示進場秀，重複進同一個房間10分鐘內僅出現一次，達到的等級越高，進場秀越尊貴。"
        },
        {
            title: "專屬客服",
            unlock: "Lv.30解鎖",
            tips: "尊享專屬客服，24小時貼心服務，解決困擾你的問題。"
        },
        {
            title: "敬請期待",
            unlock: ""
        }
    ],
    proLevel: ["達到Lv.10", "達到Lv.20", "達到Lv.30", "達到Lv.40", "達到Lv.50"],

    proLevelIcon: [
        "達到Lv.1~9",
        "達到Lv.10~19",
        "達到Lv.20~29",
        "達到Lv.30~39",
        "達到Lv.40~49",
        "達到Lv.50"
    ],

    level_title: "等級說明", //等級說明
    level_explain_tips:
        "財富等級共50級，應用內通過贈送金幣禮物（背包禮物除外）、商城購買道具等行為，<i>每消耗1金幣增加1點財富值</i>，累計財富值提升等級，即可解鎖等級特權。",
    level_explain_ul: [
        "以下規定互動行為增加財富值不同：",
        "1、贈送“幸運星”禮物時，消耗1金幣增加0.8點財富值；",
        "2、房間內21點下註時，消耗1金幣=0.2財富值；",
        "3、參與官方活動玩法時，消耗1金幣=0.05~0.1財富值",
        "4、開通”查看喜歡我的”的特權，每開通1個月增加2000點財富值。"
    ],
    type1: "財富等級", //財富等級
    type2: "財富值", //財富值
    type3: "升級所需", //財富等級
    call: "聯繫專屬客服", //聯繫專屬客服

    svga_tips: "小音 進入房間"
};
