export default {
    //html/index.html
    title: "快樂扭蛋機",
    race: "稀有",
    rank_day: "天",
    rank_hour: "時",
    rank_min: "分",
    rank_second: "秒",
    history_title: "扭蛋記錄",
    roolmsg: "恭喜【%n】扭到%s",
    actEnd: "活動已結束",
    ruleTm: "活動時間：",
    //hisrory
    getedNums: "已獲得券數:",
    historyTips1: "成功開啟扭蛋，獲得【%n】稀有禮物*%c",
    historyTips2: " 成功開啟扭蛋，獲得【%n】*%c",
    historyTips3: "  獲得扭扭券*%c",

    //index
    ruleTips1: "規則獎勵",
    ruleTips2: "扭蛋記錄",
    downTime: "結束倒計時:",
    openNums: "開啟次數:%c次",
    chageTips: '儲值每滿<em>%s</em>送 <i class="ticketIcon"> </i> 一張',
    luckPupTitle1: "恭喜獲得以下禮物",
    luckPupTitle2: "恭喜獲得%n稀有禮物",
    luckPupTitle3: "恭喜獲得%n禮物",
    get: "收下",
    getTicket: "獲得扭扭券%c張",
    ticketTips: "快去扭一扭吧",
    openType: {
        1: {
            num: 1,
            str: "再扭一次"
        },
        10: {
            num: 10,
            str: "再扭十次"
        },
        20: {
            num: 20,
            str: "再扭二十次"
        }
    },
    noTicket: "扭扭券不足！",
    //rule
    rule_title: "規則",
    rule_tips1: "規則介紹",
    rule_tips2:
        "玩家單筆儲值每滿500金幣可以獲得扭扭券一張（如儲值1300金幣可獲得2張扭扭券，直接在扭扭券计數器可以看到當前扭扭券持有券數），每張扭扭券有一次扭蛋開啟機會。開啟扭蛋機可選擇開一次、開十次、開二十次三個按鈕。",
    rule_tips3: "獎勵及其概率",
    rule_tips4:
        "玩家開啟扭蛋，每次開啟必中獎勵，獎勵有金豆、魅力值禮物、金幣禮物、送禮返利券、儲值返利券、稀有金幣禮物。<br />當抽獎進行到第30次，此前玩家未抽中稀有禮物小貓咪，則在第30次必定抽中一次稀有禮物小貓咪；當抽獎進行到第100次，此前玩家未抽中稀有禮物星落如雨，則在第100次必定抽中稀有禮物星落如雨一次，當抽獎進行到第300次，此前玩家未抽中稀有禮物雨生盆栽，則在第300次必定抽中稀有禮物雨生盆栽一次。<br />每抽到一個稀有禮物，將解鎖下一個新的稀有禮物。每個玩家活動期間稀有禮物小貓咪、星落如雨、雨生盆栽獲得機會均只有一次。<br />下表是啟動扭蛋機后能抽中的獎勵禮物及其概率：",
    rule_tips5: "金幣消費返利券&儲值返利券使用說明：",
    rule_tips6:
        " 1.金幣消費返利券（滿1000返100）：獲獎當天消費滿1000金幣，在次日可獲得100的金幣返利，一張券只可以返利一次。獲得當天有效。<br />金幣消費返利券（滿150返30）：獲獎當天消費滿150金幣，在次日可獲得30的金幣返利，一張券只可以返利一次。獲得當天有效。<br />當抽到兩種金幣消費返利券時，按最高面額進行返利，且當天內只能返利一次。<br />2.3%儲值返利券：獲獎當天儲值任意金幣，在次日可獲得3%的金幣返利（不可疊加返利比例）。獲得當天有效。<br />5%儲值返利券：獲獎當天儲值任意金幣，在次日可獲得5%的金幣返利（不可疊加返利比例）。獲得當天有效。",
    rule_tips7: "注意",
    rule_tips8:
        "- 活動中，若發現玩家用不正當手段參與活動，小音有權在不事先通知的情況下按情節嚴重對參與玩家、封禁帳號、收回玩家所有獎勵等處罰，包括但不限於：<br/>a) 活動期間對其他玩家惡意評論、造謠、映射等<br/>b)非法獲得金幣、指定禮物",
    rule_tips9: "-此活動送出的禮物有效期均為7天，請盡快送出哦",
    rule_tips10: "-此活動與蘋果公司無關，本活動最終解釋權歸活動主辦方所有"
};
