const wards = {
    1: "هدية الإضاءة لك للدردشة",   //語聊房揹包禮物
    2: "هدية عصا الجنية للأعمال", //作品揹包禮物
    3: "هدية سيارة التاج للغناء", //Ｋ房揹包禮物
    4: "تذكرة إعادة %3 عملات للشحن", //3%储值返利券
    5: "تذكرة إعادة %5 عملات للشحن", //5%储值返利券
    6: "تذكرة إعادة %10 عملات للشحن", //10%储值返利券
    7: "تذكرة إعطاء 30 عملة بعد استهلاك 150 عملة", //150返30送礼返利券
    8: "تذكرة إعطاء 120 عملة بعد استهلاك 500 عملة", //500返120送礼返利券
    9: "تذكرة إعطاء 300 عملة بعد استهلاك 1000 عملة", //1000返300送礼返利券
    10: "50 نقد الفتحة", //50老虎币
    11: "100 نقد الفتحة", //100老虎币
    12: "150 نقد الفتحة", //150老虎币
    13: "10 عملة", //10金币
    14: "20 عملة", //20金币
    15: "30 عملة", //30金币
    16: "50 عملة", //50金币
    17: "60 عملة", //60金币
    18: "20 فول", //20金豆
    19: "50 فول",  //50金豆
    20: "80 فول", //80金豆
    21: "100 فول", //100金豆
    22: "150 فول", //150金豆
    23: "200 فول", //200金豆
    24: 'دراجة(7 أيام)',//自動車座駕
    25: 'دراجة نارية(7 أيام)',//YAMAHA座駕
    26: 'طائرة الهجوم الحمراء(7 أيام)',//赤鹰战机座驾（7天）
    27: "VIP(ثلاثة أيام)", //会员3天
    28: 'سيارة فيراري(30 يوما)',//红色法拉利座驾（30天）
    // 28: "7位数靓号", //8位靓号
    29: "بطاقة التضاعف" //double卡
}
export default wards