export default {
    noAct: "इवेंट शुरू नहीं",
    actEd: "इवेंट ख़त्म है",
    rule: "विवरण",
    history: "विनिमय रेकोर्ड",
    rule1:
        "इवेंट में केवल वर्तमान दिन का टास्क देख सकता है, अगले दिनों का टास्क देख नहीं सकता।",
    rule2:
        "दैनिक ऑफर्स और टास्क का इनाम केवल वर्तमान दिन में प्राप्त कर सकता है! अगले दिन में अनुपलब्ध है!",
    rule3:
        "इवेंट की अवधि में कृपया जल्दी विनिमय करें, नहीं तो इवेंट खत्म होने के बाद ख़ाली होगा।",
    rule4:
        "इस इवेंट की अवधि $ है, इवेंट में भाग लेने से डेटा की गिनती शुरू होगी।",
    task: "टास्क",
    convertibility: "विनिमय",
    loading: "लोड रहा है...",
    noOpen: "अभी अनुपलब्ध है, कृपया बने रहें!",
    loginTitle: "लॉगिन ऑफर्स",
    nowDayTitle: "दैनिक टास्क",
    receive: "प्राप्त करें",
    dayTasksTitle: "दैनिक टास्क",
    converGiftTitle: "इनाम",
    converNum: "दिन में अधिकतम: X",
    converNum2: "दिन में अधिकतम: X",
    dayEd: "विनिमय किया",
    singUp: "भाग लें",
    ok: "ठीक है",
    // noSingUp: 'Mời báo danh trước~',
    openBoxTime: "समय",
    gift: "इनाम",
    historyTitle: "विनिमय रेकोर्ड",
    singUpSuc: "भाग लिया गया",
    noSuc: "पूरा नहीं है",
    dayNoOpen: "अभी अनुपलब्ध है, कृपया बने रहें!",
    noChpin: "टुकड़ा काफी नहीं है, जल्दी टुकड़े प्राप्त करें!",
    noDayRev:
        "दैनिक ऑफर्स और टास्क का इनाम केवल वर्तमान दिन में प्राप्त कर सकता है!",
    noData: "डेटा नहीं है!"
};
