<template>
  <div class="rule">
    <div class="tabs">
      <span :class="{act:showType == 'wards'}" @click="clickTab('wards')">الجوائز</span>
      <span :class="{act:showType == 'rules'}" @click="clickTab('rules')">القواعد</span>
    </div>
    <div class="ward" v-show="showType == 'wards'">
      <p class="actTime">الوقت:12:00 في يوم 19 من ديسمبر-23:00 في يوم 26 من ديسمبر(توقيت دبي)</p>
      <div class="wardImg"></div>
      <h3>جوائز لأفضل 10 في قائمة إجمالية لمهرجان</h3>
      <div class="rankTop10">
        <h6>المركز الأول:</h6>
        <p>شارة عيد الميلاد السعيد(30 يوما)+سيارة ظبي عيد الميلاد(30 يوما)+هدية عيد الميلاد السعيد مع التأثير الخاص لغرفة الغناء(888 عملة)+5000 فول</p>
        <h6>المركز الثاني:</h6>
        <p>شارة عيد الميلاد السعيد(15 يوما)+سيارة ظبي عيد الميلاد(30 يوما)+هدية عيد الميلاد السعيد مع التأثير الخاص لغرفة الغناء(888 عملة)+3000 فول</p>
        <h6>المركز الثالث:</h6>
        <p>شارة عيد الميلاد السعيد(7 يوما)+سيارة ظبي عيد الميلاد(30 يوما)+هدية عيد الميلاد السعيد مع التأثير الخاص لغرفة الغناء(888 عملة)+2500 فول</p>
        <h6>المركز 5-4:</h6>
        <p>شارة عيد الميلاد السعيد(7 يوما)+سيارة ظبي عيد الميلاد(30 يوما)+هدية عيد الميلاد السعيد مع التأثير الخاص لغرفة الغناء(888 عملة)+2000 فول</p>
        <h6>المراكز 10-6:</h6>
        <p>سيارة ظبي عيد الميلاد(30 يوما)+هدية عيد الميلاد السعيد مع التأثير الخاص لغرفة الغناء(888 عملة)+1000 فول</p>
      </div>
      <h3>المكافآت لقائمة يومية لمهرجان</h3>
      <div class="wardImg2"></div>
      <h3>جائزة لحزمة عيد الميلاد اليومية</h3>
      <div class="dayBar">
        <h6>وصول نقاط اليوم إلى 70:</h6>
        <p>تسجيل لأيام أكثر، وفول الجائزة أكثر. كمية الفول كالجائزة=100+10*عدد الأيام المتتالية لتسجيل
          </br>مثلا:الوصول 1 يوم استمرارا، 110 فول لجائزة، الوصول 2 يومين استمرارا، 120 فول لجائزة،.....، الوصول 8 أيام استمرارا، 180 فول لجائزة</p>
        <h6>وصول نقاط اليوم إلى 90:</h6>
        <p>قد تكون الجائزة:هدية ندفة الثلج لعيد الميلاد(2 عملات)*1، أو سيارة الدراجة(ثلاثة أيام)، أو سيارة الدراجة النارية(ثلاثة أيام)</p>
        <h6>وصول نقاط اليوم إلى 130:</h6>
        <p>هدية واحدة من مجموعة هدايا عيد الميلاد(10 عملة)، كيمة هدايا عيد الميلاد هي 8، لا تتكرر كل يوم، لا تفوتك</p>
        <h6>وصول نقاط اليوم إلى 150:</h6>
        <p>هدية عشوائية من ثلاث هدايا سابقة نلتها اليوم*2</br>
          مثلا: إذا نلت ثلاث هدايا سابقة هي 150 فول وهدية ندفة الثلج لعيد الميلاد(2 عملات)*1 وهدية جورب عيد الميلاد(10 عملة)*1، فمن الممكن أن تحصل على 300 فول أو هدية ندفة الثلج لعيد الميلاد(2 عملات)*2 أو هدية جورب عيد الميلاد(10 عملة)*2</p>
      </div>
      <h3>قواعد استخدام الجوائز</h3>
      <p>1.صلاحية هذه الهدايا للجوائز هي 14 يوما، تستخدمها أثناء الصلاحية</p>
      <p>2.يمكن وجود هدايا الحقيبة في 【أنا-حقيبة】لنظام أندرويد</p>
      <p>"3.يمكن وجودها في 【أنا-حقيبة】. لا يمكن استخدام وظيفة السيارة إلا في طبعة 6.8.0.682 لنظام أندرويد، أسرع إلى التحديث!</p>
    </div>
    <div class="rules" v-show="showType == 'rules'">
      <p class="actTime">الوقت:12:00 في يوم 19 من ديسمبر-23:00 في يوم 26 من ديسمبر(توقيت دبي)</p>
      <h3>القواعد</h3>
      <h6>التسجيل:</h6>
      <p>1.انقر ""التسجيل الآن"" لاشتراك المسابقة</p>
      <p>2.بعد نقر "التسجيل الآن"،يمكن رفع أعمالك للاشتراك في النشاط(غير أغنية sing a cappella) في إعلان النشاط. سيجري إحصاء هدايا الأعمال بعد تسجيلك. إذا تحذف أعمالك المشتركة في النشاط أثناء وقت النشاط، فدرجاتك لهذه الأعمال تكون تافهة</p>
      <h3>قواعد الترتيب لقوائم النشاط</h3>
      <h6>قائمة إجمالية لمهرجان:</h6>
      <p>1.حسب قيمة المهرجان بعد التسجيل، قيمة المهرجان=نقاط+قيمة السحر من هدايا تتلقاها في الأعمال أو غرفة الغناء</p>
      <p>2.تحصل على نقاط عن طريق إكمال المهام اليومية</p>
      <p>3.كلما تحصل على هدية في غرفة الغناء أو الأعمال بقيمة عملة واحدة، ستكسب 10 قيم المهرجان</p>
      <p>4. إذا تحصلون على نفس قيمة المهرجان، فيُضَع ترتيب من توصل إلى هذه القيمة قبل اآخرين أمامهم</p>
      <p>5. تظهر القائمة درجات أفضل 100 فقط</p>
      <h6>قائمة يومية لمهرجان:</h6>
      <p>1.يمكن دخول قائمة يومية لمهرجان بعد وصول قيمة مهرجانك إلى 3000</p>
      <p>2.لك فرصة لتنال نسبة نيل مجموعة هدايا عيد الميلاد(80 عملة)*1 وسيارة ظبي عيد الميلاد(7 أيام) بعد دخول القائمة اليومية المكافأة=قيمة مهرجانك ذلك اليوم\قيمة جميع المستخدمين الذين دخلوا القائمة اليومية. قيمة المهرجان اليومية أكثر، فنسبة نيل المكافأة أكبر.</p>
      <p>3.يحتل عدد من ينال المكافأة %20 من جميع المستخدمين الذين دخلوا القائمة اليومية</p>
      <p>4.سيختار النظام قائمة الذين ينالون المكافأة في 24:00:00 كل يوم، وفي آخر اليوم للنشاط، سيتم الاختيار في وقت الانتهاء، هذه المكافآت ستصل إلى حسابك تلقائيا</p>
      <p>الملاحظة:لا نعطي مكافأة إضافية لمن يرتب بالمركز المتقدم في القائمة اليومية لمهرجان</p>
      <h6>كسب النقاط:</h6>
      <p>يمكن كسب النقاط من خلال إكمال المهام المعينة، بعد الإكمال، ستصل إليك النقاط تلقائيا، والنقاط اليومية ستمسح كل يوم
        </br>مهام يومية ونقاطها:</p>
      <div class="tasKImg"></div>
      <h6>جائزة يومية لعيد الميلاد:</h6>
      <p>1.تنقسم النقاط اليومية إلى أربع درجات:70 و90 و130 و150. كلما تصل إلى الدرجة المعينة، ستحصل على الجائزة المعنية، وستصل إليك هذه الجائزة تلقائيا</p>
      <p>2.تفضل باستلام هذه الجائزة في الموعد عند اليوم، وإلا ستكون غير فعالية بعد اليوم</p>
      <h3>الآخر</h3>
      <p>أثناء المسابقة ، إذا تبين أن المستخدم يستخدم الوسائل غير المناسبة للمشاركة في النشاط ، يحق للمسؤول إلغاء المؤهل دون إشعار مسبق ، وفي الحالات الشديدة ، سيتم حظر رقم حساب المشارك ، بما في ذلك على سبيل المثال لا الحصر:</p>
      <p>1. أعمالك المشتركة لا تغنيها نفسك أو تستخدم تسجيل الآخرين</p>
      <p>2. تسرق حساب الآخرين أو تستعيره لاشتراك في المسابقة</p>
      <p>3. تفتح حسابات كثيرة لاشتراك في المسابقة</p>
      <p>4. تعلق على آخر المستخدمين بالكلمات السيئة أو ترسلهم إعلانات في فترة النشاط</p>
      <p>5. تشترك في النشاط عن طريق غير لائق</p>
      <div class="tips">إذا تغش في المسابقة، لحق للمنظم أن يحظر كل حساباتك، ويلغي جوائزك التي تكتسب في المسابقة</div>
      <div class="tips">التفسير النهائي لهذا النشاط ينتمي إلى المنظم</div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      showType: 'wards'
    }
  },
  methods: {
    clickTab(val) {
      this.showType = val
    }
  }
}
</script>

<style lang="scss">
body {
  background-color: #cf3052;
  direction: rtl;
}
.actTime {
  font-size: 80%;
  color: #ffefd7;
  margin: 0.36rem 0 0.28rem;
  text-align: center;
}
.rule {
  padding-top: 0.28rem;
  .tabs {
    width: 6.67rem;
    height: 0.88rem;
    background: url(../../assets/img/tabsBg.png);
    background-size: 100% 100%;
    display: flex;
    align-items: center;
    justify-content: center;
    margin: 0 auto;
    span {
      display: block;
      width: 3.57rem;
      height: 0.85rem;
      text-align: center;
      line-height: 0.85rem;
      &.act {
        background: url(../../assets/img/tuleTabaAct.png);
        background-size: 100% 100%;
      }
    }
  }

  h3 {
    width: 4.86rem;
    height: 0.9rem;
    line-height: 0.9rem;
    background: url(../../assets/img/h3Bg.png);
    background-size: 100% 100%;
    margin: 0.29rem auto 0;
    text-align: center;
    color: #ffeabe;
  }
  h6 {
    color: #ffae00;
    font-size: 80%;
    margin-top: 0.2rem;
  }
  p {
    color: #ffd3dc;
    font-size: 73%;
  }
  .rules {
    padding: 0 0.22rem 0.7rem;
  }
  .ward {
    padding: 0 0.22rem 0.7rem;
    .wardImg {
      width: 7.05rem;
      height: 5.05rem;
      background: url(../../assets/img/wardImg.png);
      background-size: 100% 100%;
      margin: 0 auto;
    }
    p {
      color: #ffd3dc;
      font-size: 73%;
    }
    .rankTop10 {
      h6 {
        color: #ffae00;
        font-size: 80%;
        margin-top: 0.2rem;
      }
      p {
        color: #ffd3dc;
        font-size: 73%;
      }
    }
    .dayBar {
      h6 {
        color: #ffae00;
        font-size: 80%;
        margin-top: 0.2rem;
      }
      p {
        color: #ffd3dc;
        font-size: 73%;
      }
    }
    .wardImg2 {
      width: 6.6rem;
      height: 5.67rem;
      background: url(../../assets/img/wardImg2.png);
      background-size: 100% 100%;
      margin: 0 auto;
    }
  }
  .tips {
    margin-top: 0.25rem;
    color: #ffd3dc;
    font-size: 73%;
  }
  .tasKImg {
    width: 6.83rem;
    height: 6.93rem;
    background: url(../../assets/img/taskImg.png);
    background-size: 100% 100%;
    margin: 0.15rem auto;
  }
  .clearfix:after {
    content: "";
    height: 0;
    line-height: 0;
    display: block;
    visibility: hidden;
    clear: both;
  }
}
@import "../../assets/scss/common.scss";
</style>
