// https://brushes8.com/zhong-wen-jian-ti-fan-ti-zhuan-huan
export default {
    title: '幸運禮物',

    coins_pool: '實時獎池',
    
    gift_rebate: '赢得5-5000返幣。',
    rule1: '1.送出{0}可{1}一次性送出越多的{0}（X1,X5,X10,X66,X100），获得高额返幣的机会就越高；',
    rule2: '2.每周一、三、五、日20點到22點開啓幸運門，幸運門開啓期間，用戶送出%s有機會獲得一等獎、二等獎和三等獎（若干）；其中，一等獎用戶獨佔獎池的30%，二等獎每人獲得獎池的5%，三等獎每人獲得獎池的3%；幸運門開啓期間，一次性送出越多的幸運禮物（X1,X5,X10,X66,X100），获得大獎的機會越高；',
    rule3: '3.每次贈送幸運禮物，會累積一部分到獎池中，幸運門開啟期間中得一等獎、二等獎、三等級的朋友會在幸運們關閉時獲得對應的金幣。獎池中餘下的金幣會累積下來直到被贏走；',
    rule4: '4.幸運禮物產生的魅力值財富值會有一定折損。',

    rank_title: '幸運週榜',
    rank_hour: '0點',
    rank_desc: '每週一%s結算幸運榜，榜單前5可獲得專屬頭像框7天哦！',
    get_coins: '累計獲得%s金幣',

    owner_coins: '我的本週返幣記錄',

    notice: '{0}獲得了{1}金幣',

    ios_tips: '本活動與蘋果公司無關',
}