<template>
  <div class="rule">
    <div class="topTabs">
      <span :class="{act:tab == 1}" @click="tabClick(1)">الحوائز</span>
      <span :class="{act:tab == 2}" @click="tabClick(2)">القواعد</span>
    </div>
    <div class="ruleTips" v-if="tab == 1">
      <h5>الوقت:</h5>
      <p>12:00 في يوم 26 من فبراير-23:00 في يوم 7 من مارس (توقيت دبي)</p>
      <img src="../../assets/img/rule/gifts.png" alt="" class="gift">
      <h5>هدايا لمستويات مختلفة</h5>
      <img src="../../assets/img/rule/img1.png" alt="" class="img1">
      <h5>مكافآت المغلف الأحمر</h5>
      <p>بعد أن تتلقي الأعمال التي تشترك في هذه المسابقة 100 هدية microphone (199 عملة)، سيتم انفجار المغلفين الحمراء المحظوظة مع 1088 عملات، وعدد المغلفين هو 300، من يأتي أولا، يحصل عليها أولا</p>
      <h5>الجوائز لمراكز 10-1 لقائمة المطربين السحريين</h5>
      <p class="mg">المركز الأول:<br /> شارة المطرب السحري(30 يوما)+إطار المطرب السحري(30 يوما)+سيارة السجادة الحمراء(30 يوما)+VIP(ثلاثون يوما)+10000 عملة+10000 فول</p>
      <p class="mg">المركز الثاني::<br />شارة المطرب السحري(15 يوما)+إطار المطرب السحري(15 يوما)+سيارة السجادة الحمراء(30 يوما)+VIP(ثلاثون يوما)+7000 عملة+7000 فول </p>
      <p class="mg">المركز الثالث:<br />شارة المطرب السحري(7 أيام)+إطار المطرب السحري(7 أيام)+سيارة السجادة الحمراء(30 يوما)+VIP(ثلاثون يوما)+5000 عملة+5000 فول</p>
      <p class="mg">المركز الرابع و الخامس:<br />سيارة السجادة الحمراء(30 يوما)+VIP(ثلاثون يوما)+2500 عملة+3000 فول</p>
      <p class="mg">المركز السادس إلى العاشر:<br />VIP(ثلاثون يوما)+1500 عملة+2000 فول</p>
      <h5>قواعد لاستخدام الجوائز</h5>
      <p>1.صلاحية هذه الهدايا للجوائز هي 14 يوما، صلاحية تذكرة الشحن هي يوم واحد، استخدمها أثناء الصلاحية</p>
      <p>2.ستعطى الجوائز أثناء 14 يوما بعد انتهاء المسابقة</p>
    </div>
    <div class="giftItem" v-else>
      <h5 class="mb">الوقت:</h5>
      <p>12:00 في يوم 26 من فبراير-23:00 في يوم 7 من مارس (توقيت دبي)</p>
      <h4>القواعد</h4>
      <h5 class="mt">التسجيل:</h5>
      <p>يجب أن ترفع أعمالا عامة على إعلان النشاط بعد تسجيلك. يمكن أن ترفع أعمالا عديدة. لا تحصى بيانات الهدايا إلا بعد التسجيل. إذا تحذف عملك المشترك، فستحذف نقاط النمو من هذا العمل</p>
      <h4>قواعد لترتيب القائمة</h4>
      <h5 class="mt">قائمة المطربين السحريين:</h5>
      <p class="mg">1.حسب نقاط التألق بعد التسجيل.</p>
      <p class="mg">2.استراتيجية لكسب نقاط التألق</p>
      <p class="mg">نقاط التألق=عدد الإعجاب للأعمال المشتركة*10+قيمة السحر للأعمال المشتركة</p>
      <p class="mg"> عدد الإعجاب: سيتم تضمين أول 30 إعجابًا فقط في النقاط</p>
      <p class="mg">قيمة السحر لهدايا العملات: كلما تحصل الأعمال المشتركة هدية بقيمة 1 عملة، فستحصل على 10 قيم السحر</p>
      <p class="mg">الهدايا المحدودة لزيادة النقاط: إذا تتلقى الأعمال المشتركة هدايا تالية: خذ قلبي(30 عملات) وmicrophone(199 عملة) وباقة الحب (850 عملة)، فستزيد قيمة السحر بنسبة %5</p>
      <p class="mg">الوقت المحدودة لزيادة النقاط: إذا تتلقى الأعمال المشتركة هدايا العملات أثناء 21:00-21:10 بتوقيت دبي كل يوم، فستزيد قيمة السحر بنسبة %10</p>
      <p class="mg">3.إذا تحصلون على نفس نقاط التألق، فيُضَع ترتيب من توصل إلى هذه النقاط قبل اآخرين أمامهم</p>
      <p class="mg">4.تظهر القائمة درجات أفضل 100 فقط</p>
      <!-- <img src="../../assets/img/rule/img2.png" alt="" class="img2"> -->
      <h5>استراتيجية لاستلام مكافآت المستويات:</h5>
      <p>1.توجد 5 مستويات، وعندما تصل نقاطك إلى 200 و1500 و10000 و100000 و300000، يمكن أن تستلم المكافآت المعينة. هذه المكافآت تصل إليك تلقائيا بعد استلامها، ويمكن لكل المستخدم أن يستلمها مرة واحدة فقط</p>
      <p>2.الصلاحية لاستلام المكافآت هي قبل انتهاء المسابقة، تفضل باستلامها في الموعد</p>
      <img src="../../assets/img/rule/img1.png" alt="" class="img1 mt">
      <h5>قواعد لانفجار المغلفين الحمراء</h5>
      <p>بعد أن تتلقي الأعمال التي تشترك في هذه المسابقة 100 هدية microphone (199 عملة)، سيتم انفجار المغلفين الحمراء المحظوظة مع 1088 عملات، وعدد المغلفين هو 300، من يأتي أولا، يحصل عليها أولا</p>
      <p>2.بعد نقر "ضرب الموعد للمغلف"، ستصل إليك رسالة التنبيه من النظام عندما يبدأ انفجار المغلف الأحمر، وإذا تنقر "إلغاء الموعد"، فلا يمكن أن تتلقى رسالة التنبيه من النظام</p>
      <h5>الآخر</h5>
      <p>أثناء المسابقة ، إذا تبين أن المستخدم يستخدم الوسائل غير المناسبة للمشاركة في النشاط ، يحق للمسؤول إلغاء المؤهل دون إشعار مسبق ، وفي الحالات الشديدة ، سيتم حظر رقم حساب المشارك ، بما في ذلك على سبيل المثال لا الحصر:</p>
      <p>1. أعمالك المشتركة لا تغنيها نفسك أو تستخدم تسجيل الآخرين</p>
      <p>2. تسرق حساب الآخرين أو تستعيره لاشتراك في المسابقة</p>
      <p>3. تفتح حسابات كثيرة لاشتراك في المسابقة</p>
      <p>4. تعلق على آخر المستخدمين بالكلمات السيئة أو ترسلهم إعلانات في فترة النشاط</p>
      <p class="mg">5. تشترك في النشاط عن طريق غير لائق</p>
      <p>إذا تغش في المسابقة، لحق للمنظم أن يحظر كل حساباتك، ويلغي جوائزك التي تكتسب في المسابقة</p>
    </div>
    <p class="lastTips">التفسير النهائي لهذا النشاط ينتمي إلى المنظم</p>
  </div>
</template>

<script>
export default {
  data() {
    return {
      tab: 1
    }
  },
  created() {
    document.title = 'الجوائز& القواعد'
  },
  methods: {
    tabClick(val) {
      this.tab = val
    }
  }
}
</script>

<style lang="scss">
body {
  background-color: RGBA(34, 33, 30, 1);
  direction: rtl;
  .red {
    color: rgba(252, 245, 193, 1);
  }
  .rule {
    padding: 0 0.14rem;
    h5,
    h4 {
      color: rgba(254, 249, 120, 1);
      font-weight: bold;
      font-size: 0.32rem;
    }
    h4 {
      text-align: center;
      margin-top: 0.67rem;
    }
    h5 {
      margin: 0.65rem 0 0.2rem;
    }
    p {
      font-size: 0.28rem;
      font-weight: 500;
      padding-left: 0.7rem;
      em {
        font-size: 0.28rem;
        font-weight: 500;
      }
    }
    .gift {
      width: 7.22rem;
      height: 7.24rem;
      margin: 0.27rem auto 0;
    }
    .img1 {
      width: 7.02rem;
      height: 7.87rem;
      margin: 0 auto;
    }
    .img2 {
      width: 7.02rem;
      height: 6.01rem;
      margin: 0 auto 0.34rem;
    }
    .mg {
      margin-bottom: 0.5rem;
    }
    .mb {
      margin-bottom: 0;
    }
    .mt {
      margin-top: 0.2rem;
    }
    .lastTips {
      margin: 0.93rem 0 1.11rem;
      text-align: center;
    }
  }
}
.topTabs {
  width: 6.4rem;
  height: 0.88rem;
  display: flex;
  align-self: center;
  background: url(../../assets/img/rank/topTabsBg.png);
  background-size: 100% 100%;
  margin: 0.38rem auto 0;
  span {
    width: 3.2rem;
    height: 0.8rem;
    text-align: center;
    line-height: 0.88rem;
    color: rgba(144, 133, 118, 1);
    font-size: 0.28rem;
    &.act {
      font-size: 0.32rem;
      color: rgba(126, 26, 6, 1);
      background: url(../../assets/img/rank/topTabsAct.png);
      background-size: 100% 100%;
    }
  }
}
@import "../../assets/scss/common.scss";
</style>
