export default {
    //html/index.html
    title: 'साइन इन मेडल का विवरण', //連簽徽章說明
    sign_day: 'आपने लगातार',//你已連續簽到
    sign_day2: 'दिन के लिए साइन इन किया',
    sign_retroactive: 'पुनः साइन इन करें',//補簽
    sign_badge: 'साइन इन मेडल',//連簽徽章
    sign_tips: 'विवरण:',//說明：
    sign_tips2: 'यहां उन दिनों की संख्या है, जिन्हें आपने हाल के दिनों में लगातार साइन इन किया है। यदि अचानक रोकता है, तो उसे पुनः गिनेगा',//這裡展示你最近一次連續簽到的天數，如有斷簽，則重新計算
    sign_tips3: 'साइन इन मेडल, जब साइन इन दिन की संख्या शर्तों को पूरा करती है तब प्राप्त सकता है, "मेरा मेडल" में प्राप्त मेडल चेक कर सकते हैं, जिसे पहन सकते हैं',//連簽徽章，當連簽天數達到要求即可自動獲得，已獲得的徽章可在我的徽章查看並佩戴使用
    sign_tips4: 'जब उपयोगकर्ता साइन इन भूल गया, उसे पुनः साइन इन करने के लिए कॉइन खर्च करना चाहिए और हर बार में केवल एक दिन का साइन इन पुनः कर सकता है। हर बार पुनः साइन इन के लिए खर्च किया गया कॉइन पिछली बार की तुलना में 20% की बढ़ाई होती है। जैसे पहली बार पुनः साइन इन के लिए 100 कॉइन चाहिए, दूसरी बार के लिए 120 कॉइन चाहिए, तीसरी बार तो 140 कॉइन चाहिए। और यह कॉइन की संख्या एक पूर्ण संख्या होनी चाहिए। कृपया लगातार साइन इन कीजिए और अचानक मत रोकिए।',//當用戶不小心漏簽時，可花費金幣進行補簽，每次可補簽1天，每次補簽花費金幣數會比上次補簽提高約20%，如第一次補一天花費100金幣，第二次補簽一天花費120金幣，第三次補簽一天花費140金幣，個位數抹零取整，如此類推。請大家注意連續簽到，儘量避免漏簽補簽哦。
    sign_tips5: 'पुनः साइन इन 7-दिन साइन-इन चक्र को प्रभावित नहीं करता है',//補簽不影響7天簽到周期
    sign_queryConis: 'पुनः साइन इन के लिए $ कॉइन खर्च करें?',//是否花費$金幣進行補簽？
    sign_queryDate: 'जो तारीख आपने साइन इन नहीं किया:',//你最近漏簽的日期
    sign_queryDays: 'पुनः साइन इन के बाद आपके लगातार साइन इन दिन $ दिन हैं',//補簽後，連續簽到天數爲$天
    sign_dayTips1: 'पुनः साइन इन किया, साइन इन दिन+1',//補簽成功,連簽天數+1


    //common
    common_day: 'days', // 天
    common_cancel: ' रद्द करें', //取消
    common_ok: ' ठीक है', //確定

    //share
    share_title: 'दोस्त का आमंत्रण करें',//邀請好友
    share_day: 'लगातार साइन इन के लिए $ दिन हैं, अभी उसे आपकी मदद चाहिए, चलें और मदद करें',//已連續簽到$天，現在需要你的助力，快幫他助力吧
    share_threeDay: 'आपने लगातार $ दिन के लिए साइन इन किया<br/>सफल रूप में 3 दोस्त का आमंत्रण करने से कार्ड मोड़ने का और एक अवसर प्राप्त सकेगा',//你已連續簽到$天</br>成功邀請3位好友助力可再翻牌一次
    share_tmor: 'कृपया कल कोशिश करें',//請明天再試
    share_help: 'उसकी मदद करें',//幫他助力
    share_shareFriend: 'अभी दोस्त का आमंत्रण करें',//立即邀請好友
    share_tips1: 'मदद देने के लिए नया वर्शन अपडेट करना चाहिए',//助力需更新到最新版本
    share_tips2: 'मदद देने का नियम:',//助力規則：
    share_tips3: '1.अपने आपको मदद दे नहीं सकता',//1、不可自己給自己助力
    share_tips4: '2.प्रत्येक उपयोगकर्ता दिन में केवल एक बार अन्य उपयोगकर्ताओं की मदद कर सकता है',//2、每個用戶每天僅可幫其他用戶助力一次
    share_tips5: '3.मदद देने के लिए वर्शन अपडेट करना चाहिए',//3、需要更新新版本，才可成功助力
    share_tips6: '4.समय सीमा के दौरान में मदद देनी चाहिए, नहीं तो कर नहीं सकती। कल दुबारा आमंत्रण करना चाहिए',// 4、助力需要限時完成，超出時間後無法助力，需明天重新發起邀請


    share_signDays: 'मैंने लगातार $ दिन के लिए साइन इन किया',//我已連續簽到$天
    share_con: 'मैंने लगातार $ दिन के लिए साइन इन किया, अभी मुझे आपकी मदद चाहिए, जल्दी आइए',//我已在歡歌連續簽到$天啦，翻牌得獎品，需要你的助力，快來

    share_downTm: 'मदद काउंटडाउन',//助力倒計時
    share_wait: 'दोस्त', //待邀請

    //rule
    rile_title: 'नियम विवरण', //簽到規則說明
    rile_title2: 'नियम विवरण:', //規則說明：
    rile_p1: '1. सभी उपयोगकर्ता इस गतिविधि में भाग ले सकते हैं।', //1、所有用戶均可參與簽到活動
    rile_p2: '2. समान खाता प्रतिदिन एक बार साइन इन कर सकता है, जो संचित रूप से दिन गिनेगा।', //2、同一帳號每個自然天可簽到一次，並累積連簽天數。
    rile_p3: '3. 7 दिन के लिए एक साइन इन चक्र है, रोकना या 7 दिन को पूरा करना तो नए चक्र शुरू होता है।', //3、簽到以7天爲一個周期，斷簽或簽到滿7天後，將重新進入新的周期。
    rile_p4: '4. हर बार साइन इन करने से सामान्य और अतिरिक्त इनाम मिल सकता है, सामान्य इनाम पॉइंट है और अतिरिक्त इनाम में कार्ड इनाम (पहला दिन से छठवां दिन) तथा बॉक्स इनाम (सातवां दिन) है, कार्ड एवं बॉक्स में बड़ा उपहार प्राप्त कर सकता है।', //4、每次簽到即可獲得固定獎勵與額外獎勵，其中固定獎勵爲金豆獎勵，額外獎勵爲翻牌獎勵（第一天至第六天）和寶箱獎勵（第七天），金牌與寶箱有機會獲得驚喜大禮。
    rile_p5: '5. चक्र के सातवां दिन के अलावा, प्रतिदिन साइन इन के बाद एक बार कार्ड मोड़ सकता है, यदि शेयर टास्क पूरा किया तो कार्ड मोड़ने का और एक अवसर मिलेगा।', //5、每天簽到可翻牌一次，如果完成分享任務，還可再翻牌一次，周期第7天除外。
    rile_p6: '6. पुनः साइन इन 7-दिन साइन-इन चक्र को प्रभावित नहीं करता है।', //6、補簽僅支持補總連簽天數，不影響簽到周期。
    rile_p7: '7. साइन इन के दौरान में यदि उपयोगकर्ता के कोई उललंघन व्यवहार हैं (जैसे प्राप्त के लिए धोखा देना, पापी रूप से प्राप्त करना या अधिक खाते के साथ प्राप्त करना), उसका खाता ब्लॉक किया जाएगा और इनाम को वापस करेगा।', //7、簽到活動期間，用戶如果違反誠實信用原則或出現違規行爲（如作弊領取、惡意套取、多帳號互刷等），平台一經發現將封號處理，並有權收回獎勵。
    rile_p8: '8. गतिविधि में भाग लेने का मतलब यह है की सभी नियम को स्वीकार करता और प्लेटफार्म कानून तथ नियम का पालन करता है। गतिविधि नियम को सुधारना प्लेटफार्म का अधिकार है। ', //8、凡參加簽到活動者，即視爲接受活動所有規則，並遵循平台相關法律聲明以及規定，平台有權在法律允許的範圍內對活動規則作出適當調整。
}