<template>
  <div class="rule">
    <div class="tabs">
      <span @click="tabClick(1)" :class="{act:show== 1}">الجوائز</span>
      <span @click="tabClick(2)" :class="{act:show== 2}">القواعد</span>
    </div>
    <div class="actTime">الوقت:12:00:00 في يوم 17 من يناير-23:00:00 في يوم 31 من يناير</div>
    <div class="wards" v-show="show == 1">
      <h3>الجوائز</h3>
      <div class="wardImg2"></div>
      <h3>جوائز لأفضل 10 في قائمة أول لاعب</h3>
      <h6>المركز الأول:</h6>
      <p>شارة أول لاعب(ثلاثون يوما)+سيارة GTR(ثلاثون يوما)+3000عملة+10000 فول</p>
      <h6>المركز الثاني:</h6>
      <p>شارة أول لاعب(ثلاثون يوما)+سيارة GTR(ثلاثون يوما)+2000عملة+8000 فول</p>
      <h6>المركز الثالث:</h6>
      <p>شارة أول لاعب(ثلاثون يوما)+سيارة GTR(ثلاثون يوما)+1000عملة+5000 فول</p>
      <h6>المركز 5-4:</h6>
      <p>سيارة GTR(ثلاثون يوما)+800عملة+2000 فول</p>
      <h6>المراكز 10-6:</h6>
      <p>سيارة GTR(ثلاثون يوما)+500عملة+1000 فول</p>
      <h3>جوائز لأفضل 10 في قائمة غوفر سعيد</h3>
      <h6>المركز الأول:</h6>
      <p>شارة أول لاعب(خمسة عشر يوما)+سيارة GTR(ثلاثون يوما)+1000عملة+8000 فول</p>
      <h6>المركز الثاني:</h6>
      <p>شارة أول لاعب(خمسة عشر يوما)+سيارة GTR(ثلاثون يوما)+800عملة+6000 فول</p>
      <h6>المركز الثالث:</h6>
      <p>شارة أول لاعب(خمسة عشر يوما)+سيارة GTR(ثلاثون يوما)+600عملة+4000 فول</p>
      <h6>المركز 5-4:</h6>
      <p>سيارة GTR(ثلاثون يوما)+300عملة+1600 فول</p>
      <h6>المراكز 10-6:</h6>
      <p>سيارة GTR(ثلاثون يوما)+200عملة+900 فول</p>
      <h3>جوائز الدرجات لضرب غوفر سعيدا</h3>
      <div class="wardImg3"></div>
      <h3>قواعد استخدام الجوائز</h3>
      <div class="wardRule">
        <p>1.تذكرة إعادة 10 عملة بعد استهلاك 100 عملة هي فعالة أثناء 24 ساعة بعد استلامها. ستصل العملات المعادة إليك بعد استهلاكك.</p>
        <p>2.تذكرة إعادة %2 عملات للشحن وتذكرة إعادة %3 عملات للشحن هي فعالة أثناء 24 ساعة بعد استلامها. ويمكن استخدامها بشكل تراكمي. ستصل العملات المعادة إليك بعد شحنك.</p>
      </div>
    </div>
    <div class="rules" v-show="show==2">
      <h3>القواعد</h3>
      <h6>التسجيل:</h6>
      <p>يمكن أن تشترك في النشاط بعد التسجيل. ولا تحصى البيانات إلا بعد تم التسجيل</p>
      <h6>قاعدة الترتيب لقائمة أول لاعب</h6>
      <p>1.الترتيب حسب قيمة اللعب. قيمة اللعب=عدد نقود اللعبة المستخدمة</p>
      <p>2.يمكن كسب نقود اللعبة من خلال إمكال المهام اليومية ومساعدة الأصدقاء على دعمهم والحصول على الدعم منهم. ويمكن استخدام هذه النقود في لعبين ضرب غوفر سعيدا والقرص الدوار بالحظ</p>
      <p>3. إذا تحصلون على نفس قيمة اللعب، فيُضَع ترتيب من توصل إلى هذه القيمة قبل اآخرين أمامهم</p>
      <p>4.تظهر القائمة درجات أفضل 100 فقط</p>
      <h6>قاعدة الترتيب لقائمة غوفر سعيد</h6>
      <p>1.الترتيب حسب النقاط التي تحصل عليها في لعبة ضرب غوفر سعيدا</p>
      <p>2. إذا تحصلون على نفس النقاط، فيُضَع ترتيب من توصل إلى هذه النقاط قبل اآخرين أمامهم</p>
      <p>3.تظهر القائمة درجات أفضل 100 فقط</p>
      <h6>إستراتيجية كسب نقود اللعبة</h6>
      <p>
        يمكن كسب نقود اللعبة من خلال إمكال المهام اليومية ومساعدة الأصدقاء على دعمهم والحصول على الدعم منهم. ستصل هذه النقود إليك تلقائيا، والنقود اليومية ستمسح كل يوم </p>
      <h6>كسب النقود من خلال إكمال المهام اليومية:</h6>
      <p>تأتي المهام اليومية والنقود المعينة:</p>
      <div class="taskImg"></div>
      <p class="ps">الملاحظة: ستحصى قيمة إرسال الهدايا مهما في غرفة الغناء أو الدردشة أو لأعمال</p>
      <h6>كسب النقود من خلال مساعدة الأصدقاء لدعمهم:</h6>
      <p>1.يمكن أن تقوم بدعم 3 أصدقاء كل يوم على أكبر الحد، وأعلى الحد لعدد الأصدقاء للمساعدة على الدعم هو 3 كل يوم</p>
      <p>2.بعد دعم واحد، يمكن أن تحصل الطرفان على 5 نقود اللعبة.</p>
      <h3>لعبتان ممتعتان</h3>
      <h6>ضرب غوفر سعيدا:</h6>
      <p>ضرب غوفر واحد بعد استخدام 20 نقد اللعبة، عندما تحصل على النقاط المطلوبة لدرجات، يمكنك الحصول على الجوائز المقابلة</p>
      <h6>القرص الدوار بالحظ:</h6>
      <p>يصرف 20 نقد اللعبة لجري اليانصيب الواحد، والجوائز في اليانصيب ستصل إليك فورا</p>
      <h3>الآخر</h3>
      <div class="jinggao">
        أثناء المسابقة ، إذا تبين أن المستخدم يستخدم الوسائل غير المناسبة للمشاركة في النشاط ، يحق للمسؤول إلغاء المؤهل دون إشعار مسبق ، وفي الحالات الشديدة ، سيتم حظر رقم حساب المشارك ، بما في ذلك على سبيل المثال لا الحصر:
        <p>1. تسرق حساب الآخرين أو تستعيره لاشتراك في المسابقة</p>
        <p>2. تفتح حسابات كثيرة لاشتراك في المسابقة</p>
        <p>3. تعلق على آخر المستخدمين بالكلمات السيئة أو ترسلهم إعلانات في فترة النشاط</p>
        <p>4. تشترك في النشاط عن طريق غير لائق</p>
        إذا تغش في المسابقة، لحق للمنظم أن يحظر كل حساباتك، ويلغي جوائزك التي تكتسب في المسابقة
      </div>
    </div>
    <p class="lastTips">التفسير النهائي لهذا النشاط ينتمي إلى المنظم</p>
  </div>
</template>

<script>
export default {
  data() {
    return {
      show: 1
    }
  },
  methods: {
    tabClick(val) {
      this.show = val
    }
  }
}
</script>

<style lang="scss">
body {
  background-color: #cf380b;
  direction: rtl;
}
.rule {
  padding: 0.29rem 0.41rem;
  .tabs {
    display: flex;
    justify-content: space-between;
    span {
      display: block;
      width: 3.3rem;
      height: 0.81rem;
      color: #ffd145;
      font-size: 93%;
      background: url(../../assets/img/ruleBg.png);
      background-size: 100% 100%;
      text-align: center;
      line-height: 0.81rem;
      &.act {
        color: #b98300;
        background: url(../../assets/img/ruleBgAct.png);
        background-size: 100% 100%;
      }
    }
  }
  .actTime {
    font-size: 80%;
    color: #ffa365;
    margin: 0.21rem auto 0;
    text-align: center;
  }
  h3 {
    margin: 0.46rem 0 0.31rem;
    text-align: center;
    color: #ffdc7f;
  }
  .wardImg2 {
    width: 6.41rem;
    height: 6.26rem;
    background: url(../../assets/img/wardImg2.png);
    background-size: 100% 100%;
    margin: 0 auto;
  }
  .wardImg3 {
    width: 5.8rem;
    height: 4.49rem;
    background: url(../../assets/img/wardImg.png);
    background-size: 100% 100%;
    margin: 0 auto;
  }
  h6,
  p {
    font-size: 70%;
    color: #ffddc7;
  }
  .wardRule {
    p {
      margin-top: 0.15rem;
    }
  }
  > p {
    padding-left: 0.4rem;
  }
  .lastTips {
    font-size: 80%;
    text-align: center;
    color: #e68d51;
    margin-top: 0.8rem;
  }
  .taskImg {
    width: 6.38rem;
    height: 6.81rem;
    background: url(../../assets/img/taskImg.png);
    background-size: 100% 100%;
    margin: 0.1rem 0 0 0.4rem;
  }

  .ps {
    color: #ffc29a;
  }
  .wards {
    p {
      margin-bottom: 0.15rem;
    }
  }
  .rules {
    h6 {
      font-size: 90%;
      margin-top: 0.25rem;
      font-weight: 700;
    }
    p {
      font-size: 70%;
      padding-left: 0.4rem;
      font-weight: 500;
    }
    .jinggao {
      font-size: 0.2rem;
      color: #ffddc7;
      p {
        font-size: 0.2rem !important;
      }
    }
  }
}
@import "../../assets/scss/common.scss";
</style>
