export default {
    title: '幸運禮盒',//幸運禮盒
    tips:'贈送幸運禮盒有機會拆出以下幸運禮物',//贈送幸運禮盒有機會拆出以下幸運禮物
    lucky_box:'幸運禮盒',//幸運禮盒
    lucky_higt_box:'高級幸運禮盒',//高級幸運禮盒
    lucky_super_box:'超級幸運禮盒',//超級幸運禮盒
    send:'送給',//送給
    sendLuckyBox:'立即抽獎',//立即抽獎

    notice:'恭喜<span>#%myNick#</span>給<span>#%toNick#拆開了#%name#</span>',
    send_self:'不能給自己送禮喔',//不能給自己送禮喔
    no_mic:'暫無人在麥上，無法贈送',//暫無人在麥上，無法贈送
    no_people_mic:'暫無人在麥上',//暫無人在麥上
    rule: "規則說明",
    rule1: "幸運禮盒是一種平台的互動玩法，用戶應在使用本服務前仔細閱讀本規則，除非用戶接受本規則所有條款，否則用戶無權使用本功能。",
    rule2: "特別提醒：平台反對未成年人參與互動消費。請參與平台互動活動的用戶務必注意健康娛樂，適度消費。",
    rule3: "用戶在指定房間贈送幸運禮盒，將按概率拆出特定禮物道具，並贈送給當前房間內的其他用戶。",
    rule4: "收禮者按照實際拆出的禮物道具獲得魅力值或鑽石收益。",
    rule5: "本活動的禮物概率是獨立概率，不疊加計算，具體概率如下所示：<br>【超級幸運禮盒】<br>藍風鈴香水：50.00%<br>金絲籠：22.00%<br>銀色鈴鐺：21.00%<br>夜之戀曲：6.00%<br>魔法晶戀：0.90%<br>天馬行空：0.10%<br><span>【高級幸運禮盒】</span><br>熊寶寶：22.00%<br>櫻花釀：23.00%<br>迷你風扇：51.00%<br>月光精靈球：3.00%<br>許願冰泉：0.90%<br>星雨之夏：0.10%<br><span>【幸運禮盒】</span><br>安全帽：25.00%<br>hello：20.00%<br>熊寶寶：44.90%<br>櫻花釀：8.00%<br>蝶戀花：2.00%<br>八音盒：0.10%",
    rule6: "重要提示<br>（1）幸運禮盒是提升用戶房間娛樂體驗的功能，僅供娛樂交流使用。<br>（2）收禮人收到幸運禮盒，不得反向兌換金幣、台幣等任何具有交換價值的物品，不得用於任何形式的盈利活動。<br>（3）嚴禁收禮人與用戶私下交易，違規房間將按照平台規則嚴肅處理，請用戶謹防上當受騙。<br>（4）禁止將獲得的禮物進行線下交易，平台嚴厲打擊任何第三方線下交易行為，用戶需自行承擔不利後果。<br>（5）禁止使用幸運禮盒實施任何影響互動公平性的行為，或利用平台BUG等不正當手法參與玩法，一旦發現，平台有權取消禮物發放，追回禮物。",
    rule7: "本活動與蘋果公司無關"
}