const vietnamLang = {
    Festival_Well_being: "عيد الأضحى مبارك",  //古尔邦节安康
    Free_sharing: "عملات ذهبية كثيرة لاقتسام", // 超多金币免费瓜分！
    Rules: "القواعد&الجوائز",   // 规则&奖励
    ActivityWards: "الجوائز",  //活动奖品
    Roast_Lamb_Leg: "هدية ساق الخروف المشوية",  //烤羊腿礼物
    Roasted_Whole_Lamb: "هدية الخروف الكاملة المشوية", // 烤全羊礼物
    Festival_Badge: "شارة نجمة الأعياد",  //节日徽章
    Golden_beans: "فول ذهبي", //金豆
    Gold_coin: "عملة ذهبية",  //金币
    Packed1000: "كلما تتراكم 1000 نجمة، يمكنك أن تشترك في اقتسام لحم الخروف. 1000 عملة ذهبية لكل مرة، و100 شخص يستطيعون اكتساب هذه العملات فقط", //星值每累积1000个，即可瓜分羊肉，每次1000金币，100个人可以抢到
    make_an_appointment: "ضرب الموعد لاقتسام لحم الخروف", //预约瓜分羊肉
    Star_value: "كيف تحصل على النجوم", //星值获取
    goWorks: "إهداء هدية الضائن في غرفة الغناء أو لأعمال الآخرين", //去作品/K房赠送绵羊礼物
    oneMothsMvp: "VIP لشهر واحد(777 عملة ذهبية)", //1个月VIP（777金币）
    conios388: "388  عملة ذهبية", //388金币
    thisAcr: "لا يمكنك أن تحصل على هذه الجائزة والنجوم إلا تشتري VIP عبر هذا الإعلان", //必须通过本页面购买VIP才可获得奖励与星值
    buy: "شراء", //购买
    CountDown: "العد التنازلي لاستلام", //领取倒计时
    Receive: "استلام", //领取
    starList: "قائمة ترتيب النجوم", //星值排行榜
    joinIn: "التسجيل",  //点击报名
    now_act: "ترتيبك الحالي:",  //当前名次
    noActStart: "لم يبدأ النشاط", // 活动为开始
    joined: "التسجيل بنجاح!", //报名成功
    actEnd: "قد انتهى النشاط", //活动结束
    Failure_to_buy: "فشل في الشراء", //购买失败
    conisInsufficient: "رصيدك لعملات ذهبية يقل من 388 عملة ذهبية", //您的金币余额少于388金币
    Recharge: "اذهب إلى الشحن", //去充值
    again: "مرة قادمة",  //下次再说
    DetermineBuy: "هل أنت متأكد من شراء VIP لشهر واحد",   //是否确认购买1个月VIP
    Star_value: "سوف تحصل على 194 نجمة=", //将获得194星值
    Confirmation_of_purchase: "تحديد من الشراء", // 确认购买
    singUP: "يمكنك استلامها بعد تسجيلك", // 完成报名即可领取喔~
    SuccessfulReservation: "تنجح في ضرب الموعد!", //预约成功
    remind: "تذكير أصدقائك لضرب الموعد", // 提醒好友预约
    downTimer: "العد التنازلي لاقتسام لحم الخروف", // 瓜分羊肉倒计时
    endTime: "سيبدأ بعد 120 ثانية!",  //还有120秒开启！
    RemindFriends: "تذكير أصدقائك لاقتسام لحم الخروف", // 提醒好友来瓜分
    end: "إن لحم خرفك على وشك الطهو، اذهب إلى إعلان عيد الأضحى مبارك سريعا لاقتسامه", //您的羊肉即将烤熟，请火速前往古尔邦节安康活动页面瓜分
    Carveup: "اقتسام",// 瓜分
    open: "فتح",  // 开
    nomore: "لا يمكن أن تقتسم بحسابات كثيرة", // 不可用多个账号瓜分奖品哦！
    know: "عرفت",  //我知道啦
    redBack: "200 مظروف أحمر، استيلاء عليها في *** ثوان",//200个红包，xx秒被抢光
    remindRedBack: "تذكير أصدقائك لاستيلاء على المظروف الأحمر", // 提醒好友抢红包
    Congratulations: "مبروك للحصول", //恭喜获得
    See_Receipt_Details: "انظر تفاصيل الاستلام", // 查看领取详情
    peopleMore: "أشخاص أكثر، ونجوم أكثر، تشارك هذا النشاط وتحصل على الجائزة الكبيرة مرة قادمة", //人多星值才多，分享这个活动，下次中大奖！

}

export default vietnamLang