<template>
    <div class="page pageAgreement">
        <h5>平臺准用協議</h5>
        <p>《平臺准用協議》（以下簡稱“本協議”）由用戶（即本平臺的創作者或房主用戶，以下簡稱“用戶”）與本平臺所有權人（以下簡稱“平臺/本平臺”）共同締結，本協議具有合同效力。請用戶務必審慎閱讀、充分理解各條款內容，特別是免除或者限制責任的條款，以及開通或使用某項服務的單獨協議，並選擇接受或不接受。限制、免責條款可能以加粗形式提示用戶注意。如果用戶為未成年人，請在法定監護人的陪同下仔細閱讀並充分理解本協議，並征得法定監護人的同意後使用本平臺提供的服務。如用戶為未成年人法定監護人，希望合理設定孩子娛樂時間，培養孩子健康的娛樂習慣。</p>
        <p>除非用戶已閱讀並完全接受本協議所有條款，否則用戶無權通過任何方式使用本平臺提供的服務。若用戶點擊同意、接受或下一步，或用戶註冊、使用本平臺服務均視為用戶已充分理解本協議並承諾作為本協議的一方當事人接受協議的約束。</p>
        <p>如果用戶對本協議或本平臺提供的服務有意見或建議，可與本平臺客戶服務部門聯系，我們會給予用戶必要的幫助。</p>
        <h6>一、平臺帳號規則</h6>
        <p>1.帳號註冊</p>
        <p>1.1用戶承諾以真實、有效身份資訊註冊成為本平臺用戶，包括按照身份資訊變更情況不斷更新帳號資料，若用戶提供任何錯誤、不實、過時或不完整的資料，或者本平臺有合理理由懷疑前述資料為錯誤、不實、過時或不完整，本平臺有權部分暫停或終止用戶的帳號服務。</p>
        <p>1.2當用戶訪問、流覽及使用平臺帳號提供的各項服務、業務時，便表明其接受了本服務協議的條款，並同意受本服務協議的約束；若用戶不同意本協議條款的，請停止註冊程式並停止使用平臺。</p>
        <p>1.3用戶理解並承諾，用戶所設置的帳號不得違反法律法規及平臺的相關規則，用戶的帳號名稱、頭像和簡介等註冊資訊不得出現違法和不良資訊（包括但不限於冒用他人姓名、名稱、字型、頭像等足以引起混淆的方式）。用戶在註冊以及使用過程中需遵守相關法律法規，不得實施任何侵害國家利益、損害他人合法權益，有害社會道德風尚的行為。</p>
        <p>2.帳號使用及保管</p>
        <p>2.1本平臺有權審查用戶註冊所提供的身份資訊真實性、有效性和合法性，並採取合理措施保障用戶帳號的安全；用戶應自行妥善保管和安全使用其帳號及密碼，包括每次使用完畢，應結束帳號登錄以及不得洩露等，否則用戶可能得不到平臺帳號的安全保護，如用戶發現其帳號或密碼被他人非法使用或有使用異常的情況的，有權通知本平臺，本平臺將據實採取措施予以保護。</p>
        <p>2.2用戶對登錄後所持帳號產生的行為依法享有權利和承擔責任，因此該行為所衍生的任何損失或損害，本平臺不承擔責任。</p>
        <p>2.3本平臺禁止用戶交易平臺帳號，如該等情形出現的，本平臺有權收回用戶交易的平臺帳號，如帳號回收時仍有充值餘額或其他虛擬物品的，則立即清零，不得在平臺內及線下實現任何兌現，對此平臺不承擔任何責任。如果因用戶交易平臺帳號引起的任何糾紛，本平臺不承擔任何責任。</p>
        <h6>二、隱私保護及資訊</h6>
        <p>1.用戶隱私權及用戶資訊保護</p>
        <p>1.1本平臺要求用戶提供與其個人身份有關的資訊資料，並將採取必要措施保護用戶的個人資訊資料的安全。</p>
        <p>1.2用戶在遵守本協議要求的前提下，本平臺將充分保護用戶享有個人隱私。除非因以下原因，未經授權，本平臺不向任何第三方提供、公開用戶個人身份資訊：</p>
        <p class="list">
            a)用戶或用戶監護人授權或認可本平臺披露的；
            <br />b)根據有關法律法規的要求；
            <br />c)基於維護社會個體和公眾的安全或利益之目的；
            <br />d)維護本平臺的合法權益；
            <br />e)其他合理的相關要求。
        </p>
        <p>2.本平臺在提供服務時可能會搜集用戶個人資訊，出於更好地提供服務所需，本平臺還可能收集並分析用戶的技術資訊和使用狀況，用戶在此授權本平臺取得並合理使用上述資訊。本平臺承諾遵守法律規定，但法律要求的披露，或者無法還原至個人原始數據（例如基於“大數據”所做的統計數據）方式的披露除外。</p>
        <p>3.本平臺不對用戶在平臺帳號任何服務下發布資訊的刪除或儲存失敗負責。本平臺有權判斷用戶的行為是否符合平臺帳號服務條款的規定，如果本平臺認為用戶違反了服務協議的約定，本平臺有權刪除用戶發佈或發送的資訊，直至中斷或終止向其提供服務。</p>
        <h6>三、服務說明</h6>
        <p>1.本平臺保留依其自主判斷在將來變更、修改、增加或刪除本服務協議條款的權利。所有修改的協議均構成本服務協議的一部分。用戶使用平臺帳號的服務時，則視為用戶已經接受服務條款的修改。如果用戶不同意服務條款的修改，可以主動取消已經獲得的服務。</p>
        <p>2.本服務協議和本平臺的其他服務條款構成完整的協議。</p>
        <p>3.本平臺基於增強或強化目前服務目的所新增的任何新功能、服務、新產品，均無條件地適用本服務條款。</p>
        <p>4.如平臺帳號未能儲存或刪除本服務的內容或其他資訊，本平臺不負擔任何責任。對於3個月未使用的帳號，本平臺有權予以刪除。</p>
        <p>5.因用戶利用本服務展示或上傳的內容或與本服務相關致違法或侵害其他人的任何權利而導致任何第三方提出權利主張或使本平臺遭受任何形式的罰款或處罰，用戶同意以適當方式充分消除對本平臺的不利影響，賠償本平臺及其分公司、關聯公司、代理人或其他合作夥伴及員工的損失，並使其免受損害。</p>
        <p>6.服務的終止情形</p>
        <p>6.1用戶有發佈違法資訊、嚴重違背社會公德、以及其他違反法律禁止性規定的行為；</p>
        <p>6.2用戶在接受本平臺服務時實施不正當或本協議中有明確約定或屬於本平臺事先明確告知的應被終止服務的禁止性行為；</p>
        <p>6.3用戶提供虛假註冊身份資訊，或實施違反本協議的行為，本平臺有權中止對用戶提供全部或部分服務；</p>
        <h6>四、未成年人使用條款</h6>
        <p>1.本平臺重視對未成年人個人資訊的保護，若用戶是未滿18周歲的未成年人，在使用本平臺服務前，包括填寫個人資訊時，請加強個人保護意識並謹慎對待，在用戶的父母或其他監護人監護、指導下閱讀並同意本協議。</p>
        <p>2.未成年用戶理解如因用戶違反法律法規、本協議內容，則用戶及用戶的監護人應依照法律規定承擔因此而導致的一切後果。</p>
        <p>3.未成年人用戶特別提示</p>
        <p>3.1未成年人使用本服務應該在其監護人的監督指導下，在合理範圍內正確學習使用網路，避免沉迷，並且監護人及其他將個人支付工具交給未成年人用戶使用的，應應嚴格管理好銀行及其他網路支付工具的支付密碼，如因監管疏忽造成的損失本平臺不承擔任何責任。</p>
        <p>3.2未成年人用戶知悉並同意，本平臺為更好地保護未成年人，本平臺將對未成年人用戶接受並使用本服務時進行一定的限制。</p>
        <p>3.3為更好的保護未成年人隱私權益，本平臺提醒用戶慎重發佈包含未成年人素材的內容。</p>
        <h6>五、費用說明</h6>
        <p>1.本平臺所提供部分服務或應用可能涉及付費和計結費，用戶使用本平臺的軟體服務，輸入帳號、密碼的行為視為對收付費服務的接受，用戶一旦接受平臺服務，需要按本平臺即時執行的兌換和計結標準，包括虛擬幣、代幣以及實際貨幣的兌換計結。為促進平臺服務良好運轉，本平臺保留對兌換和計結標準調整和完善的權利。如兌換或計結標準發生變化，請用戶謹慎使用本平臺服務，用戶繼續使用平臺服務應被視為對新的兌換或計結標準的認可。</p>
        <p>2.收付費服務可能需要一次性進行，如中途取消服務，本平臺有權不予退還或計結款項。</p>
        <p>3.用户享受的收付費服務也可能需要週期性、多次性，每項服務到期前，用戶若需要取消該項服務，應向本平臺提出；若用戶沒有及時提出，視為同意對該項服務自動續期。</p>
        <h6>六、使用規則與禁止</h6>
        <p>1.用戶應瞭解國際互聯網的無國界性，應特別注意遵守當地所有有關的法律和法規。</p>
        <p>2.禁止行為：</p>
        <p>2.1展示或傳送任何非法、淫穢、色情、低俗的，脅迫、騷擾、中傷他人或攻擊性的，誹謗、侵害他人隱私或詆毀他人名譽或商譽的，其他違反國家法律法規、社會道德規範及不適當的資訊或電子郵件。</p>
        <p>2.2以任何方式危害未成年人。</p>
        <p>2.3冒充或以虛偽不實的方式使人誤認為與任何人或任何機構有關。</p>
        <p>2.4以任何方式使人誤認為該內容為本平臺所傳送。</p>
        <p>2.5展示、傳送無權傳送的內容。</p>
        <p>2.6侵犯任何人的專利、商標、著作權、商業秘密或其他民事權利之內容。</p>
        <p>2.7上傳送廣告函件、促銷資料、垃圾郵件或不實資訊等。</p>
        <p>2.8干擾或破壞本服務或與本服務相連的伺服器和網路，或不遵守本服務協議之規定。</p>
        <p>2.9違反任何相關法律、法規、規章、條例等其他具有法律約束力的規範。</p>
        <p>2.10 竊取他人密碼、帳號和其他數位化資訊或財產。</p>
        <p>2.11使用國家機構或其他機構的名稱。</p>
        <p>2.12宣揚反動、封建迷信、淫穢、色情、賭博、暴力、兇殺、恐怖、教唆犯罪等不符合國家法律規定的以及任何包含種族、性別、宗教歧視性和猥褻性內容。</p>
        <p>2.13本平臺以外其他網站的鏈接。</p>
        <p>2.14通過不正當的手段或其他不公平的手段使用平臺帳號的服務或參與平臺帳號的活動。不得干擾本平臺正常地提供產品和服務，包括但不限於：攻擊、侵入本平臺的網站伺服器或使網站伺服器超載；製作、發佈、傳播、使用任何形式的妨礙公平性的輔助工具或程式(外掛)；利用程式的漏洞和錯誤(Bug)破壞平臺的正常進行或傳播該漏洞或錯誤(Bug)；不合理地干擾或阻礙他人使用本平臺所提供的產品和服務。</p>
        <p>2.15其他被本平臺視為不適當的行為。</p>
        <p>2.16本平臺有權對用戶載述、註冊使用、張貼、發送的內容進行審核，有任何違反法律法規或本協議之有關規定的內容，本平臺有權立即將其刪除或遮罩，且不需要對用戶另行通知。本平臺對令人反感的內容或辱罵用戶的惡劣行為絕不容忍，本平臺採取禁止措施不表示放棄追責之權利。</p>
        <p>2.17本平臺提供的服務將按照現狀提供，用戶明確知道服務中存在已知和未知的漏洞和錯誤（Bug）或因其他用戶的禁止行為，用戶確悉上述情形與本平臺無關，將不向本平臺及其關聯公司主張任何賠償。</p>
        <h6>七、披露及處理</h6>
        <p>1.用戶承諾對經由本服務上傳、展示或傳送的內容負全部責任；在任何情況下，本平臺均不對任何用戶提供的內容負責，包括但不限於任何內容發生任何錯誤或紕漏以及衍生的任何損失或損害，用戶負責處理與其提供的內容相關的任何及全部糾紛。本平臺有權根據法律法規及行政司法機關要求拒絕或刪除經由本服務提供的任何內容。用戶使用上述內容，應自行承擔風險。</p>
        <p>2.本平臺有權利在下述情況下，對內容進行保存或披露：</p>
        <p class="list">
            a)法律程式所規定;
            <br />b)本服務條款規定;
            <br />c)被侵害的第三人提出權利主張;
            <br />d)為保護平臺帳號、其使用者及社會公眾的權利、財產或人身安全;
            <br />e)其他本平臺認為有必要的情況。
        </p>
        <p>3.用戶一旦在本平臺上傳或展示內容或作品，即視為授予本平臺該內容著作權之免費及非獨家、永久的許可使用權，本平臺有權為展示、傳播及推廣前述內容之目的，對上述內容進行複製、修改、展示。由此展示、傳播及推廣行為所產生的損失或利潤，均由本平臺承擔或享有。本平臺有權自主決定是否給予鼓勵或獎勵。</p>
        <p>4.非經本平臺或權利人事先許可，用戶不得對他人上傳或展示的內容進行複製、出售或用作其他商業用途。</p>
        <p>5.平臺帳號處理規則</p>
        <p>5.1無視國家規定，在姓名、角色名等地方中使用違規詞語或不文明詞語、非法字元。視情節輕重給予時限性凍結帳號的處罰；情節嚴重者，給予永久凍結的處罰。</p>
        <p>5.2涉及到侵入、攔截、破壞、複製、修改程式，以及宣揚、叫賣和使用各種輔助性程式或惡性非法程式，即使用外掛程式、或在服務中宣傳外掛程式的行為。視情節輕重給予時限性凍結帳號的處罰；情節嚴重者，給予永久凍結的處罰。</p>
        <p>5.3以任何弄虛作假的形式來蒙蔽或者欺騙其他用戶，如發佈模仿官方並帶有病毒的網站、非官方中獎資訊、非法廣告、代碼、木馬、外掛、病毒、色情資訊、垃圾廣告等資訊。視情節輕重給予時限性凍結帳號的處罰；情節嚴重者，給予永久凍結的處罰。</p>
        <p>5.4通過平臺帳號發佈非法網站，宣傳或使用代碼、木馬、外掛、病毒、色情資訊、垃圾廣告、非法廣告等資訊。視情節輕重給予時限性凍結帳號的處罰；情節嚴重者，給予永久凍結的處罰。</p>
        <p>5.5通過平臺帳號發佈觸犯政府法令的文字如：煽動、反動、猥褻、暴力、種族歧視、宗教歧視等字眼，包含這類相關字的反向書寫。視情節輕重給予時限性凍結帳號的處罰；情節嚴重者，給予永久凍結的處罰，並上報相關部門追究其法律責任。</p>
        <p>5.6宣傳或販賣BUG、攻擊伺服器運行、牟取個人利益、影響公平性，以及影響其他玩家正常進行等行為。查證核實後，將暫停帳號，並清除所有非法物品；視情節輕重給予時限性凍結帳號的處罰；情節嚴重者，給予永久凍結的處罰。</p>
        <p>5.7盜取或參與盜取他人帳號，給被盜者造成嚴重損失的行為。查證核實後，視情節輕重給予時限性凍結帳號的處罰；情節嚴重者，給予永久凍結的處罰，並上報相關部門追究其法律責任。</p>
        <p>5.8侮辱、譭謗、猥褻、威脅、辱罵其他用戶，扭曲事實、惡意散佈不實謠言，惡意影響平臺服務環境等行為。視情節輕重給予時限性凍結帳號的處罰；情節嚴重者，給予永久凍結的處罰。</p>
        <h6>八、本平臺權利以及免責說明</h6>
        <p>1.除本服務條款/協議既有約定外，本平臺享有如下知識產權等權利：</p>
        <p>1.1本平臺對本服務及本服務所使用的軟體、程式和受知識產權相關法律或其他法律保護的資料享有相應的權利。</p>
        <p>1.2經由本服務傳送的內容，受到著作權法、商標法、專利法或其他法律的保護；未經本平臺明示授權許可，用戶不得進行修改、出租、散佈或衍生其他作品，用戶本人創作並在公開使用區域張貼的內容除外。</p>
        <p>1.3用戶對本服務所使用的軟體有非專屬性使用權，但自己不得或許可任何第三方複製、修改、出售或衍生產品。</p>
        <p>1.4平臺帳號及其他平臺帳號圖樣、產品及服務名稱，均為本平臺及其關聯公司所享有，未經本平臺所事先書面授權，任何人不得使用、 複製或用作其他用途。</p>
        <p>2.本平臺對於本服務包含的或用戶經由或從任何與本服務有關的途徑所獲得的任何內容、資訊或廣告，不保證其正確性或可靠性；並且對於用戶經本服務上的廣告、展示而購買、取得的任何產品、資訊或資料，本平臺不負保證責任。用戶自行承擔使用本服務的風險。</p>
        <p>3.本平臺有權改善或更正本服務任何部分之任何疏漏、錯誤。</p>
        <p>4.本平臺不保證以下事項（包括但不限於）：</p>
        <p class="list">
            a)本服務適合所有用戶的使用要求；
            <br />b)本服務不受干擾，及時、安全、可靠或不出現錯誤；
            <br />c)用戶經由本服務取得的任何產品、服務或其他材料符合用戶的期望；
        </p>
        <p>5.用戶使用經由本服務下載的或取得的任何資料，其風險自行負擔；因該使用而導致的手機或其他設備系統損壞或資料流失，用戶應負完全責任；</p>
        <p>6.對基於以下原因而造成的利潤、商業信譽、資料的損失或其他有形或無形損失，本平臺不承擔任何直接、間接、附帶、衍生或懲罰性的賠償：</p>
        <p class="list">
            a)本服務使用或無法使用；
            <br />b)經由本服務購買或取得的任何產品、資料或服務；
            <br />c)用戶資料遭到未授權的使用或修改；
            <br />d)用戶資料丟失或被刪除；
            <br />e)其他與本服務相關的事宜。
        </p>
        <p>7.用戶在流覽網際網路時自行判斷使用平臺帳號的檢索目錄。該檢索目錄可能會引導用戶進入到被認為具有攻擊性或不適當的網站，本平臺沒無法查看檢索目錄所列網站的內容，因此，對其正確性、合法性、正當性不負任何責任。</p>
        <p>8.本平臺受到知識產權等相關法律法規和保護條例的保護和約束，本平臺上傳輸、發佈、展示的內容歸原作者/權利人所有。未經原作者/權利人同意，用戶不得擅自進行全部或部分複製、修改、改編、翻譯、彙編並上傳發佈或者商業使用。本平臺內容原作者/權利人如不願在本平臺刊登內容，請及時通知本平臺予以刪除或限制發佈。</p>
        <p>9.基於用戶對本條免責申明的嚴格遵守，本平臺為用戶提供上傳、發佈管道和資訊儲存等服務，本平臺對該用戶發佈的內容不做任何修改或編輯，用戶應謹慎使用並對發佈的內容承擔責任。本平臺不保證用戶發佈內容的安全性，用戶應自行留存原稿，對因任何原因導致上傳的內容滅失的，本平臺不承擔責任。</p>
        <p>10.本平臺內容不代表本平臺觀點，僅供參考以用戶交流，不表示本平臺對用戶任何行為依據的指導和建議。因此而引發任何爭議，與本平臺無關。本平臺中非本平臺發佈的鏈接或其他指向性內容非本平臺控制資源，本平臺不保證該其真實性、合法性、完整性和安全性，用戶應謹慎判斷，任何因使用或信賴該鏈接內容而造成的損失，本平臺均不承擔任何責任。</p>
        <p>11.本平臺發佈內容系為展示以及用戶與其他用戶交流之用，擅自存儲、轉載或用於商業用途，可能侵犯他人合法權利。</p>
        <p>12.本平臺可能因駭客攻擊、電腦病毒、政府管制、電信部門互聯網軟硬體設備故障或失靈而造成暫時性中斷、延遲、遺漏等非正常狀態，或與本平臺鏈接的其他網站原因導致資料洩露、丟失、被盜用或被篡改等，本平臺不承擔任何責任。</p>
        <p>13.本平臺有權為宣傳本平臺之目的使用用戶或其他用戶上傳的內容，且無需向用戶支付任何費用或承擔任何責任。本平臺在宣傳推廣用戶發佈的內容時，有權同時標注本平臺的標識。</p>
        <p>14.用戶應妥善保管使用本平臺時可能涉及的個人資訊，如用戶將資訊提供其他人使用等，從而導致洩露的，由用戶自行負責。</p>
        <h6>九、通知及管轄</h6>
        <p>1.本平臺向用戶發出的通知，可以採用電子郵件、頁面公告、常規信件、電話或本平臺認為適合的形式。服務條款的修改或其他事項變更時，本平臺將會以上述形式進行通知。</p>
        <p>2.本服務條款的生效、履行、解釋及爭議的解決均適用中華人民共和國大陸地區法律，用戶因使用平臺或其他因本協議的履行與本平臺產生爭議的，應提交廣州市廣州商事仲裁委員會仲裁解決。</p>
        <p>3.如果本服務協議中某項條款因與中華人民共和國大陸地區現行法律相抵觸而導致無效，將不影響其他部分的效力。</p>
        <h6>十、聯繫方式</h6>
        <p>如果權利人發現用戶發佈、展示的內容侵犯其他用戶或權利人的合法權益，請及時向本平臺提出權利通知，將權屬證明、具體鏈接及詳細侵權情況證明發往【business@17sing.tw】，本平臺將竭誠處理。</p>
    </div>
</template>