const Lang = {
    ActNot: 'لم يبدأ النشاط    ', //活動未開始
    ActEnd: 'قد انتهى النشاط    ', //活動已結束
    ok: 'حسنا    ', //我知道啦
    GameB: 'عملات الحفلة:',  //盛典幣：
    fiveTips: 'مبروك الفوز بالجوائز التالية في 5 سحوبات متتالية:    ',//恭喜您連抽5次獲得以下獎品
    noCointTitle: 'لا يمكن اليانصيب    ',  //無法抽獎
    noCoinsTips4: 'عدد عملات الحفلة غير كافي لا يمكن اليانصيب    ', //您的盛典幣餘額不足，無法抽獎
    noCoinsTips2: 'ربح عملات الحفلة>>',  //快去賺取盛典幣吧！
    noRank: 'ليس في القائمة',  //未上榜
    myScore: 'نقاط الكرنفال لي:', //我的歡樂值：
    lastRankScore: 'فرق نقاط الكرنفال لتكون موجودا في القائمة هو:', //距離上榜還差歡樂值：
    myScore2: 'نقاط الثروة:',   //助攻值
    lastRankScore2: 'الفرق لتكون موجودا في القائمة:X نقاط الثروة    ', //離上榜還差助攻值：
    storeNum: 'قد تم الشحن：',  //已累計儲值:
    numTips2: 'تفوق على الثاني ',  //遠超第二名:
    numTips3: 'الفرق لتفوق على المرتبة أمامك في القائمة هو: ', //離趕超上一名還差:
    numTips4: 'الفرق لتكون موجودا في القائمة:  ', //離上榜領取獎勵還差:
    singUpNo: 'فشل التسجيل',  //報名失敗
    noData: 'لا يوجد معطيات الآن',  //暫無數據
    happyScore: 'نقاط الكرنفال:',// 歡樂值：
    rankTips1: 'نقاط الكرنفال= عدد عملات الحفلة التي استخدمتها', //歡樂值=使用的盛典幣數量
    mvpTips1: 'درجتي:', //我的等级:
    mvpTips2: 'نقاط الثروة:', //助攻值:
    mvpTips3: 'نقاط الثروة=قيمة السحرية من الهدايا التي أهديتها بعد التسجيل في غرفة الغناء و أعمال',//助攻值=報名後在作品或K歌房送出的金幣禮物魅力值
    mvpTips4: ' نقاط الثروة يصل إلى <em>X</em> يمكن حصول على:    ', //助攻值達到 <em>{{showBoxItem.limit}}</em> 可領取
    mvpTips5: '(يعني درجة X)    ', //(即升級到Lv.{{showBoxItem.level}}等級)
    mvpTips6: 'الاستلام بنجاح', //領取成功
    mvpTips7: 'الجوائز المقابلة ستصدر إلى حسابك، يرجي التحقق.',//對應獎勵已派發到您的賬戶上,<br/>請注意查收
    day: 'أيام', //天
    loading: 'جار التحميل...',  //加載中
    // noPeople: 'Saat ini tidak ada penyanyi dalam peringkat, menunggu Anda!',
    chuzTips1: '1. صلاحية الهدايا للحقيبة كلها 14 يوما    ', //1.背包禮物需更新到最新版本才可使用~
    chuzTips2: '2. جوائز الترتيب ستصدر بالنظام تلقائيا في ساعة 23:00:00 في يوم 27 من ديسمبر    ', //2.排行獎勵將於感恩節結束後14個工作日內派發完畢~
    // chuzTips3: '2.排行獎勵將於聖誕節結束後14個工作日內派發完畢~',
    taskTips1: 'تُضاف عملات الحفلة التي تم الحصول عليها من خلال المهمة تلقائيًا إلى الحساب ، ولا يتم حذف عملات الحفلة التي يتم الحصول عليها كل يوم.', //任務達成盛典幣自動到賬，每天獲得的盛典幣清0
    taskTips2: 'مهمات يومية ', //每日任務
    taskTips3: 'معدل التقدم    ', //進度
    taskTips4: 'تم الاكمال    ', //已達成
    luckTips1: 'مبروك عليك لحصول على ', //恭喜您成功抽中了
    luckTips2: 'وقت اليانصيب ', //抽獎時間
    luckTips3: 'الجوائز التي حصلت عليها', //獲得的獎品
    luckTips4: 'سجل اليانصيب فارغ، أسرع واربح عملات الحفلة لليانصيب!', //抽獎紀錄空空如也<br />快去賺取盛典幣抽獎吧！
    luckTips5: 'لا يمكن اليانصيب', //無法抽獎
    luckTips6: 'لم يتم التسجيل ، لا يمكن اليانصيب، انقر التسجيل أولا!', //您還未報名，無法抽獎  快去報名吧！
    luckTips8: 'صلاحية 7 أيام    ', //有效期為7天
    luckTips9: 'صلاحية 1 يوم    ', //有效期為1天
    luckTips11: 'صلاحية الهدايا 7 أيام    ', //背包禮物有效期為7天
    luckTips12: 'صلاحية تذكرة الشحن 1 يوم    ', //儲值券有效期為1天
    luckTips13: 'صلاحية تذكرة الاهداء 1 يوم    ',//送禮券有效期為1天
}
export default Lang