<template>
  <div class="wards">
    <p class="activeTime">活動時間:11月4日18:00:00-11月11日20:00:00</p>
    <h5>作品爭霸榜前10名獎勵</h5>
    <div class="wardTop">
      <h5>第一名</h5>
      <p>禮物王者徽章（31天）+8位靚號+1個月VIP+赤鷹戰機座駕（30天）+限量超跑作品背包禮物（1888金幣）+3000金幣+3000金豆</p>
      <h5>第二名</h5>
      <p>禮物王者徽章（31天）+8位靚號+1個月VIP+赤鷹戰機座駕（15天）+限量超跑作品背包禮物（1888金幣）+2000金幣+2000金豆</p>
      <h5>第三名</h5>
      <p>禮物王者徽章（31天）+1個月VIP+赤鷹戰機座駕（15天）+限量超跑作品背包禮物（1888金幣）+1500金幣+1500金豆</p>
      <h5>第四名-第五名</h5>
      <p>禮物王者徽章（31天）+赤鷹戰機座駕（9天）+限量超跑背包禮物*1+1000金幣+1000金豆</p>
      <h5>第六名-第十名</h5>
      <p>赤鷹戰機座駕（6天）+限量超跑背包禮物*1+800金幣+800金豆</p>
    </div>
    <h5>K房爭霸榜前10名獎勵</h5>
    <div class="kRoomTop">
      <h5>第一名</h5>
      <p>禮物王者徽章（31天）+8位靚號+1個月VIP+赤鷹戰機座駕（30天）+限量超跑作品背包禮物（1888金幣）+3000金幣+3000金豆</p>
      <h5>第二名</h5>
      <p>禮物王者徽章（31天）+8位靚號+1個月VIP+赤鷹戰機座駕（15天）+限量超跑作品背包禮物（1888金幣）+2000金幣+2000金豆</p>
      <h5>第三名</h5>
      <p>禮物王者徽章（31天）+1個月VIP+赤鷹戰機座駕（15天）+限量超跑作品背包禮物（1888金幣）+1500金幣+1500金豆</p>
      <h5>第四名-第五名</h5>
      <p>禮物王者徽章（31天）+赤鷹戰機座駕（9天）+限量超跑背包禮物*1+1000金幣+1000金豆</p>
      <h5>第六名-第十名</h5>
      <p>赤鷹戰機座駕（6天）+限量超跑背包禮物*1+800金幣+800金豆</p>
    </div>
    <h5>人氣爭霸榜前10名獎勵</h5>
    <div class="peopleTop">
      <h5>第一名</h5>
      <p>人氣王者徽章（31天）+VIP會員（30天）+守護天使背包禮物（600金幣）*1+1500金幣+1500金豆</p>
      <h5>第二名</h5>
      <p>人氣王者徽章（31天）+VIP會員（15天）+守護天使背包禮物（600金幣）*1+1000金幣+1000金豆</p>
      <h5>第三名</h5>
      <p>人氣王者徽章（31天）+VIP會員（15天）+守護天使背包禮物（600金幣）*1+800金幣+800金豆</p>
      <h5>第四名-第五名</h5>
      <p>人氣王者徽章（31天）+VIP會員（15天）+守護天使背包禮物（600金幣）*1+600金幣+600金豆</p>
      <h5>第六名-第十名</h5>
      <p>VIP會員（28天）+浪漫花車背包禮物（298金幣）*1+300金幣+600金豆</p>
    </div>

    <h5>金幣返還獎勵：</h5>
    <div class="fanhuan">
      <p>1、向報名活動後發佈的公開作品贈送珍珠奶茶（10金幣）、誘惑烤肉（59金幣）、暖心火鍋（299金幣），次日凌晨返禮物金幣數的5%金幣。如當天贈送1個價值299金幣的暖心火鍋禮物，則在次日凌晨獎勵15金幣</p>
      <p>2、向報名活動後在K房上麥的用戶贈送星空奶茶（10金幣）、海鮮意麵（59金幣）、霸氣串串（299金幣）禮物，次日凌晨返禮物金幣數的5%金幣。如當天贈送1個價值299金幣的霸氣串串禮物，則在次日凌晨獎勵15金幣</p>
    </div>

    <h5>獎勵說明：</h5>
    <p>1、獲得8位數靚號獎勵，官方號UID10會與您聯繫，在官方提供的靚號庫範圍內篩選確認靚號號碼，以及需要提供未在歡歌平台註冊過的手機號碼進行綁定</p>
    <p>2、該活動獲得的背包禮物獎勵，安卓版本可在我-背包中查看，而且送禮時，選擇背包禮物送出。IOS可前往app store 搜尋最新版本“高歌”，下載使用</p>
    <p class="btnMsg">本活動的最終解釋權歸活動主辦方所有</p>
  </div>
</template>

<script>
export default {

}
</script>

<style lang="scss" scoped>
.wards {
  p {
    font-size: 80%;
    line-height: 0.36rem;
  }
  .activeTime {
    color: #ffb26d;
    text-align: center;
    margin-top: 0.51rem;
  }
  > h5 {
    text-align: center;
    font-size: 120%;
    color: #ffb746;
    margin-top: 0.57rem;
  }
  .wardTop {
    > h5 {
      color: #ffc8b9;
      font-size: 80%;
      margin-top: 0.2rem;
    }
    p {
      color: #ffc8b9;
      font-size: 80%;
    }
  }
  .kRoomTop {
    > h5 {
      color: #ffc8b9;
      font-size: 80%;
      margin-top: 0.2rem;
    }
    p {
      color: #ffc8b9;
      font-size: 80%;
    }
  }
  .peopleTop {
    > h5 {
      color: #ffc8b9;
      font-size: 80%;
      margin-top: 0.2rem;
    }
    p {
      color: #ffc8b9;
      font-size: 80%;
    }
  }
  .fanhuan {
    p {
      color: #ffc8b9;
      margin-top: 0.27rem;
    }
  }
  p {
    color: #ffc8b9;
  }
  .btnMsg {
    margin-top: 0.2rem;
    text-align: center;
  }
}
</style>
