<template>
  <div class="rules">
    <p class="activeTime">12:00 في يوم 11 من سبتمبر-23:00 في يوم 20 من سبتمبر بتوقيت دبي</p>
    <h5>التسجيل</h5>
    <p>1. انقر "التسجيل الآن" لاشتراك، وستحصى قيم السحر من هدايا متلقاة لأعمال تنشرها بعد التسجيل وقيم السحر من الهدايا المتلقاة في غرفة الغناء(ليس من الضروري أن تنشر أعمالك في الإعلان)</p>
    <p>2.تحصى قيم السحر من الهدايا المتلقاة لأعمال فردية أو جوقة أو MV أو جوقة MV فقط، يعني لا تشمل على sing a cappella</p>
    <p>3. إذا تم حذف الأعمال التي تنشرها أثناء النشاط، فستكون درجة قيم السحر للأعمال المحذوفة غير صالحة</p>
    <h5>قواعد الترتيب لقائمة الأعمال</h5>
    <p>1. بعد اشتراك المسابقة، أعمالك المشتركة في المسابقة، سيجري ترتيبها حسب قيمة السحر من الهدايا المتلقاة المحددة</p>
    <p>2. الهدايا المحددة للأعمال هي ضد فيروس(29 عملات) سائل غسل اليدين(199 عملة) بدلة واقية(999 عملة)</p>
    <p>3. إذا تحصلون على نفس قيمة السحر للهدايا المحددة، فيُضَع ترتيب من توصل إلى هذه القيمة قبل اآخرين أمامهم</p>
    <p>4. تظهر القائمة درجات أفضل 100 فقط</p>
    <h5>قواعد الترتيب لقائمة غرفة الغناء</h5>
    <p>1. بعد التسجيل، سيجري الترتيب حسب قيمة السحر من الهدايا المتلقاة المحددة في غرفة الغناء </p>
    <p>2. الهدايا المحددة لغرفة الغناء هي نظارات واقية(29 عملات) مطهر مائي(199 عملة) درع واقي(999 عملة)</p>
    <p>3. إذا تحصلون على نفس قيمة السحر للهدايا المحددة، فيُضَع ترتيب من توصل إلى هذه القيمة قبل اآخرين أمامهم</p>
    <p>4. تظهر القائمة درجات أفضل 100 فقط</p>
    <h5>قواعد الترتيب لقائمة الشعبية</h5>
    <p>1.ترتيب حسب عدد الأشخاص الذين يعطونك هذه الهدايا المحددة في غرفة الغناء أو لأعمالك</p>
    <p>2.إذا هناك شخص ما يعطيك هذه الهدايا في غرفة الغناء، وفي نفس الوقت، يعطيك أيضا لأعمالك، في هذه الحالة، يحصى شخصا واحدا فقط لترتيبك في قائمة الشعبية</p>
    <p>3. إذا تحصلون على نفس عدد الأشخاص، فيُضَع ترتيب من توصل إلى هذا العدد قبل اآخرين أمامهم</p>
    <h5>جائزة إعادة العملات</h5>
    <p>1.إهداء هدايا ضد فيروس(29 عملات) سائل غسل اليدين(199 عملة) بدلة واقية(999 عملة) للأعمال المشتركة، سوف تصل إليك 5% عملات من الهدايا التي تهديها في 00:00 في اليوم القادم. مثلا، إذا تهدي هدية سائل غسل اليدين لعمل مشترك ما، فستصل إليك 10 عملة في 00:00 في اليوم القادم</p>
    <p>2.إهداء هدايا نظارات واقية(29 عملات) مطهر مائي(199 عملة) درع واقي(999 عملة) في غرفة الغناء، سوف تصل إليك 5% عملات من الهدايا التي تهديها في 00:00 في اليوم القادم. مثلا، إذا تهدي هدية مطهر مائي في غرفة الغناء، فستصل إليك 10 عملة في 00:00 في اليوم القادم</p>
    <h5>الآخر</h5>
    <div>
      <p>أثناء المسابقة ، إذا تبين أن المستخدم يستخدم الوسائل غير المناسبة للمشاركة في النشاط ، يحق للمسؤول إلغاء المؤهل دون إشعار مسبق ، وفي الحالات الشديدة ، سيتم حظر رقم حساب المشارك ، بما في ذلك على سبيل المثال لا الحصر:</p>
      <div class="list">
        <p>1. أعمالك المشتركة لا تغنيها نفسك أو تستخدم تسجيل الآخرين</p>
        <p>2. تسرق حساب الآخرين أو تستعيره لاشتراك في المسابقة</p>
        <p>3. تفتح حسابات كثيرة لاشتراك في المسابقة</p>
        <p>4. تعلق على آخر المستخدمين بالكلمات السيئة أو ترسلهم إعلانات في فترة النشاط</p>
        <p>5. تشترك في النشاط عن طريق غير لائق</p>
      </div>
      <p>إذا تغش في المسابقة، لحق للمنظم أن يحظر كل حساباتك، ويلغي جوائزك التي تكتسب في المسابقة</p>
    </div>
    <p class="btnMsg">التفسير النهائي لهذا النشاط ينتمي إلى المنظم</p>
  </div>
</template>

<script>
export default {

}
</script>

<style lang="scss" scoped>
.rules {
  padding-bottom: 0.3rem;
  p {
    margin-top: 0.1rem;
    line-height: 0.36rem;
    font-size: 80%;
  }
  .activeTime {
    color: #db97b4;
    text-align: center;
    margin-top: 0.51rem;
  }
  > h5 {
    text-align: center;
    font-size: 120%;
    color: #ffe65a;
    margin-top: 0.57rem;
  }
  .actSingUp {
    > h5 {
      color: #b9fffb;
      font-size: 80%;
      margin-top: 0.2rem;
    }
  }
  p {
    color: rgba(122, 205, 236, 1);
  }
  .list {
    p {
      text-indent: 0.2rem;
    }
  }
  .btnMsg {
    margin-top: 0.2rem;
    text-align: center;
    color: #ccbaff;
  }
}
</style>
