const wards = {
    1: "金豆背包禮物皇冠車 ",   //語聊房揹包禮物
    2: "金豆背包禮物仙女棒", //作品揹包禮物
    3: "金豆背包禮物元氣蛋麵", //Ｋ房揹包禮物
    4: "3%單次儲值金幣返利券", //3%储值返利券
    5: "4%單次儲值金幣返利券", //5%储值返利券
    6: "5%單次儲值金幣返利券", //10%储值返利券
    7: "滿150返15 </br>送禮金幣返利券", //150返30送礼返利券
    8: "滿500返60 </br>送禮金幣返利券", //500返120送礼返利券
    9: "滿1000返150 </br>送禮金幣返利券", //1000返300送礼返利券
    10: "50老虎幣", //50老虎币
    11: "100老虎幣", //100老虎币
    12: "150老虎幣", //150老虎币
    13: "10金幣", //10金币
    14: "20金幣", //20金币
    15: "30金幣", //30金币
    16: "50金幣", //50金币
    17: "60金幣", //60金币
    18: "30金豆", //30金豆
    19: "50金豆",  //50金豆
    20: "80金豆", //80金豆
    21: "100金豆", //100金豆
    22: "150金豆", //150金豆
    23: "200金豆", //200金豆
    // 24: "Quý tộc Kỵ Sĩ", //骑士贵族
    // 25: "Quý tộc Tử Tước", //子爵贵族
    // 26: "Quý tộc Bá Tước", //伯爵贵族
    27: "Vip(3天)", //会员3天
    28: "4-6位新靚號", //8位靓号
    29: "Double卡", //double卡
    30: "幸運兌換券"
}
export default wards