<template>
    <div class="wards">
        <p class="activeTime">活動時間:7月26日12:00:00-8月2日20:00:00</p>
        <h5>作品爭霸榜前10名獎勵</h5>
        <div class="wardTop">
            <h5>第一名</h5>
            <p>價值10000金幣的公爵貴族（31天）+禮物王者徽章（31天）+雪糕車座駕（28天）+摩天輪作品背包禮物（880金幣）+3000金幣+3000金豆</p>
            <h5>第二名</h5>
            <p>價值3000金幣的侯爵貴族（31天）+禮物王者徽章（31天）+雪糕車座駕（14天）+摩天輪作品背包禮物（880金幣）+2000金幣+2000金豆</p>
            <h5>第三名</h5>
            <p>價值1000金幣的伯爵貴族（31天）+禮物王者徽章（31天）+雪糕車座駕（14天）+摩天輪作品背包禮物（880金幣）+1500金幣+1500金豆</p>
            <h5>第四名-第五名</h5>
            <p>禮物王者徽章（31天）+雪糕車座駕（7天）+摩天輪作品背包禮物（880金幣）+1000金幣+1000金豆</p>
            <h5>第六名-第十名</h5>
            <p>雪糕車座駕（7天）+摩天輪作品背包禮物（880金幣）+800金幣+800金豆</p>
        </div>
        <h5>K房爭霸榜前10名獎勵</h5>
        <div class="kRoomTop">
            <h5>第一名</h5>
            <p>價值10000金幣的公爵貴族（31天）+禮物王者徽章（31天）+雪糕車座駕（28天）+摩天輪作品背包禮物（880金幣）+3000金幣+3000金豆</p>
            <h5>第二名</h5>
            <p>價值3000金幣的侯爵貴族（31天）+禮物王者徽章（31天）+雪糕車座駕（14天）+摩天輪作品背包禮物（880金幣）+2000金幣+2000金豆</p>
            <h5>第三名</h5>
            <p>價值1000金幣的伯爵貴族（31天）+禮物王者徽章（31天）+雪糕車座駕（14天）+摩天輪作品背包禮物（880金幣）+1500金幣+1500金豆</p>
            <h5>第四名-第五名</h5>
            <p>禮物王者徽章（31天）+雪糕車座駕（7天）+摩天輪作品背包禮物（880金幣）+1000金幣+1000金豆</p>
            <h5>第六名-第十名</h5>
            <p>雪糕車座駕（7天）+摩天輪作品背包禮物（880金幣）+800金幣+800金豆</p>
        </div>
        <h5>金幣返還獎勵</h5>
        <div class="fanhuan">
            <p>1、向報名活動後發佈的公開作品贈送椰子水（10金幣）、玩具水槍（100金幣）、雪糕車（600金幣），次日凌晨返禮物金幣數的5%金幣。如當天贈送1個價值600金幣的雪糕車禮物，則在次日凌晨獎勵30金幣</p>
            <p>2、向報名活動後在K房上麥的用戶贈送冰淇淋（10金幣）、沙灘椅（100金幣）、海景房（600金幣）禮物，次日凌晨返禮物金幣數的5%金幣。如當天贈送1個價值600金幣的海景房禮物，則在次日凌晨獎勵30金幣</p>
        </div>
    </div>
</template>

<script>
export default {

}
</script>

<style lang="scss" scoped>
    .wards{
        p{
            font-size: 80%;
            line-height: .36rem;
        }
        .activeTime{
            color:#6FFFF3;
            text-align: left;
            margin-top: .51rem;
        }
        >h5{
            text-align: center;
            font-size: 120%;
            color: #FFED6A;
            margin-top: .57rem;
        }
        .wardTop{
            >h5{
                color:#6FFFF3;
                font-size: 80%;
                margin-top: .2rem;
            }
            p{
                font-size: 80%;
            }
        }
        .kRoomTop{
            >h5{
                color:#6FFFF3;
                font-size: 80%;
                margin-top: .2rem;
            }
        }
        .fanhuan{
            p{
                margin-top: .27rem;
            }
        }
    }
</style>
