const lang = {
    rule: "القواعد&الجوائز",  //規則&獎勵
    surpriseTime: 'الأوقات المدهشة', // 驚喜時刻
    ok: 'عرفت',    //我知道啦
    noStart: 'لم يبدأ النشاط', //活動未開始
    actEnd: 'انتهى النشاط', // 活動已結束
    bigBox: 'المربعالأعلى الدهشة',   //終極盲盒
    todayScore: 'نقاط اليوم:',
    totalScore: 'إجمالي نقاط الدهشة:',
    rudexScore: 'يحتاج فتح المربع الأعلى الدهشة إلى: ',
    dayRank: 'القائمة اليومية',
    totalRank: 'القائمة العامة',
    dayRankTips: 'نقاط الدهشة= إجمالي قيم سحر الهدايا التي تهديها من الأعمال وغرفة الغناء وغرفة الدردشة',
    dayDownTime: 'العد التنازلي لانتهاء قائمة اليوم',
    dayStartTime: 'العد التنازلي لبدء قائمة هذا اليوم',
    dayNoTime: 'انتهى القائمة اليومية',
    totalDownTime: 'العد التنازلي لانتهاء النشاط',
    totalStartTime: 'العد التنازلي لبدء النشاط',
    day: 'يوم    ',
    hours: 'ساعة    ',
    min: 'دقيقة    ',
    second: "ثانية    ",
    luckGrade: 'درجة الدهشة:',
    ticket: 'تذكرة إعادة %X عملات للشحن',
    lv: 'Lv.',
    oneDayOpen: 'لا يمكن أن تفتحه إلا مرة واحدة كل يوم',
    open: 'افتحه    ',
    opened: 'قد فُتِح    ',
    actOpen: 'لا يمكن أن تفتحه إلا مرة واحدة أثناء النشاط    ',
    totalOpenEd: 'قد فتحت هذا المربع الأعلى الدهشة    ',
    couldOpenTotalBox: 'تستطيع فتح هذا المربع الأعلى الدهشة    ',
    luck: 'درجتك الحالية: Lv.',
    ok: 'تحديد',
    bean: ' فول',
    ticket: 'تذكرة إعادة %X عملات للشحن',
    openDayBoxTips1: 'لا يمكن أن تفتح المربع الأعمى إلا لمرة واحدة كل يوم، لك فرصة لكسب المربع الأعمى بالدرجة الأعلى مع الجوائز الكبرى، هل أنت متأكد من فتح هذا المربع الأعمى؟',
    openDayBoxTips2: 'لم تصل إلى 50 نقاط الدهشة</br> لا يمكن فتحه الآن    ',
    openDayBoxTips3: 'قد فتحت هذا المربع المدهش</br> تفضل بالمحاولة غدا    ',
    openTotalBoxTips1: 'لم تصل إلى 300000 نقاط الدهشة، فلا يمكن فتح المربع الأعلى الدهشة    ',
    sucPup1Tips: 'رائعا! مبروك لفوز بالجوائز، تفضل بالتحقق',
    day: 'يوم ',
    singUp: 'التسجيل',
    openBoxTime: 'الوقت    ',
    gift: 'الجوائز    ',
    noData: 'لا توجد البيانات حاليا    ',
    noSingUpTips: 'انقر التسجيل للاشتراك',
    gx: 'مبروك!',
    get: ' يكسب '
}
export default lang