<template>
  <div class="wards">
    <p class="activeTime">الوقت:14:30 في يوم 26 من سبتمبر-16:00 في يوم 3 من أكتوبر بتوقيت دبي</p>
    <h5>جوائز لقائمة هدايا الأعمال</h5>
    <div class="wardTop">
      <h5>المركز الأول:</h5>
      <p>هدية الحذاء البلوري للحقيبة*5(ثلاثون يوما) + شارة ملك الهدايا(ثلاثون يوما) + VIP لثلاثين يوما + 3000 عملة + 3000 فول</p>
      <h5>المركز الثاني:</h5>
      <p>هدية الحذاء البلوري للحقيبة*3(ثلاثون يوما) + شارة ملك الهدايا(عشرون يوما) + VIP لثلاثين يوما + 2000 عملة + 2000 فول</p>
      <h5>المركز الثالث:</h5>
      <p>هدية الحذاء البلوري للحقيبة*1(ثلاثون يوما) + شارة ملك الهدايا(عشرة أيام) + VIP لثلاثين يوما + 1000 عملة + 1000 فول</p>
      <h5>المراكز 4-5:</h5>
      <p>شارة ملك الهدايا(عشرة أيام) + VIP لثلاثين يوما + 1000 عملة + 1000 فول</p>
      <h5>المراكز 6-10:</h5>
      <p>VIP لثلاثين يوما + 800 عملة + 800 فول</p>
    </div>
    <h5>جوائز لقائمة هدايا في غرفة الغناء</h5>
    <div class="kRoomTop">
      <h5>المركز الأول:</h5>
      <p>هدية الحذاء البلوري للحقيبة*5(ثلاثون يوما) + شارة ملك الهدايا(ثلاثون يوما) + VIP لثلاثين يوما + 3000 عملة + 3000 فول</p>
      <h5>المركز الثاني:</h5>
      <p>هدية الحذاء البلوري للحقيبة*3(ثلاثون يوما) + شارة ملك الهدايا(عشرون يوما) + VIP لثلاثين يوما + 2000 عملة + 2000 فول</p>
      <h5>المركز الثالث:</h5>
      <p>هدية الحذاء البلوري للحقيبة*1(ثلاثون يوما) + شارة ملك الهدايا(عشرة أيام) + VIP لثلاثين يوما + 1000 عملة + 1000 فول</p>
      <h5>المراكز 4-5:</h5>
      <p>شارة ملك الهدايا(عشرة أيام) + VIP لثلاثين يوما + 1000 عملة + 1000 فول</p>
      <h5>المراكز 6-10:</h5>
      <p>VIP لثلاثين يوما + 800 عملة + 800 فول</p>
    </div>
    <h5>جائزة إعادة العملات:</h5>
    <div class="fanhuan">
      <p>1.إهداء هدايا طوف من الخيزران(10 عملات) وكشك الهاتف(58 عملة) وروبوت القط(528 عملة) للأعمال المشتركة، سوف تصل إليك 5% عملات من الهدايا التي تهديها في 00:00 في اليوم القادم. مثلا، إذا تهدي هدية روبوت القط لعمل مشترك ما، فستصل إليك 27 عملة في 00:00 في اليوم القادم</p>
      <p>2.إهداء هدايا دوراياكي(10 عملات) والباب التعسفي(58 عملة) وآلة الزمن(528 عملة) في غرفة الغناء، سوف تصل إليك 5% عملات من الهدايا التي تهديها في 00:00 في اليوم القادم. مثلا، إذا تهدي هدية آلة الزمن في غرفة الغناء، فستصل إليك 27 عملة في 00:00 في اليوم القادم</p>
    </div>
  </div>
</template>

<script>
export default {

}
</script>

<style lang="scss" scoped>
.wards {
  p {
    font-size: 80%;
    line-height: 0.36rem;
    color: #c3bfff;
  }
  .activeTime {
    color: #c3bfff;
    text-align: center;
    margin-top: 0.51rem;
  }
  > h5 {
    text-align: center;
    font-size: 120%;
    color: #ffbb8d;
    margin-top: 0.57rem;
  }
  .wardTop {
    > h5 {
      color: #6ffff3;
      font-size: 80%;
      margin-top: 0.2rem;
    }
    p {
      font-size: 80%;
    }
  }
  .kRoomTop {
    > h5 {
      color: #6ffff3;
      font-size: 80%;
      margin-top: 0.2rem;
    }
  }
  .fanhuan {
    p {
      margin-top: 0.27rem;
    }
  }
}
</style>
