<template>
  <div class="ruleList">
    <div class="title">規則&獎勵</div>
    <h5>活動時間：</h5>
    <p>活動時間： 3月1日12:00:00-3月3日23:59:59 <br />活動總計分三輪，每輪禮物拼團結束時間為當天23:59:59 </p>
    <h5>拼團規則</h5>
    <p>
      1.用戶可以自己發起拼團或者參與拼團，可選擇2-5人團，不同人數的團，不同的價格，用戶可以自行選擇發起拼團的個數<br />
      2.每個用戶在每次的拼團裡面只能購買1個禮物，每個用戶同一禮物開啟的拼團未結束，無法開新團<br />
      3.拼團成功的禮物自動放入背包，有效期為7天，會有小助手提醒，請用戶注意查收<br />
      4.發起拼團的訂單在當天23:59:59未拼團成功則退此訂單的金幣
    </p>
    <h5>拼團價格</h5>
    <p>如果一個禮物原價100金幣，2人拼團成功後，則此禮物為95金幣；而4個拼團成功後，則此1個禮物為85金幣</p>
    <img src="./img/table.png" alt="">
    <h5>榜單獎勵</h5>
    <p>榜單以活動期間，用戶成功拼團成功後使用的金幣數為準</p>
    <p>第一名：拼團達人徽章（30天）+霸氣團主信息名片（30天）+團主粑粑頭飾（30天）+團團圓圓作品金幣禮物（100金幣）*5 </p>
    <p> 第二名：拼團達人徽章（15天）+霸氣團主信息名片（15天）+團主粑粑頭飾（15天）+團團圓圓作品金幣禮物（100金幣）*4</p>
    <p> 第三名：拼團達人徽章（7天）+霸氣團主信息名片（7天）+團主粑粑頭飾（7天）+團團圓圓作品金幣禮物（100金幣）*3 </p>
    <p> 第四-五名：團團圓圓作品金幣禮物（100金幣）*2</p>
  </div>
</template>
<script>
export default {

}
</script>
<style lang="scss"
 scoped>
.ruleList {
  padding: 0.6rem 0.25rem 0;
  color: rgba(133, 90, 55, 1);
  .title {
    font-size: 0.36rem;
    text-align: center;
  }
  h5 {
    font-size: 0.32rem;
  }
  p {
    margin: 0.15rem auto 0.3rem;
    font-size: 0.28rem;
    padding-left: 0.65rem;
  }
  img {
    width: 5.64rem;
    height: 4.01rem;
    margin: 0.25rem 0 0.8rem 0.65rem;
  }
}
</style>
