<template>
  <div class="rules">
    <p class="activeTime">活動時間：9月23日18:00:00-9月30日20:00:00</p>
    <h5>活動規則</h5>
    <div class="actSingUp">
      <h5>活動報名</h5>
      <p>1、點擊“立即報名”參加活動</p>
      <p>2、作品爭霸榜需要在點擊“立即報名”後在活動頁面上傳任意公開作品(清唱5分鐘除外)，可上傳多首作品參賽，報名後作品收禮才會被計算，若刪除活動期間發佈的作品，該刪除作品收禮成績作廢</p>
      <h5>作品爭霸榜排名規則：</h5>
      <p>1、按照報名參賽後，參賽作品（帶有#哆啦A梦禮物爭霸賽#標籤）獲得特定禮物的魅力值排名</p>
      <p>2、本活動的作品特定禮物為竹蜻蜓（10金幣）、電話亭（58金幣）、機器貓（528金幣）</p>
      <p>3、若獲得的特定禮物魅力值相同，則先到達該魅力值的排名在前面</p>
      <p>4、榜單展示前100名用戶的比賽成績</p>
      <h5>K房爭霸榜排名規則：</h5>
      <p>1、按照報名活動後在K房上麥獲得特定禮物的魅力值排名</p>
      <p>2、本活動的作品特定禮物為銅鑼燒（10金幣）、任意門（58金幣）、時光機（528金幣）</p>
      <p>3、若收到的特定禮物魅力值相同，則先到達該魅力值的排名在前面</p>
      <p>4、榜單展示前100名用戶的比賽成績</p>
      <!-- <h5>金幣返還獎勵規則：</h5>
      <p>1、向報名活動後發佈的公開作品贈送椰子水（10金幣）、玩具水槍（100金幣）、雪糕車（600金幣），次日凌晨返禮物金幣數的5%金幣。如當天贈送1個價值600金幣的雪糕車禮物，則在次日凌晨獎勵30金幣</p>
      <p>2、向報名活動後在K房上麥的用戶贈送冰淇淋（10金幣）、沙灘椅（100金幣）、海景房（600金幣）禮物，次日凌晨返禮物金幣數的5%金幣。如當天贈送1個價值600金幣的海景房禮物，則在次日凌晨獎勵30金幣</p> -->
    </div>
    <h5>其他說明</h5>
    <div>
      <p>比賽過程中，若發現用戶使用不正當手段參與活動，小歡有權在事先不通知的前提下按情節嚴重對參賽者、違規者做取消其參賽資格或封禁帳號等處罰，包括但不限於：</p>
      <div class="list">
        <p>1）活動作品非本人原唱或盜錄他人作品</p>
        <p>2）盜用或借用他人已有帳號參與活動</p>
        <p>3）同一用戶註冊多個帳號參與活動</p>
        <p>4）比賽期間對參賽作品進行惡意評論，廣告等</p>
        <p>5）通過其他違規行為參與活動</p>
      </div>
      <p>若為主動作弊者，無論是否為參賽者永久封禁該用戶所有大小號，活動結束后小歡任有權收回該用戶所有獎勵</p>
      <p>本活動的最終解釋權歸活動主辦方所有</p>
    </div>
  </div>
</template>

<script>
export default {

}
</script>

<style lang="scss" scoped>
.rules {
  padding-bottom: 1rem;
  p {
    margin-top: 0.1rem;
    line-height: 0.36rem;
    font-size: 80%;
    color: #c3bfff;
  }
  .activeTime {
    color: #c3bfff;
    text-align: center;
    margin-top: 0.51rem;
  }
  > h5 {
    text-align: center;
    font-size: 120%;
    color: #ffbb8d;
    margin-top: 0.57rem;
  }
  .actSingUp {
    > h5 {
      color: #6ffff3;
      font-size: 80%;
      margin-top: 0.2rem;
    }
  }
  .list {
    p {
      text-indent: 0.2rem;
    }
  }
}
</style>
