<template>
  <div class="wards">
    <p class="activeTime">活動時間：9月23日18:00:00-9月30日20:00:00</p>
    <h5>作品爭霸榜前10名獎勵</h5>
    <div class="wardTop">
      <h5>第一名</h5>
      <p>價值10000金幣的公爵貴族（31天）+禮物王者徽章（31天）+ 戰神GTR全新座駕（28天）+限量超跑背包禮物（1888金幣）+3000金幣+3000金豆</p>
      <h5>第二名</h5>
      <p>價值3000金幣的侯爵貴族（31天）+禮物王者徽章（31天）+ 戰神GTR全新座駕（14天）+限量超跑背包禮物（1888金幣）+2000金幣+2000金豆</p>
      <h5>第三名</h5>
      <p>價值1000金幣的伯爵貴族（31天）+禮物王者徽章（31天）+ 戰神GTR全新座駕（14天）+限量超跑背包禮物（1888金幣）+1500金幣+1500金豆</p>
      <h5>第四名-第五名</h5>
      <p>禮物王者徽章（31天）+ 戰神GTR全新座駕（7天）+限量超跑背包禮物（1888金幣）+1000金幣+1000金豆</p>
      <h5>第六名-第十名</h5>
      <p>戰神GTR全新座駕（7天）+限量超跑背包禮物（1888金幣）+800金幣+800金豆</p>
    </div>
    <h5>K房爭霸榜前10名獎勵</h5>
    <div class="kRoomTop">
      <h5>第一名</h5>
      <p>價值10000金幣的公爵貴族（31天）+禮物王者徽章（31天）+ 戰神GTR全新座駕（28天）+限量超跑背包禮物（1888金幣）+3000金幣+3000金豆</p>
      <h5>第二名</h5>
      <p>價值3000金幣的侯爵貴族（31天）+禮物王者徽章（31天）+ 戰神GTR全新座駕（14天）+限量超跑背包禮物（1888金幣）+2000金幣+2000金豆</p>
      <h5>第三名</h5>
      <p>價值1000金幣的伯爵貴族（31天）+禮物王者徽章（31天）+ 戰神GTR全新座駕（14天）+限量超跑背包禮物（1888金幣）+1500金幣+1500金豆</p>
      <h5>第四名-第五名</h5>
      <p>禮物王者徽章（31天）+ 戰神GTR全新座駕（7天）+限量超跑背包禮物（1888金幣）+1000金幣+1000金豆</p>
      <h5>第六名-第十名</h5>
      <p>戰神GTR全新座駕（7天）+限量超跑背包禮物（1888金幣）+800金幣+800金豆</p>
    </div>
    <h5>金幣返還獎勵：</h5>
    <div class="fanhuan">
      <p>1、向報名活動後發佈的公開作品贈送竹蜻蜓（10金幣）、電話亭（58金幣）、機器貓（528金幣），次日凌晨返禮物金幣數的5%金幣。如當天贈送1個價值528金幣的機器貓禮物，則在次日凌晨獎勵27金幣。</p>
      <p>2、向報名活動後在K房上麥的用戶贈送銅鑼燒（10金幣）、任意門（58金幣）、時光機（528金幣），次日凌晨返528金幣的時光機禮物，則在次日凌晨獎勵27金幣。</p>
    </div>
  </div>
</template>

<script>
export default {

}
</script>

<style lang="scss" scoped>
.wards {
  p {
    font-size: 80%;
    line-height: 0.36rem;
    color: #c3bfff;
  }
  .activeTime {
    color: #c3bfff;
    text-align: center;
    margin-top: 0.51rem;
  }
  > h5 {
    text-align: center;
    font-size: 120%;
    color: #ffbb8d;
    margin-top: 0.57rem;
  }
  .wardTop {
    > h5 {
      color: #6ffff3;
      font-size: 80%;
      margin-top: 0.2rem;
    }
    p {
      font-size: 80%;
    }
  }
  .kRoomTop {
    > h5 {
      color: #6ffff3;
      font-size: 80%;
      margin-top: 0.2rem;
    }
  }
  .fanhuan {
    p {
      margin-top: 0.27rem;
    }
  }
}
</style>
