export default {
    title:'魔法寶箱',
    ok: '確定',//確定
    loading: '加載中...',
    no_data: '暫無更多數據~',
    confirm:'確定',//確定
    cancel:'取消',//取消
    openTask:'魔法任務',//魔法任務
    openRule:'規則',//規則
    done:'已完成',//已完成
    clickDone:'該任務已完成',//該任務已完成

    bubbleTips:{
        1:'進入房間',
        2:'在房時長',
        3:'麥上互動',
        4:'消費金幣',
    },

    taskListTips: {
        1:{
            type:'進入房間',
            unit:'%s能量/次',//100能量/次
        },
        2:{
            type:'房間內活躍',
            unit:'%s能量/分鐘',//100能量/次
        },
        3:{
            type:'上麥語音互動',
            unit:'%s能量/分鐘',//100能量/次
        },
        4:{
            type:'房間內消費金幣',
            unit:'%s能量/金幣',//100能量/次
        }
    },
    giftTips:'隨機獲得<span>1</span>個獎勵',//隨機獲得1個獎勵
    uncommon:'稀有',//稀有
    energy:'能量',//能量：
    openEnergyTips:'開啟寶箱領取魔法禮物',//開啟寶箱領取魔法禮物
    openBox:'開啟寶箱',//開啟寶箱

    taskTitle:'魔法任务',//魔法任务
    taskTips:'每日0點更新',//每日0點更新
    get:'領取',//領取

    rule:'玩法規則',//玩法規則
    rule_li:[
        '完成魔法任務獲得能量可開啟魔法寶箱，獲得魔法禮物，贈送後可向對象施展魔法，出現趣味效果；',
        '魔法任務每日0點更新，可重複完成，當天未消耗的能量將失效；',
        '消耗200能量可開啟一次魔法寶箱，有機會獲得一個魔法禮物；<em>當天第5次開啟必定獲得一個稀有魔法禮物；</em>',
    ],
    giftTitle:'魔法禮物',//魔法禮物
    giftName:'禮物名稱',//禮物名稱
    giftProbability:'概率(萬分制)',//概率(萬分制)

    congratulation:'恭喜你獲得',//恭喜你獲得
    sure:'確認',//確認
    unEnergy:'能量不足',//能量不足
    unGet:'做任務，領能量',//做任務，領能量
};
