<template>
    <div class="works">
        <h5>وقت النشاط</h5>
        <p class="time">12:00 في يوم 8 من أغسطس - 12:00 في يوم 18 من أغسطس(توقيت دبي)</p>
        <h5>قواعد القائمة</h5>
        <p>الترتيب حسب عدد النجوم</p>
        <h5>قواعد اكتساب النجوم</h5>
        <p>
            إهداء الهدايا المعينة: إهداء هدية الضائن الواحد، الحصول على 2 نجوم</br>
            شراء VIP عبر إعلان النشاط: شراء VIP لشهر واحد بدفع 388 عملة ذهبية فقط، ثم الحصول على 194 نجمة. لا يمكن أن تحصل على هذه الجائزة إلا عندما تشتري VIP في هذا الإعلان</br>
            الاستلام المجاني: يمكن المشتركين أن يستلموا نجمة مجانية واحدة  في هذا الإعلان كل مرة، وبعد استلام نجمة واحدة بنجاح، يمكن أن يستلموا بعد 10 دقائق
        </p>
        <h5>الوصف الآخر</h5>
        <p>"خلال فترة النشاط، إذا يوجد المستخدم الذي يشترك في النشاط بأساليب غير لائقة، فلشركتنا حق أن تلغي مؤهله للاشتراك في النشاط، وإذا تكون الحالة خطيرة، فسوف نقوم بحظر حسابه إلى الأبد. وتشمل الأساليب غير اللائقة:"</p>
        <p>1. اشتراك في هذا النشاط بأكثر من حسابَيْن</br>2. تقوم بأي تصرفات غير لائقة لزيادة النجوم</br>3. تقتسم لحم الخروف بطرق الغش</p>
        <p class="lastMsg">التفسير النهائي لهذا النشاط ينتمي إلى المنظم</p>
    </div>
</template>

<script>
export default {

}
</script>

<style lang="scss" scoped>
    h5{
        margin-top: .63rem;
        color:#00FFD2;
        font-weight: bold;
    }
    .time{
        margin-top: .19rem;
        font-size: 80%;
        color:#B9FFE7;
    }
    p{
        margin-top: .19rem;
        color:#B9FFE7;
    }
    .lastMsg{
        margin-top: 1.53rem;
        color:#2FD39B;
        text-align: center;
    }
</style>
