<template>
    <div class="rules">
        <h5 class="timerTile">وقت النشاط</h5>
        <p class="time">12:00 في يوم 8 من أغسطس - 12:00 في يوم 18 من أغسطس(توقيت دبي)</p>
        <h5>الجوائز</h5>
        <h6>الجوائز لاقتسام لحم الخروف</h6>
        <p>أثناء النشاط ، يتم تجميع النجوم التي تحصل عليها في لوحة لحم الخروف، كلما تتراكم 1000 نجمة، يمكنك أن تشترك في اقتسام لحم الخروف. 1000 عملة ذهبية لكل مرة. يمكن للجميع الاشتراك!</p>
        <h6>الجوائز لقائمة ترتيب النجوم</h6>
        <p class="top1">المركز الأول</p>
        <p>
            1. شارة نجمة الأعياد(لثلاثين يوما)</br>
            2. هدية الخروف الكاملة المشوية*30 (لثلاثين يوما)</br>
            3. هدية شريحة لحم الخروف المشوية*30 (لثلاثين يوما)</br>
            4. 2000 عملة ذهبية</br>
            5. 2000 فول ذهبي
        </p>
        <p class="top1">المركز الثاني</p>
        <p>
            1. شارة نجمة الأعياد(لخمسة عشر يوما)</br>
            2. هدية الخروف الكاملة المشوية*20 (لثلاثين يوما)</br>
            3. هدية شريحة لحم الخروف المشوية*20 (لثلاثين يوما)</br>
            4. 1500 عملة ذهبية</br>
            5. 1500 فول ذهبي
        </p>
        <p class="top1">المركز الثالث</p>
        <p>
            1. شارة نجمة الأعياد(لسبعة أيام)</br>
            2. هدية الخروف الكاملة المشوية*10 (لثلاثين يوما)</br>
           3. هدية شريحة لحم الخروف المشوية*20 (لثلاثين يوما)</br>
            4. 1000 عملة ذهبية</br>
            5. 1000 فول ذهبي
        </p>
        <p class="top1">المراكز 4-10</p>
        <p>
            1. شارة نجمة الأعياد(لثلاثة أيام)</br>
            3. هدية شريحة لحم الخروف المشوية*10 (لثلاثين يوما)</br>
            3. 500 عملة ذهبية</br>
            4. 500 فول ذهبي
        </p>
        <p class="top1">المراكز 11-30</p>
        <p>
            3. هدية شريحة لحم الخروف المشوية*10 (لثلاثين يوما)</br>
            2. 50عملة ذهبية</br>
            3. 50 فول ذهبي
        </p>
        <h5>وصف للجوائز</h5>
        <p>1. ستُعَطى هدية الخروف الكاملة المشوية وشريحة لحم الخروف المشوية في حقيبة الفائزين. يمكن للمستخدمين بنظام أندرويد أن يستخدموا هذه الهدايا بعد تحميل أحدث طبعة لSuper Voice</p>
        <p>2. ستُحَوَّل هذه الهدايا للمستخدمين بنظام أيفون إلى العملات الذهبية. يعني تحول كل هدية الخروف الكاملة المشوية من 50 عملة ذهبية، وكل هدية شريحة لحم الخروف المشوية من 10 عملة ذهبية</p>
        <p>3. سوف تُعطَى هذه الهدايا أثناء خمسة الأيام بعد انتهاء النشاط</p>
        <div class="lastMsg">
            التفسير النهائي لهذا النشاط ينتمي إلى المنظم
        </div>
    </div>
</template>

<script>
export default {

}
</script>

<style lang="scss" scoped>
    .timerTile{
        margin-top: .63rem;
    }
    h5{
        margin-top: .23rem;
        color:#00FFD2;
        font-weight: bold;
    }
    .time{
        margin-top: .19rem;
        font-size: 80%;
        color:#B9FFE7;
    }
    h6{
        color:#31FFAA;
        font-size: 80%;
        margin-top: .3rem;
    }
    p{
        margin-top: .19rem;
        color:#B9FFE7;
    }
    .top1{
        color:#fff;
    }
    .lastMsg{
        margin-top: 1.53rem;
        color:#2FD39B;
        text-align: center;
    }
</style>
