export default {
    //html/index.html
    title: "لکی ٹرن ٹیبل",
    loading: "لوڈ...",
    no_data: " عارضی میں ڈیٹا نہیں",
    end_data: "ڈیٹا لوڈ ہو گیا ہے",
    draw1:'ایک بار ڈرا',
    draw10: 'دس بار ڈرا',
    
    record_title: ' 7دن کا گیم ریکارڈ',
    rank_title: 'آج کی لک رینکنگ',
    
    balance_tips: 'ناکافی سکے بیلنس۔<br />خریداری مکمل نہیں کر سکا',
    go_value: 'ریچارج  جائیں',
    
    awards_title: 'ملنے پر مبارکباد۔',
    ok:'تصدیق',
    
    rule_title:'کھیل کے قواعد',
    rule: [
        'لکی ڈرا میں داخل ہونے کے لئے خاص رقم خرچ کریں اور آپ کا انعام فوری طور پر آپ کے اکاؤنٹ میں جمع ہوجائے گا!',
        'کاسٹیوم وسائل 30 دن طویل ہیں، اور اگر آپ کو یہ وسائل بحت سے بار مل جائے توسارے وسائل جمع ہو جائیں گے!',
        'توائف وسائل 15 دن کے جائز ہیں، بھر وہ آپ کے بیک پیک سے ہٹا دیا جائے گا!',
        'اس گیم کا ایپل کمپنی سے کوئی تعلق نہیں ہے ، اور تشریح کے تمام حقوق ہمارے پاس محفوظ ہیں!',
    ],

    //html/app_share.ejs
    share_title: 'خوش قسمت ٹرن ٹیبل',
    share_desc: '',
}