<template>
  <div class="rules">
    <h5 class="timerTile">وقت النشاط</h5>
    <p class="time">12:00 في يوم 7 من نوفمبر - 23:00 في يوم 14 من نوفمبر(توقيت دبي)</p>
    <h5>قواعد القائمة</h5>
    <p>الترتيب حسب عدد النجوم</p>
    <h5>قواعد اكتساب النجوم</h5>
    <p>إهداء الهدايا المعينة: إهداء هدية السكر الواحدة، الحصول على 2 نجوم</p>
    <p>شراء VIP عبر إعلان النشاط: شراء VIP لشهر واحد بدفع 377 عملة ذهبية فقط، ثم الحصول على 189 نجمة. لا يمكن أن تحصل على هذه الجائزة إلا عندما تشتري VIP في هذا الإعلان</p>
    <p>الاستلام المجاني: يمكن المشتركين أن يستلموا نجمة مجانية واحدة في هذا الإعلان كل مرة، وبعد استلام نجمة واحدة بنجاح، يمكن أن يستلموا بعد 20 دقيقة</p>
    <h5>الوصف الآخر</h5>
    <p>"خلال فترة النشاط، إذا يوجد المستخدم الذي يشترك في النشاط بأساليب غير لائقة، فلشركتنا حق أن تلغي مؤهله للاشتراك في النشاط، وإذا تكون الحالة خطيرة، فسوف نقوم بحظر حسابه إلى الأبد. وتشمل الأساليب غير اللائقة:</p>
    <p>1. اشتراك في هذا النشاط بأكثر من حسابَيْن</p>
    <p>2. تقوم بأي تصرفات غير لائقة لزيادة النجوم</p>
    <p>3. تقتسم حلاوة المولد من العبد بطرق الغش</p>
    <div class="lastMsg">
      التفسير النهائي لهذا النشاط ينتمي إلى المنظم
    </div>
  </div>
</template>

<script>
export default {

}
</script>

<style lang="scss" scoped>
.timerTile {
  margin-top: 0.63rem;
}
h5 {
  margin-top: 0.23rem;
  color: #ffdc4f;
  font-weight: bold;
}
.time {
  margin-top: 0.19rem;
  font-size: 80%;
  color: #ffe9bd;
}
h6 {
  color: #ffdc4f;
  font-size: 80%;
  margin-top: 0.3rem;
}
p {
  margin-top: 0.19rem;
  color: #ffe9bd;
}
.top1 {
  color: #fff;
}
.lastMsg {
  margin-top: 1.53rem;
  color: #8b7cf1;
  text-align: center;
}
</style>
