export default {
    //html/index.html
    title: 'تحدي صندوق هدايا محظوظ    ',
    noAct: 'لم يبدأ النشاط    ',
    actEd: 'قد انتهى النشاط    ',
    singUp: 'التسجيل الآن    ',
    noRank: 'ليس في القائمة    ',
    lastTrank: 'ليس بعيدًا عن القائمة:     ',
    geted: 'تم الاستلام    ',
    get: 'استلام    ',
    getTips: '* احصل على 3 من صندوق هدايا محظوظ مختلف كل يوم(أعمال فقط) ، يمكنك الحصول على المكافأة المقابل و استلامها مرة واحدة فقط في نفس اليوم',
    giftTitle: 'الجوائز الممكنة:',
    giftTips1: 'كلما ارتفع مستوى صندوق هدايا محظوظ ، زادت سخاء الجائزة ؛ في المرة الخامسة التي تتلقى مكافأة من سوبر صندوق هدايا محظوظ ، يجب أن تفوز بالملصقة النادرة    ',
    // giftTips2: '第5次領取超級禮盒獎勵，必中福運徽章Ⅱ',
    giftTipsSuc: 'مبروك ، لقد حصلت على $ ، والتي تم توزيعها على حسابك ، يرجى التحقق منها بعناية!    ',
    ok: 'حسنا    ',
    boxArr: ['صندوق هدايا محظوظ    ', 'صندوق هدايا محظوظ مميز    ', 'سوبر صندوق هدايا محظوظ    '],
    giftList: [
        {
            imgIcon: require('../../img/gift/01.png'),
            name: 'المصلقة النادرة            '
        },
        {
            imgIcon: require('./img/02.png'),
            name: 'هدية عملات            '
        },
        {
            imgIcon: require('../../img/gift/03.png'),
            name: 'سيارة            '
        },
        {
            imgIcon: require('../../img/gift/04.png'),
            name: 'VIP            '
        }
    ],
    lickTime: 'وقت    ',
    luckType: 'نوع الصندوق',
    luckGift: 'المكافآت    ',
    luckNoData: 'لا يوجد سجل استلام المكافآت    ',
    boxName: {
        1: 'صندوق هدايا محظوظ        ',
        2: 'صندوق هدايا محظوظ مميز        ',
        3: 'سوبر صندوق هدايا محظوظ        '
    },
    gx: 'مبروك علي',
    roolMsg2: 'استلام',
    rankTitle: 'قائمة حظ سعيد    ',
    rankTitle2: 'قائمة داعمين    ',
    rankTips: 'الترتيب وفقًا لإجمالي قيمة سحر الهدايا لثلاث من صندوق هدايا محظوظ مختلفة خاصا في الأعمال    ',
    rankTips2: 'الترتيب وفقًا لعدد العملات الذهبية التي تم إنفاقها على  صندوق هدايا محظوظ الثلاثة المختلفة التي تم إرسالها خاصا في الأعمال    ',
    loading: 'جار التحميل    ...',
    noDataRank: 'لا يوجد المشاركين في القائمة    ',

    //page_agreement
    page_agreement: 'القواعد و الجوائز    ',
    time: `{1}/{2} {3}:{4}:{5}`
}