const lang = {
    title: " सप्राइज़ बॉक्स", //驚喜寶箱
    share_title: "उपहार भेजने से पहले यह ज़रूर देखिएगा", //參與驚喜寶箱每天抽神秘豪禮
    share_desc: "फ्री सप्राइज़ बॉक्स आपके इंतज़ार में हैं", //更有終極寶箱等你開啟
    coinsPrice: "कॉइन्स/पीस", //金幣/個
    and: "और", //和
    bean: "पॉइन्ट्स", //金豆
    coins: "कॉइन्स", //金幣
    company: "lakh", //100000

    rule: "नियम&इनाम", //規則&獎勵
    surpriseTime: "सप्राइज़ टाइम", // 驚喜時刻
    ok: "ठीक है", //我知道啦
    noStart: "इवेंट शुरु नहीं है", //活動未開始
    actEnd: "इवेंट खत्म हो गई", // 活動已結束
    bigBox: "सूपिअरीअ", //終極寶箱
    todayScore: "आज की स्कोर：",
    totalScore: "कुल स्कोर：",
    rudexScore: "सूपिअरीअ बॉक्स तक आने और इतनी स्कोर चाहिए：",
    dayRank: "दैनिक सूची",
    totalRank: "कुल सूचू",
    dayRankTips:
        "सप्राइज़ स्कोर=रूम/कार्य को भेजे हुए कॉइन उपहारों की कुल चार्म",
    dayDownTime: "आजकी दैनिक सूची बाकी समय",
    dayStartTime: "सूची शुरुआत काउनटडॉन",
    dayNoTime: "आज की दैनिक सूची बंद है",
    totalDownTime: "इवेंट की बाकी समय",
    totalStartTime: "इवेंट शुरुआत काउनटडॉन",
    day: "दिन",
    hours: "घंटे",
    min: "मिनट",
    second: "सेकंड",
    luckGrade: "लकी लेवल:",
    ticket: "% रिचार्ज बोनस कूपॉन",
    lv: "Lv.",
    oneDayOpen: "हर दिन एक बार खोल सकते हैं",
    open: "खोलें",
    opened: "खोली है",
    actOpen: "इवेंट में सिर्फ एक बार खोलें",
    totalOpenEd: "आपने सूपिअरीअ बॉक्स खोला है",
    couldOpenTotalBox: "आप सूपिअरीअ बॉक्स खोल सकते हैं",
    luck: "अभी लकी लेवल：Lv.",
    ok: "पुष्टि",
    bean: "पॉइन्ट्स",
    ticket: "% रिचार्ज बोनस कूपॉन",
    openDayBoxTips1:
        "हर दिन सिर्फ एक बार बॉक्स खोल सकते हैं,</br>ऊंची लकी लेवल के साथ बेहतर इनाम मिलेगा,</br>अभी खोलें？",
    openDayBoxTips2:
        "आपकी सप्राइज़ स्कोर 1000 तक नहीं पहुँची,</br>अभी नहीं खोल सकते~",
    openDayBoxTips3: "आज की बॉक्स आपने खोली है,</br>कृपया कल आइएगा~",
    openTotalBoxTips1:
        "आपकी कुल सप्राइज़ स्कोर 4 lakh तक नहीं पहुँची,</br>सूपिअरीअ बॉक्स अभी नहीं खोल सकते~",
    sucPup1Tips:
        "वाह~ऊपर के सप्राइज़ इनाम के लिए आपको बधाई हो,</br>वॉलेट व बैक में देखिए！",
    day: "दिन",
    singUp: "भाग लें",
    openBoxTime: "समय",
    gift: "उपहार",
    noData: "डेटा नहीं",
    noSingUpTips: "क्लीक और इवेंट में भाग लें",
    gx: "बधाई हो",
    get: "प्राप्त करें",
    rank_loading: "लोडिन...",
    rank_nodata: "अब कोई दोस्त सूची पर नहीं है</br>बस आपका इंतज़ार！",
    rank_noStar: "उम्मीद कीजिए！"
};
export default lang;
