<template>
  <div class="rule">
    <div class="tabs">
      <span :class="{act:type == 1}" @click="type =1">活動獎勵</span>
      <span :class="{act:type == 2}" @click="type =2">活動規則</span>
    </div>
    <h6>活動時間：</h6>
    <p>11月30日18:00:00-12月11日23:59:59</p>
    <div class="gift" v-if="type == 1">
      <h5>年度出道獎勵</h5>
      <h6>出道團體獎勵：</h6>
      <p>專屬活动页面專輯（包含11人每人一首精選作品）+專輯歌曲免費修音+海報定制+作品標籤</p>
      <h6>第一名：</h6>
      <p>年度出道認證（1年）+年度C位出道頭飾（1個月）+年度C位爭奪賽出道徽章（1個月）+年度人物推薦+慶功演唱會收入金幣30%現金分成+紅毯座駕（1個月）+會員VIP（1個月）+決賽榜金幣10%現金分成+繁星守護背包禮物（1888金幣）*5+限量超跑背包禮物（1888金幣）*5+10000金幣+10000金豆</p>
      <h6>第二名：</h6>
      <p>年度出道認證（6個月）+年度出道頭飾（1個月）+年度C位爭奪賽出道徽章（1個月）+紅毯座駕（1個月）+會員VIP（1個月）+決賽榜金幣8%現金分成+眷侶射手背包禮物（1288金幣）*5+私家遊艇背包禮物（1388金幣）*5+8000金幣+8000金豆</p>
      <h6>第三名：</h6>
      <p>年度出道認證（3個月）+年度出道頭飾（1個月）+年度C位爭奪賽出道徽章（1個月）+紅毯座駕（1個月）+會員VIP（1個月）+決賽榜金幣5%現金分成+鈔票槍背包禮物（888金幣）*5+夢幻公主車背包禮物（888金幣）*5+5000金幣+5000金豆</p>
      <h6>第四-六名：</h6>
      <p>年度出道頭飾（1個月）+年度C位爭奪賽出道徽章（1個月）+紅毯座駕（1個月）+會員VIP（1個月）+決賽榜金幣3%現金分成+音符炸彈背包禮物（399金幣）*5+粉鑽手錶背包禮物（399金幣）*5+3000金幣+3000金豆</p>
      <h6>第七-十一名：</h6>
      <p>年度出道頭飾（1個月）+年度C位爭奪賽出道徽章（1個月）+紅毯座駕（1個月）+會員VIP（1個月）+決賽榜金幣2%現金分成+快樂小火車背包禮物（299金幣）*5+慶祝蛋糕背包禮物（299金幣）*5+2000金幣+2000金豆</p>
      <h5>海選榜單前5名獎勵</h5>
      <h6>第一名：</h6>
      <p>赤道極光座駕（30天）+會員VIP（1個月）+幸運滿天星背包禮物（49金幣）*10+甜蜜馬卡龍背包禮物（49金幣）*10+1000金幣+1000金豆</p>
      <h6>第二-三名：</h6>
      <p>赤道極光座駕（30天）+會員VIP（1個月）+幸運滿天星背包禮物（49金幣）*8+甜蜜馬卡龍背包禮物（49金幣）*8+800金幣+800金豆</p>
      <h6>第四-五名：</h6>
      <p>赤道極光座駕（30天）+會員VIP（1個月）+幸運滿天星背包禮物（49金幣）*5+甜蜜馬卡龍背包禮物（49金幣）*5+500金幣+500金豆</p>
      <h5>1v1對戰榜單前5組晉級者獎勵</h5>
      <h6>第一名：</h6>
      <p>一飛沖天座駕（30天）+會員VIP（1個月）+歡樂水槍背包禮物（99金幣）*10+搖搖木馬背包禮物（99金幣）*10+1500金幣+1500金豆</p>
      <h6>第二-三名：</h6>
      <p>一飛沖天座駕（30天）+會員VIP（1個月）+歡樂水槍背包禮物（99金幣）*8+搖搖木馬背包禮物（99金幣）*8+1300金幣+1300金豆</p>
      <h6>第四-五名：</h6>
      <p>一飛沖天座駕（30天）+會員VIP（1個月）+歡樂水槍背包禮物（99金幣）*5+搖搖木馬背包禮物（99金幣）*5+1000金幣+1000金豆</p>
      <h5>團戰榜單前4名戰隊內第1名參賽者獎勵</h5>
      <h6>第一名：</h6>
      <p>戰神GTR座駕（30天）+會員VIP（1個月）+浪漫花車背包禮物（199金幣）*10+荷花綻放背包禮物（199金幣）*10+2000金幣+2000金豆</p>
      <h6>第二-三名：</h6>
      <p>戰神GTR座駕（30天）+會員VIP（1個月）+浪漫花車背包禮物（199金幣）*8+荷花綻放背包禮物（199金幣）*8+1800金幣+1800金豆</p>
      <h6>第四-五名：</h6>
      <p>戰神GTR座駕（30天）+會員VIP（1個月）+浪漫花車背包禮物（199金幣）*5+荷花綻放背包禮物（199金幣）*5+1500金幣+1500金豆</p>
    </div>
    <div class="rules" v-else>
      <h5>活動規則</h5>
      <p class="mag">本次活動僅對簽約用戶開啟，簽約用戶進入頁面即報名成功；</p>
      <p>海選賽段期間，非簽約用戶簽約后可參賽；海選結束后，新簽約用戶無法參賽。</p>
      <h6>活動特定禮物及規則：</h6>
      <p>1、本活動的作品特定禮物為送你出道（666金幣）、 Live之星（29金幣）、實力Vocal（88金幣）、C位預 定（1299金幣）</p>
      <p>2、比賽期間送出以上特定禮物可獲得10%的魅力值加成</p>
      <h6>海選活動及排名規則：</h6>
      <p>
        1、按照海選期間參賽者作品+K房+房間 （4%）金幣收 禮魅力值計算人氣值榜單排名； <br />
        2、若人氣值相同，則先到達該人氣值的排名在前面；<br />
        3、海選結束後，排名前400名的選手可晉級下一賽段；<br />
        4、本賽段榜單前5名可獲得本賽段特定獎勵；<br />
        5、本賽段時間為2020年11月30日18:00至2020年12月02 日23:59；
      </p>
      <h6>1v1對戰活動及排名規則：</h6>
      <p>
        1、系統隨機匹配選手，一對一進行PK；<br />
        2、2人本賽段人氣值總和較高的一組排在前面，若人氣 值相同，則先到達該人氣值的一組排名在前面；<br />
        3、以1v1對戰期間參賽者作品+K房+房間（4%）金幣收 禮魅力值計算人氣值，每組最終人氣值較高的一方可 以晉級下一輪比賽，本賽段晉級200人；<br />
        4、若出現參賽者退賽情況，則其對手自動勝出，晉級下 一輪比賽；<br />
        5、若出現PK雙方平分情況，視為雙方均淘汰，均無法晉 級下一輪比賽；<br />
        6.、本賽段榜單前5組中晉級的參賽者可獲得本賽段特定 獎勵；<br />
        7、本賽段時間為2020年12月03日00:05至2020年12月 05日23:59。
      </p>
      <h6>團戰活動及排名規則：</h6>
      <p>
        1、依據上一輪比賽晉級的200名選手的人氣值排名，按 比例隨機分配到4個戰隊；<br />
        2、戰隊排名：依據戰隊所有成員本賽段的人氣值總和排 名，戰隊總人氣值高的戰隊排在前面；<br />
        3、個人排名：每個戰隊內成員依據個人作品+K房+房間 （4%）金幣收禮魅力值計算人氣值排名，排名靠前的 可晉級，若人氣值相同，則先到達該人氣值的排名在 前面； <br />
        4、本輪排名第1的戰隊可晉級9人，第2的戰隊晉級8人， 第3的戰隊晉級7人，第4的戰隊晉級6人，共晉級30 人；<br />
        5、本賽段4個戰隊內的 第1名可獲得本賽段特定獎勵； <br />
        6、本賽段時間為2020年12月06日00:05至2020年12月 08日23:59。
      </p>
      <h6>出道決戰活動及排名規則：</h6>
      <p>
        1、本賽段30名選手將在12月11日晚19:00在指定官方K房 直播比賽；<br />
        2、根據參賽選手作品+K房（包括決賽K房）的金幣收禮 魅力值計算出道值，本賽段榜單排名，越靠前的擁有 優先選擇麥序的權利，以選手本賽段12月10日0:00前 的出道值排名為準，K房直播開始前將由官方人員聯 繫選手確定比賽具體流程等事宜；<br />
        3、決賽K房內12月11日19：00至23:59期間上麥收禮可獲 得10%的魅力值加成；<br />
        4、總成績以選手本賽段出道值（包括決賽K房）計算， 排名前11位的選手獲得出道機會和相應的獎勵；<br />
        5、本賽段時間為2020年12月09日00:05至2020年12月11 日23:59。
      </p>
      <h6>ps:</h6>
      <p>
        作品=參賽選手在活動當前賽段期間所有公開作品的金幣收禮魅力值<br />
        K房=參賽選手在活動當前賽段期間在任意K房上麥獲得的金幣收禮魅力值<br />
        房間（4%）=活動當前賽段期間參賽選手所擁有房間內（即參賽者為房主的房間）的所有人上麥獲得的金幣收禮魅力值*4% <br />
        普通K房=參賽選手在出道決戰賽段期間在除決賽K房的任意K房上麥獲得的金幣收禮魅力值 決賽K房=參賽選手11月13日19：00至23:59在官方直播K房上麥獲得的金幣收禮魅力值（包括10%加成） <br />
        人氣值=作品+K房+房間（4%）的金幣收禮魅力值 出道值=作品+K房（包括決賽K房）的金幣收禮魅力值
      </p>
      <p class="red">每個賽段結束後，榜單數據清零</p>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      type: 1
    }
  },
  created() {
    document.title = '規則&獎勵'
  }
}
</script>

<style lang="scss">
body {
  background-color: rgba(10, 6, 5, 1);
}
.rule {
  padding: 0.5rem 0.3rem;
  .tabs {
    width: 6.89rem;
    height: 1.16rem;
    background: url(../../assets/img/ruleTabs.png);
    background-size: 100% 100%;
    display: flex;
    align-items: center;
    justify-content: center;
    padding: 0 0.1rem;
    span {
      width: 3.47rem;
      height: 0.82rem;
      text-align: center;
      line-height: 0.82rem;
      font-size: 0.32rem;
      color: rgba(255, 191, 73, 1);
      margin-top: -0.02rem;
      &.act {
        color: rgba(185, 71, 33, 1);
        background: url(../../assets/img/ruleTabs_act.png);
        background-size: 100% 100%;
      }
    }
  }
  h5 {
    color: rgba(255, 229, 125, 1);
    font-size: 0.32rem;
    font-weight: 600;
    text-align: center;
    margin-top: 0.6rem;
  }
  h6 {
    font-size: 0.28rem;
    color: rgba(255, 204, 114, 1);
    margin: 0.39rem 0 0.19rem;
  }
  .mag {
    margin-top: 0.39rem;
  }
  p {
    font-size: 0.28rem;
    color: rgba(255, 255, 255, 0.6);
  }
}
@import "../../assets/scss/common.scss";
</style>
