const lang = {
    rule: 'القواعد',  //活動規則
    detail: 'تفاصيل الاستلام',//領取詳情
    Invitation: 'ملأ كلمة الدعوة',//填邀請碼
    noStart: 'لم يبدأ النشاط', //活動未開始
    actEnd: 'انتهى النشاط', // 活動已結束
    ok: 'تحديد    ',
    nowVip: 'مستوى VIP الحاليVIP:',  //当前会员等级
    ci: 'المرة الباقية:',//剩余抽奖次数
    goVip: 'زيادة المرة', //增加次数
    thankGift: 'قد نفدت كل المرات، شراء VIP الآن لزيادة المرة',   //感谢你为好友助力，你获得礼包
    buyTime: 'شراء VIP    ',  //购买时长
    buyNum: 'المرة المحصولة    ',  //购买次数
    // timeTips: '個月',//月
    // year: '年', // 年
    buy: 'شراء    ', //购买
    showCodeTitle: 'أكمل مهمة المفاجأة لكسب مكافأة المفاجأة    ',//完成神秘任务，领取神秘奖励
    codeTips1: 'تدعو صديقك لتحميل Super Voice، بعد أن يتم التسجيل و تسجيل الدخول،ثم يفتح صفحة النشاط، يدخل كلمة الدعوة في يسار الصفحة، بعد أحد من أصدقائك أكملها يمكن لك الحصول على مكافاة ',
    inivCode: 'كلمة الدعوة:',//我的邀请码
    goIniv: 'مشاركة',//去邀请
    inivTips1: 'يمكن لك الحصول على 150 عملة بعد الدعوة بناجح    ', //送20 金币
    inivTips2: 'ملاحظة:لا يمكن للصديق المدعو أن يستخدم نفس الجهاز أو يدخل بالحساب من IP واحد',
    luckEd: 'حصل على', //刮到
    share1: 'تحميل مجانا    ', //免费下载
    share2: 'أشارك في النشاط: امتيازات VIP لSuper Voice، حمّل APP الآن، أكمل التسجيل و تسجيل الدخول، ثم أدخل كلمة الدعوة في صفحة النشاط لمساعدتي!    ', //我正在参加活动
    shareCode: 'كلمة الدعوة:', //邀请码
    shareCode2: 'انقر طويلا لنسخ', //长按复制
    share3: 'إشارات الاشتغال    ',
    share4: 'يساعد    ', // 去助力
    detailTitle: 'تفاصيل الاستلام    ',//领取详情
    detailTime: 'الوقت    ', //领取时间
    detailGifts: 'الجائزة    ', // 奖品
    detailState: 'الحال    ',//奖品状态
    noData: 'لا توجد معطيات    ',//暂无数据
    giftEnd: 'قد استلمت    ', //已领取
    taskTitle: 'مهمة المفاجأة',//神秘任务
    taskCode: 'كلمة الدعوة', // 邀请码
    coinsTwo: 'استلم 150 عملة', //领取20金
    goShare: 'يدعو    ', //去邀请
    sucCode: 'قد ملأت كلمة الدعوة بنجاح!    ',//成功填写邀请码
    main1: 'ستحصل على هدية المساعدة بعد ملأ كلمة الدعوة من صديقك    ',//填写好友邀请码
    main2: 'كلمة الدعوة    ',//邀请码
    main3: 'لصق    ',//长按粘贴
    main4: 'تقديم    ', //提交
    main5: 'مبروك لحصول على هذه الهدايا    ', //获得的礼物
    main6: 'تحديد    ',//确定
    zsGift: 'مبروك لحصول على هدية خاصة VIP    ',//恭喜你获得VIP专属礼物
    otherGift: 'مبروك    ', // 恭喜获得X
    shareTips: 'اضغط لفترة طويلة لنسخ هذا الرابط ثم لصقه و ترسله إلى أصدقائك في التطبيقات الأخرى لمساعدتك    ', // 
    zsOk: 'تحديد    ',//好
}
export default lang