export default {
    //html/index.html
    title: "شهادة البث", //直播認證
    page_skill_title: "تقنية الغطاء", //封面技巧
    page_notQualified_title: "وصف الإذن", //權限說明
    page_LiveCover_title: "غطاء البث", // 直播封面
    page_standard_title:
        "منصة بروتوكول البث المباشر ومدونة قواعد السلوك", //平台直播協議與行為規範
    // router/index
    page_cardTips: "الرجاء تحميل صورة مصدقة", //請上傳認證照片
    page_cardTips2: "بعد نجاح التحميل ، سنعجل المراجعة", //上傳成功後，我們會加快審核
    page_examples: "مثال", //示例
    page_examples_tip1: "امسك مقدمة بطاقة الهوية <br /> التقط صورًا وفقًا لمثال الصورة", //手持身份證正面<br />按照示例圖拍照
    page_examples_tip2:
        "لضمان صحة هويتك ، تحتاج إلى التحقق من الهوية ، وإذا وجدت هوية مزورة ، فسيتم حظرك بشكل دائم.", //為了保證身份的真實性，需要你進行身份驗證，如發現證件假造將永久封號。
    page_next: "الخطوة التالية", //下一步
    page_upCover: "انقر لتحميل صورة الغلاف", //點擊上傳封面圖
    page_upCover_tip1:
        "صورة الغلاف للمراجعة اليدوية. يرجى تحميل صورة ذات وجه واضح. الرجاء عدم تحميل الصور المكشوفة / المبتذلة / التي تحتوي على حدود وعلامات مائية للكاميرا. حاول تحميل صور شخصية حقيقية وطبيعية لتسهيل مراجعتها. اضغط للعرض", // 封面圖爲人工審核，請上傳本人面部清晰的照片請勿上傳暴露/低俗/包含邊框、相機水印的圖片儘量上傳真實，自然的自拍圖，更容易審核通過。 點擊查看
    page_upCover_tip2: "《نصائح حول الغلاف المباشر》", //《歡歌直播封面技巧》
    page_upCover_tip3: "انقر فوق إرسال ، أنت توافق", //點擊提交，即表示同意
    page_upCover_tip4: "《بروتوكول البث المباشر ومدونة قواعد السلوك》", //《歡歌直播協議與行為規範》
    page_upCover_commit: "تقديم", //提交
    page_upCover_tip6: "أعد التقديم", //重新申請
    processTitle: ["صور الهوية", "صورة الغلاف الحية", "إرسال المراجعة"], //['證件照', '直播封面圖', '提交審核'],
    commitMsg: {
        0: "تم رفض طلبك <br/> السبب: B",
        1: "تم إرسال الطلب بنجاح <br/> يرجى التحلي بالصبر ، وسنراجعه لك في أقرب وقت ممكن",
        2: "تم تقديم التحقق من الهوية <br/> لا داعي لإعادة التقديم ، الرجاء الانتقال مباشرة إلى الخطوة التالية",
    },
    // commitMsg: {
    //   0: '你的申請被拒絕 <br/>原因：B',
    //   1: '已成功提交申請<br/>請耐心等待，我們會盡快為你審核',
    //   2: '身份驗證已提交<br/> 無需重複提交，請直接進入下一步'
    // },
    page_commit_tip1: "الرجاء تحميل صورة مصدقة", //請上傳認證照片！
    page_commit_tip2: "يرجى تحميل الغلاف الحي", //請上傳直播封面！

    //cover
    cover_now: "الغطاء الحالي", //當前封面
    cover_examine: "تحت المراجعة", //審核中
    cover_change: "تغيير", //更改
    cover_coverImg: "صورة الغلاف الحية", //直播封面圖
    cover_tips1:
        "صورة الغلاف للمراجعة اليدوية. يرجى تحميل صورة ذات وجه واضح. الرجاء عدم تحميل الصور المكشوفة / المبتذلة / التي تحتوي على حدود وعلامات مائية للكاميرا. حاول تحميل صور شخصية حقيقية وطبيعية لتسهيل مراجعتها.", //封面圖爲人工審核，請上傳本人面部清晰的照片請勿上傳暴露/低俗/包含邊框、相機水印的圖片儘量上傳真實，自然的自拍圖，更容易審核通過。
    cover_upImg: "تحميل الغلاف", //上傳封面
    cover_tips2:
        "صورة الغلاف التي تم إرسالها آخر مرة لم تستوفِ المتطلبات وفشلت في اجتياز المراجعة. يُرجى إعادة التحميل", //上次提交的封面圖不符合要求，未能審核通過，請重新上傳
    cover_tips3: "يتم تحميل الغلاف وسيصبح ساري المفعول بعد الموافقة", //封面上傳中，審核通過後生效
    cover_upSuc: "تم تحميلها بنجاح", //上傳成功
    cover_tips4: "الرجاء تحديد الغلاف الذي يحتاج إلى التغيير", //請選擇需要更改的封面！

    //NotQualified
    notQualified_tip1: "أنت غير مؤهل بعد لتقديم طلب للحصول على مذيع", // 您還未獲得申請主播的資格
    notQualified_tip2: "كيفية الحصول على المؤهل لتطبيق مرساة:", //如何獲得主播申請資格：
    notQualified_tip3:
        "1.للحصول على استشارة حول تأهيل التطبيق الأساسي ، يرجى الاتصال برقم ID66 للحساب الرسمي. وسيعتمد الحساب الرسمي على الصورة الشخصية للمستخدم ، وأداء الغناء ، والسلوك النشط ، والجوانب الأخرى في المنصة. ومن الأسهل الحصول على تأهيل التطبيق الأساسي عن طريق نشر المزيد من الأعمال والمشاركة في الأنشطة الرسمية.", //主播申請資格咨詢可聯繫官方號ID1000，官方會根據用戶在平台內的個人形象，唱功表現，活躍行為等多方面進行綜合考慮，多發作品，多參與官方活動更容易獲得主播申請資格喔。
    notQualified_tip4:
        "2.يجب على المستخدمين الذين حصلوا على التأهيل لتطبيق المرساة أيضًا ربط أرقام هواتفهم المحمولة وإرسال مصادقة الهوية. فقط بعد اجتياز المراجعة يمكن بدء البث.", //獲得主播申請資格的用戶，還需綁定手機號碼，並提交身份認證，審核通過後才可開播。
    notQualified_tip5:
        "3.يجب أن يلتزم البث بمدونة قواعد سلوك مقدم المنصة ، وستتم معاقبة المخالفين وفقًا لسياسة البث الخاصة بالمقدم.", //開播需遵守平台主播行為規範，違者將按主播開播政策處罰。

    //skill
    group1: {
        1: {
            title: "ملامح وجه واضحة ، صور جميلة", //五官清晰，圖片唯美
            img: [1, 2, 3],
        },
        2: {
            title: "تسليط الضوء على الخصائص الشخصية", //突出個人特點
            img: [4, 5, 6],
        },
        3: {
            title: "دليل واضح للمحتوى", //明確的內容引導
            img: [7, 8, 9],
        },
    },
    group2: {
        1: {
            title: "الصورة ضبابية ولا يمكن رؤية ملامح الوجه بوضوح", //畫面模糊，看不清五官
            img: [10, 11, 12],
        },
        2: {
            title: "قطع عمودي وليس في المنتصف", //人像被切割未居中
            img: [13, 14, 15],
        },
    },
    group3: {
        title: [
            "التصميم نظيف وواضح ، احتفظ به محجوزًا", //版面乾淨清晰，保持矜持
            "الصورة الجميلة للجزء العلوي من الجسم هي الأفضل ، حيث تُظهر ملامح الوجه الرائعة", //美美的上半身照最佳，秀出精緻五官
            "ممنوع العُري ، الحدود السوداء والحدود البيضاء ، النص العادي ، الشعارات الأخرى ، غير الأشخاص", //拒絕裸露，、黑邊白邊、純文字、其他logo、非本人
        ],
        img: [16, 17, 18, 19, 20, 21],
    },
    group4: [
        {
            img: 22,
            name: "أنا آكل وأبث", //我在吃播
        },
        {
            img: 23,
            name: "لدي مهارات الطبخ", //我有廚藝
        },
        {
            img: 24,
            name: "أنا كوسبلاي", //我在Cosplay
        },
        {
            img: 25,
            name: "أنا أدردش مع الفتيات", //我在撩妹
        },
        {
            img: 26,
            name: "أنا أمارس الرياضة", //我在健身
        },
        {
            img: 27,
            name: "انا ارقص", //我在跳舞
        },
    ],
};
