export default {
    //html/index.html
    title: 'توقيع',

    // router/index
    page_data: 'البيانات تلبي المعيار',
    page_bind: 'ربط رقم الهاتف المحمول',
    page_apply: 'طلب للتوقيع',
    page_agreement: 'اتفاقية استخدام المنصة',

    // Index
    sign: 'اذهب الترقيع',
    signed: 'تم التوقيع',
    sign_rule: 'تعليمات التوقيع：',
    sign_rule_1: '1. لا يُسمح للمستخدمين غير الموقّعين بسحب دخل الماس ، ولكن لا يمكن استبدالهم إلا بعملات ذهبية ، وما لا يقل عن 20.000 ماسة في كل مرة ، ولا يُسمح بتبادل أقل من 20.000 ماسة ؛',
    sign_rule_2: '2、بعد التوقيع على العقد ، يمكنك سحب دخل الماس ، وكلما ارتفع مستوى العقد ، ارتفعت نسبة السحب ؛ كلما ارتفع سعر صرف العملات الذهبية ، وأقل سعر صرف لـ 100 ماسة في كل مرة.',

    // Task
    data_name: 'تصل البيانات إلى المعيار وتصبح مستخدمًا متوقعا',
    data_desc: 'فقط بعد أن تصل متطلبات البيانات إلى المعيار ، يمكنك التقدم للحصول على عقد',
    bind_name: 'ربط رقم الهاتف المحمول',
    bind_desc: 'الرجاء ربط رقم هاتفك أولا',
    sign_name: 'توقيع على فور',
    sign_desc: 'تمتع بالامتيازات والمزايا الحصرية للمستخدمين المتعاقد معهم',
    do: 'لانهاء',
    done: 'تم الاكتمال',
    sign_tips: 'إذا لم يتم إكمال الخطوتين الأوليين \ n لا يمكن تطلبالتوقيع',
    ok: 'تحديد',

    // Bind
    bind_succ: 'تم ربط حسابك بنجاح \ n رقم الهاتف المحمول:٪ s',

    // Data
    count_title: 'تصل المسافة إلى معيار مستخدم العقد',
    count_income: 'دخل الماس',
    count_numbers: '（{0}/{1}）',
    count_time: 'هذه الدورة الإحصائية مدتها {0} شهر {1} يوم - {2} شهر {3} \ n هناك {4} يوم للانتهاء وإدخال الدورة الإحصائية التالية ، يرجى الحضور',
    done_tips: 'لقد استوفيت متطلبات مستخدم العقد \ n تقدم لتصبح مستخدمًا متعاقدًا الآن',
    undone_tips: 'لم تحقق متطلبات المستخدم المتعاقد حتى الآن \ n لا يمكن التقدم بطلب لتصبح مستخدمًا متعاقدًا',
    done_give: 'يمكنك الحصول عليها بعد التوقيع الناجح：',
    done_give_1: '1. يمكن سحب دخل الماس ، وكلما ارتفع مستوى العقد ، ارتفعت نسبة السحب ؛',
    done_give_2: '2. يمكنك الحصول على سعر صرف أعلى للعملات الذهبية ، ويمكنك استبدال ما لا يقل عن 100 ماسة في كل مرة.',

    // Apply
    apply_title: 'اخر خطوة：',
    apply_desc: 'لتوقيع عقد ، تحتاج إلى تقديم بطاقة هويتك للمراجعة ، وبعد المراجعة ، ينجح الطلب.',
    card_title: 'امسك مقدمة بطاقة الهوية والتقط الصور وفقًا للصورة النموذجية',
    card_desc: 'للتأكد من صحة هويتك ، تحتاج إلى التحقق من هويتك. \ n الرجاء إرسال صورة وفقًا لنموذج الصورة. إذا وجدت معرفًا مزيفًا ، فسيتم حظرك بشكل دائم.',
    re_upload: 'إعادة التحميل',
    upload_title: 'الرجاء تحميل صورة مصدقة',
    upload_desc: 'بعد نجاح التحميل ، سنقوم بتسريع المراجعة',
    agree_agreement: 'التقدم بطلب للحصول على عقد ، مما يعني الموافقة',
    apply_agreement: '《اتفاقية استخدام المنصة》',
    submit_apply: 'إرسال والتقدم للتوقيع',
    card_submited: 'تم إرسال التحقق من الهوية \ n لا داعي لإعادة التقديم \ n يمكنك التقدم مباشرة للتوقيع',

    // Result
    re_submit: 'أعد التقديم',
    result_checking: 'تم إرسال الطلب بنجاح \ n سنراجع لك في أقرب وقت ممكن',
    result_success: 'تهانينا ، لقد أصبحت مستخدمًا موقعًا للمنصة',
    result_fail: 'تم رفض طلبك',
    result_fail_reason: 'السبب：%s',
    result_fail_contact: 'يرجى الاتصال بالعملية الرسمية للحصول على التفاصيلID%s',
    result_reject: 'إذا فشل طلبك ، فسنبدأ عملية التوقيع المطبقة على المرساة في أقرب وقت ممكن ، لذا ابق على اتصال.',
    sign_give: 'يمكنك الحصول عليها بعد التوقيع الناجح：',
    sign_give_1: '1、الأعمال المنشورة أو غرفة الغناء الخاصة بها نسبة توصية أعلى والحصول على المزيد من التوصيات；',
    sign_give_2: '2、المزيد من التعرض والمزيد من اهتمام المعجبين；',
    sign_give_3: '3、يمكن سحب دخل الماس ، وكلما ارتفع مستوى العقد ، ارتفعت نسبة السحب；',
    sign_give_4: '4、يمكنك الحصول على سعر صرف أعلى للعملات الذهبية ، ويمكنك استبدال ما لا يقل عن 100 ماسة في كل مرة。',
}