const vietnamLang = {
    integral: "今日積分值：",
    todayp: '今日積分值達到X可領取',
    todayGift: [
        {
            num: "70",
            msg: '連續多天達到獎勵金豆數更多，<br>獎勵金豆數=100 + 10 * 連續達到天數。</br>第1天達到，獎勵110金豆；</br>第2天達到，獎勵120金豆；</br>...</br>第12天達到，獎勵220金豆'
        },
        {
            num: "90",
            msg: '獎勵有可能為：<br>聖誕雪花背包禮物(2金幣)*1；</br>VIP(3天)</br>浪漫飛艇座駕(3天)</br>赤鷹戰機座駕(3天)</br>老爺車座駕(3天)'
        },
        {
            num: "130",
            msg: '獎勵說明：</br>獎勵全新打造聖誕套裝背包禮物的其中一個(每個價值10金幣)，聖誕套裝背包禮物共12個，活動期間每天發放的禮物不重複，不要錯過咯~'
        },
        {
            num: "150",
            msg: '獎勵說明：</br>獎勵當天本人獲得的前3檔禮物的隨機1個*2</br>如當天獲得的前3檔禮物分別是150金豆,VIP(3天),聖誕襪背包禮物(10金幣)*1,則有可能獲得300金豆,VIP(6天),或者聖誕襪背包禮物(10金幣)*2'
        },
    ]
}
export default vietnamLang