export default {
    //html/index.html
    title: "\u200E",
    //history
    noData: "暫無數據",
    strTips: {
        // 0  -收礼  1  -语聊-匹配   2-提现现金 3-兑换金币 4-语聊-拨打 5-内部赠送 6-搭讪 7-聊天 8-每日任务 9-活动 （预埋给活动用） 10-商城兑换
        0: '收到<em class="uid">@</em>贈送的禮物$',
        1: '與<em class="uid">@</em>語音配對%分鐘',
        2: "提現結算",
        3: "兌換&金幣",
        4: '與<em class="uid">@</em>通話%分鐘',
        5: "系統發放",
        6: '回復<em class="uid">@</em>的搭訕',
        7: '回復<em class="uid">@</em>的私聊',
        8: "完成$任務",
        9: "活動發放",
        10: "兌換$",
        11: "新人獎勵",
        12: "收到邱比特愛神禮物 $",
        13: '與<em class="uid">@</em>視頻通話%分鐘'
    },
    history_title1: "粉鑽明細",
    history_title2: "藍鑽明細",

    //index
    day: "天",
    tab1: "社交收益",
    tab2: "派對收益",
    user_score1: "粉鑽餘額",
    user_score2: "藍鑽餘額",
    day_get: "本日收益",
    totle_get: "累計收益",
    lookIng: "預覽",
    query_title: "是否確認兌換",
    ok: "確認",
    cancel: "取消",
    get_suc: "兌換成功！",
    get_cancel_tips1: "粉鑽不足，無法兌換",
    get_cancel_tips2: "藍鑽不足，無法兌換",

    //tips
    tips_title: "關於鑽石",
    h6_1: "如何獲得藍鑽？",
    h6_2: "如何獲得粉鑽？",
    h6_3: "如何使用粉鑽和藍鑽？",
    p_1: "在派對房間中收到金幣禮物時，會根據一定的比例轉化為你的藍鑽收益；",
    p_2: "A.付费聊天",
    p_3:
        "主動發送消息一方需要支付金幣或對應道具，12小時內回復消息可獲得粉鑽獎勵",
    p_4: "B.搭訕",
    p_5: "當回復對方發過來的搭訕時，12小時內回復可獲得該搭訕帶來的粉鑽獎勵",
    p_6: "C.語音、視頻呼叫",
    p_7: "當對方想你發起語音、視頻呼叫時，接聽這個呼叫每分鐘均可獲得粉鑽獎勵",
    p_8: "D.語音配對",
    p_9: "接受系統隨機安排的語音配對，每分鐘均可以獲得粉鑽獎勵",
    p_10: "E.私聊收禮",
    p_11: "當在私聊收到對方贈送的金幣禮物時，按照一定比例獲得粉鑽收益",
    p_12: "F.動態收禮",
    p_13: "當在動態中收到他人贈送的金幣禮物時，按照一定比例獲得粉鑽收益",
    p_14: "你可在收益查看模塊中使用粉鑽或藍鑽兌換你喜歡的道具或者其他東西。",
    p_15: " A.房間收禮"
};
