<template>
  <div class="tab">
    <div class="topTab">
      <span @click="changTab('wards')" :class="{active:isShowTab === 'wards'}">الجوائز</span>
      <span @click="changTab('rule')" :class="{active:isShowTab === 'rule'}">القواعد</span>
    </div>
    <div class="wards" v-show="isShowTab === 'wards'">
      <p class="actTime">12:00 في يوم 19 من سبتمبر-16:00 في يوم 29 من سبتمبر(توقيت دبي)</p>
      <h5>الجوائز:</h5>
      <h6>قائمة المصباح السحري: ترتيب حسب عدد المصباح السحري الذي يتلقاه المستخدم</h6>
      <p>المركز الأول:</p>
      <p>شارة نجم النذر(ثلاثون يوما)+30 هدية جان المصباح السحري(ثلاثون يوما)+500 عملة ذهبية+500فول ذهبي</p>
      <p>المركز الثاني:</p>
      <p>شارة نجم النذر(ثلاثون يوما)+20 هدية جان المصباح السحري(ثلاثون يوما)+300 عملة ذهبية+300فول ذهبي</p>
      <p>المركز الثالث:</p>
      <p>شارة نجم النذر(ثلاثون يوما)+10 هدية جان المصباح السحري(ثلاثون يوما)+200 عملة ذهبية+200فول ذهبي</p>
      <p>المراكز 4-10:</p>
      <p>10 هدية جان المصباح السحري(ثلاثون يوما)+50 عملة ذهبية+50 فول ذهبي</p>
      <h6>قائمة النذر: ترتيب حسب عدد المصباح السحري الذي يهديه المستخدم</h6>
      <p>
        المركز الأول: 30 هدية جان المصباح السحري(ثلاثون يوما)</br>
        المركز الثاني: 20 هدية جان المصباح السحري(ثلاثون يوما)</br>
        المركز الثالث: 10 هدية جان المصباح السحري(ثلاثون يوما)</br>
        المراكز 4-10: 5 هدية جان المصباح السحري(ثلاثون يوما)
      </p>
      <h5>الآخر:</h5>
      <p>
        1. ستُعَطى هدية جان المصباح السحري في حقيبة الفائزين. يمكن للمستخدمين بنظام أندرويد أن يستخدموا هذه الهدايا بعد تحميل أحدث طبعة لSuper Voice</br>
        2. ستُحَوَّل هذه الهدايا للمستخدمين بنظام أيفون إلى العملات الذهبية. يعني تحول كل هدية جان المصباح السحري من 50 عملة ذهبية.</br>
        3. سوف تُعطَى هذه الهدايا أثناء خمسة الأيام بعد انتهاء النشاط
      </p>
      <p class="lastMsg">التفسير النهائي لهذا النشاط ينتمي إلى المنظم</p>
    </div>
    <div class="rule" v-show="isShowTab === 'rule'">
      <p class="actTime">12:00 في يوم 19 من سبتمبر-16:00 في يوم 29 من سبتمبر(توقيت دبي)</p>
      <h5>الاشتراك في المسابقة:</h5>
      <p>1.انقر "التسجيل الآن"، ثم ترفع عملك المشترك في المسابقة، بعد ذلك، نعتبرك تشترك في هذه المسابقة. ويجب على عملك المشترك في المسابقة أن يكون عملا فرديا عاما منشورا في هذا التطبيق. ولا يحتسب أعمال الجوقة والأعمال الخاصة وsing a cappella في هذه المسابة.</p>
      <p>2.يجب على العمل المشترك في المسابقة أن يكون عملا منشورا أثناء المسابقة.</p>
      <h5>الجان:</h5>
      <h6>1.يمكن الحصول الجان بعد إكمال المهمات اليومية. إذا لا تستلم الجان بيديك بعد إكمال المهمات، وبعد يوم، سيختفي كل الجنان الذين لا تستلمهم. فلا تنس استلام الجان في وقته!</h6>
      <h6>2.يمكن الحصول على فول ذهبي أيضا بعد استلام الجان</h6>
      <p>إكمال مهمة واحدة، يمكن استلام جان واحد، واكتساب 10 فولات ذهبية أيضا</p>
      <p>إكمال مهمتين اثنتين، يمكن استلام جانين اثنين، واكتساب 20 فول ذهبي أيضا</p>
      <p>إكمال ثلاث مهمات، يمكن استلام ثلاثة جنان، واكتساب 30 فول ذهبي أيضا</p>
      <p>إكمال أربع مهمات، يمكن استلام أربعة جنان، واكتساب 40 فول ذهبي أيضا</p>
      <h5>المصباح السحري:</h5>
      <p>1.انقر "نذر" في قائمة المصباح السحري، ثم ستحصل على 1-4 مصابيح سحرية عشوائيا</p>
      <p>2.تحصل على المصباح بعد إهداء هدية المصباح السحري بدفع 100 فول ذهبي في صفحة الأعمال</p>
      <p>3.لا يُحصَى عدد هدية المصباح إلى قائمة النذر وقائمة المصباح إلا عندما تعطى هدايا المصباح هذه لأعمال مشتركة في المسابقة.</p>
      <h5>الآخر:</h5>
      <p>أثناء المسابقة ، إذا تبين أن المستخدم يستخدم وسائل غير مناسبة للمشاركة</br>
         في النشاط ، يحق للمسؤول إقصاؤه من المسابقة دون إشعار مسبق ، وفي </br>
        الحالات الشديدة ، سيتم حظر رقم حساب المشارك ، بما في ذلك على </br>
        سبيل المثال لا الحصر:
      </p>
      <p>1. تسرق حساب الآخرين أو تستعيره للإشتراك في المسابقة</p>
      <p>2. تفتح حسابات كثيرة للإشتراك في المسابقة</p>
      <p>3. تعلق على أعمال المستخدمين الآخرين بكلمات سيئة أو ترسل لهم
        إعلانات في فترة النشاط</p>
      <p>4.تغش في هذه المسابقة </p>
      <p>5. تشترك في النشاط بطريقة غير لائقة</p>
      <p class="lastMsg">التفسير النهائي لهذا النشاط ينتمي إلى المنظم</p>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      isShowTab: 'wards'
    }
  },
  methods: {
    changTab(tab) {
      this.isShowTab = tab
    }
  }
}
</script>

<style lang="scss">
body {
  background-color: #552996;
  direction: rtl;
}
.tab {
  padding: 0.35rem 0.3rem;
  position: relative;
  .topTab {
    width: 6.84rem;
    height: 0.9rem;
    padding: 0 0.06rem 0 0.03rem;
    background: url(../../assets/img/tabBg.png) no-repeat;
    background-size: 100% 100%;
    transition: all 0.3s;
    color: #d5bdff;
    span {
      display: inline-block;
      width: 49%;
      height: 0.76rem;
      text-align: center;
      line-height: 0.9rem;
      margin-top: 0.07rem;
      &.active {
        background: url(../../assets/img/tabItemBg.png);
        background-size: 100% 100%;
        color: #fff;
      }
    }
  }
  .clearfix:after {
    content: "";
    height: 0;
    line-height: 0;
    display: block;
    visibility: hidden;
    clear: both;
  }
}
.rule {
  padding: 0.33rem 0.33rem 0;
  .actTime {
    color: #ffc960;
    font-size: 80%;
  }
  h5 {
    color: #3effd4;
    font-weight: bold;
    font-size: 110%;
    margin-top: 0.34rem;
  }
  h6 {
    font-size: 90%;
    color: #fff6ce;
  }
  p {
    width: 100%;
    color: #e5d3ff;
    font-size: 80%;
    margin-top: 0.2rem;
  }
  .lastMsg {
    color: #b787ff;
    text-align: center;
    margin-top: 1.53rem;
  }
}
.wards {
  padding: 0.33rem 0.33rem 0;
  .actTime {
    color: #ffc960;
    font-size: 80%;
  }
  h5 {
    color: #3effd4;
    font-weight: bold;
    font-size: 110%;
    margin-top: 0.34rem;
  }
  h6 {
    font-size: 90%;
    color: #fff6ce;
  }
  p {
    width: 100%;
    color: #e5d3ff;
    font-size: 80%;
    margin-top: 0.2rem;
  }
  .lastMsg {
    color: #b787ff;
    text-align: center;
    margin-top: 1.53rem;
  }
}
@import "../../assets/scss/common.scss";
</style>
