<template>
  <div class="actRules">
    <div class="totalTips" v-if="is_admin">
      <h6>التفسير عن تقديم الطلب لإقامة الحفلة:</h6>
      <div class="tipsBox">
        <p>1. يمكن لصاحب الغرفة أو مدير الغرفة أن يقدم الطلب لإقامة الحفلة، انقر "تقديم الطلب لإقامة الحفلة" و املأ استمارة الطلب لإقامة الحفلة. يجب علىيك طلب النشاط قبل يوم واحد إلى 15 يوما بداية النشاط، يجب على وقت كل النشاط أكثر من ساعة و أقل من 5 ساعات.</p>
        <p>2. يرجي إنتظار نتيجة المراجعة بصبر بعد تقديم الطلب بنجاح، يمكن تحقق التفاصيل في صفحة "الحفلة لي".</p>
        <p>3. انقر "تعديل النشاط" في صفحة "الحفلة لي"، يمكن تعديل تفاصيل النشاط الذي يكون في انتظار المراجعة و فشل نتيجة المراجعة، النشاط الذي اجتازت المراجعة لا يمكن التعديل.</p>
        <p>4. اذا فشل نتيجة المراجعة للنشاط يمكن تقديم الطلب مرة ثانية بعد تعديل تفاصيل النشاط، لا يمكن التعديل مرة ثالثة بعد تقديم الطلب.</p>
        <p>5.وقت البداية و الانتهاء للنشاط الذي لازم تختاره في صفحة تقديم الطلب، يرجي اختيار الوقت بتوقيت دبي، لكن بعد ان اجتازت المراجعة للنشاط، وقت النشاط لكل نشاط سوف يظهر في قائمة الحفلات هو الوقت في منطقتك~ لا تنس النشاط~</p>
        <p>6. سيتم عرض النشاط المستمر في أعلى قائمة الحفلات ، وستتم إضافة ملصق النشاط تلقائيًا إلى تغطية الغرفة.</p>
        <p>7. بعد التقدم بطلب للحصول على نشاط في الغرفة ، لم يتم تنظيمه بشكل فعال(مثلا لا يقيم النشاط في موعده و إلى آخره ) واحتجازه حتى أربع مرات، لا يمكن تقدم الطلب لإقامة النشاط في هذه الغرفة مرة أخرى.</p>
        <p>8. يمكن لكل نشاط الحصول على نقاط الحفلة المقابلة ، النقاط محسوبة على النحو التالي:</p>
        <img src="../../assets/img/ruleImg1.png" alt="" class="ruleImg1">
        <p class="ps">ملاحظة: يتم تقييم نقاط تخطيط برنامج النشاط من خلال نشاط المراجعة الرسمي. وكلما كانت خطة النشاط أكثر اكتمالًا ، و كان النشاط أحدث و أروع، وكلما ارتفعت النقاط ، يمكنك الرجوع إلى تخطيط النشاط الرسمي.</p>
        <p>9. كل أسبوع / شهر ، يمكنك الحصول على المكافأة الرسمية إذا وصلت إلى النقاط المحددة (4000/1000) أو دخلت العشرة الأوائل من القائمة</p>
        <img src="../../assets/img/ruleImg2.png" alt="" class="ruleImg2">
        <img src="../../assets/img/ruleImg3.png" alt="" class="ruleImg3">
        <p class="ps">ملاحظة: سيتم تسوية مكافآت الأسبوع / الشهر الأخير في بداية كل أسبوع / شهر، سوف يتواصل العامل الرسمي مع صاحب الغرفة لإعطاء المكافآت له.</p>
      </div>
      <h6>التفسير للمتفرجين في الحفلة:</h6>
      <div class="tipsBox">
        <p>1. متابعة النشاطين الاثنين في قائمة الحفلات كل يوم، يمكن الحصول على 30 فول، إلغاء المتابعة غير فعال ، يمكن الحصول لحساب واحد فقط.</p>
        <p>2. المستخدم يبقى في أي غرفة النشاط لمدة 10 دقيقة يمكن الحصول على 30 فول، يمكن الحصول لكل المستخدم في كل النشاط مرة واحدة فقط.</p>
        <p>3. انقر"متابعة" لتتابع النشاط سوف تتلقى تذكير الرسالة قبل خمس دقائق بداية الحفلة، لن فاتتك الحفلة الرائعة!</p>
        <p>4. تشارك النشاط و يكون المتابعة أكثر سوف يجذب الأشخاص الأكثر لمشاركة في الحفلة.</p>
        <p>5. تفاصيل محتويات النشاط تحدد بالمنظم، جوائز النشاط سوف يعطي بمنظم النشاط يعني الشخص الذي قدم الطلب لإقامة النشاط (اذا كان النشاط لديه جوائز)، لا علاقة لsuper voice، اذا كان هناك يوجد أي سؤال عن النشاط يمكن التواصل مع منظم النشاط.</p>
        <p>6. وقت النشاط لكل نشاط في قائمة الحفلات هو الوقت في منطقتك~ لا تنس النشاط~</p>
      </div>
      <h6>قواعد إعادة العملة الذهبية للاستهلاك</h6>
      <p>1. اذا كان مبلغ العملة الذهبية الإجمالي للاستهلاك يصل إلى 40000 عملة ذهبية في هذه الغرفة أثناء النشاط الواحد(يعني 400000 قيمة السحر بالعملة الذهبية)، يمكن تقدم بالطلب لإعادة %10 عملة ذهبية.<br />غرفة الكاريوكي لتقدم بالطلب لإعادة عملة ذهبية، يرجي التوصل مع أمين: 1000(UID)<br />غرفة الدردسة لتقدم بالطلب لإعادة عملة ذهبية، يرجي التوصل مع يوسف: 5808556(UID)</p>
    </div>
    <div v-else>
      <h6>التفسير للمتفرجين في الحفلة:</h6>
      <div class="tipsBox">
        <p>1. متابعة النشاطين الاثنين في قائمة الحفلات كل يوم، يمكن الحصول على 30 فول، إلغاء المتابعة غير فعال ، يمكن الحصول لحساب واحد فقط.</p>
        <p>2. المستخدم يبقى في أي غرفة النشاط لمدة 10 دقيقة يمكن الحصول على 30 فول، يمكن الحصول لكل المستخدم في كل النشاط مرة واحدة فقط.</p>
        <p>3. انقر"متابعة" لتتابع النشاط سوف تتلقى تذكير الرسالة قبل خمس دقائق بداية الحفلة، لن فاتتك الحفلة الرائعة!</p>
        <p>4. تشارك النشاط و يكون المتابعة أكثر سوف يجذب الأشخاص الأكثر لمشاركة في الحفلة.</p>
        <p>5. تفاصيل محتويات النشاط تحدد بالمنظم، جوائز النشاط سوف يعطي بمنظم النشاط يعني الشخص الذي قدم الطلب لإقامة النشاط (اذا كان النشاط لديه جوائز)، لا علاقة لsuper voice، اذا كان هناك يوجد أي سؤال عن النشاط يمكن التواصل مع منظم النشاط.</p>
        <p>6. وقت النشاط لكل نشاط في قائمة الحفلات هو الوقت في منطقتك~ لا تنس النشاط~</p>
      </div>
    </div>
    <p class="lastTips">التفسير النهائي لنشاط الحفلات الرائعة للغرف ينتمي إلى المنظم</p>
  </div>
</template>
<script>
import getString from "../../utils/getString"
export default {
  data() {
    return {
      is_admin: false
    }

  },
  created() {
    this.is_admin = getString('is_admin')
  }
}
</script>
<style lang="scss">
@import "../../assets/scss/common.scss";
body {
  background: rgba(65, 23, 122, 1);
  direction: rtl;
  .actRules {
    padding: 0.5rem 0.58rem 0.2rem 0.33rem;
  }
  .tipsBox {
    padding-left: 0.28rem;
    margin-bottom: 0.3rem;
  }
  h6 {
    color: rgba(191, 255, 254, 1);
    font-weight: 600;
    font-size: 0.26rem;
    margin-bottom: 0.25rem;
  }
  p {
    font-size: 0.24rem;
    color: rgba(191, 255, 254, 1);
  }
  .ps {
    font-size: 0.24rem;
    color: rgba(191, 255, 254, 1);
    margin: 0.24rem 0 0.48rem;
  }
  .ruleImg1 {
    width: 6.21rem;
    height: 4.98rem;
    margin-top: 0.32rem;
  }
  .ruleImg2 {
    width: 6.21rem;
    height: 3.58rem;
    margin-top: 0.32rem;
  }
  .ruleImg3 {
    width: 6.21rem;
    height: 3.58rem;
    margin-top: 0.32rem;
  }
  .lastTips {
    color: rgba(168, 132, 216, 1);
    font-size: 0.24rem;
    margin: 0.66rem auto 0;
    text-align: center;
  }
}
</style>
