export default {
    //html/index.html
    title: "लकी टर्नटेबल",
    loading: "लोड हो रहा है...",
    no_data: "डेटा नहीं है",
    end_data: "डेटा लोड किया गया है",
    draw1:'1 बार',
    draw10: '10 बार',
    
    record_title: '7 दिन रिकॉर्ड',
    rank_title: 'दैनिक रैंकिंग',
    
    balance_tips: 'बैलेंस काफी नहीं<br />खरीद नहीं कर सकता',
    go_value: 'रिचार्ज करें',
    
    awards_title: 'बधाई हो!',
    ok:'ठीक है',
    
    rule_title:'नियम',
    rule: [
        'कुछ कॉइन खर्च करके लकी टर्नटेबल खेल सकते हैं, प्राप्ति इनाम आपके खाते में दिया जाएगा!',
        'प्रॉप्स के 30 मान्य दिन हैं, कई बार समान प्रॉप्स पाने से जिसका मान्य दिन जोड़ दिया जाएगा!',
        'उपहार के 15 मान्य दिन हैं, समय ख़त्म होने के बाद बैग से हटा दिया जाएगा!',
        'हम इस फंक्शन के लिए अंतिम व्याख्या का अधिकार सुरक्षित रखते हैं।',
    ],

    //html/app_share.ejs
    share_title: 'लकी टर्नटेबल',
    share_desc: '',
}