const vietnamLang = {
    integral: "نقاط اليوم:",
    todayp: 'يمكن الاستلام بعد وصول نقاط اليوم إلى X',
    todayGift: [
        {
            num: "70",
            msg: 'تسجيل لأيام أكثر، وفول الجائزة أكثر. كمية الفول كالجائزة=100+10*عدد الأيام المتتالية لتسجيل </br>مثلا:الوصول 1 يوم استمرارا، 110 فول لجائزة، الوصول 2 يومين استمرارا، 120 فول لجائزة،.....، الوصول 8 أيام استمرارا، 180 فول لجائزة '
        },
        {
            num: "90",
            msg: 'قد تكون الجائزة:هدية ندفة الثلج لعيد الميلاد(2 عملات)*1، أو سيارة الدراجة(ثلاثة أيام)، أو سيارة الدراجة النارية(ثلاثة أيام)'
        },
        {
            num: "130",
            msg: 'هدية واحدة من مجموعة هدايا عيد الميلاد(10 عملة)، كيمة هدايا عيد الميلاد هي 8، لا تتكرر كل يوم، لا تفوتك'
        },
        {
            num: "150",
            msg: 'هدية عشوائية من ثلاث هدايا سابقة نلتها اليوم*2</br>مثلا: إذا نلت ثلاث هدايا سابقة هي 150 فول وهدية ندفة الثلج لعيد الميلاد(2 عملات)*1 وهدية جورب عيد الميلاد(10 عملة)*1، فمن الممكن أن تحصل على 300 فول أو هدية ندفة الثلج لعيد الميلاد(2 عملات)*2 أو هدية جورب عيد الميلاد(10 عملة)*2'
        },
    ]
}
export default vietnamLang