<template>
  <div class="wards">
    <p class="activeTime">活動時間:4月1日18:00:00-4月10日20:00:00</p>
    <h5>作品爭霸榜前10名獎勵</h5>
    <div class="wardTop">
      <h5>第一名:</h5>
      <p>禮物王者徽章（31天）+30000貴族富豪值（價值30000金幣）+1個月VIP+浪漫飛艇座駕（30天）+限量超跑作品背包禮物（1888金幣）+3000金幣+3000金豆</p>
      <h5>第二名:</h5>
      <p>禮物王者徽章（31天）+1個月VIP+浪漫飛艇座駕（30天）+限量超跑作品背包禮物（1888金幣）+2000金幣+2000金豆</p>
      <h5>第三名:</h5>
      <p>禮物王者徽章（31天）+1個月VIP+浪漫飛艇座駕（30天）+限量超跑作品背包禮物（1888金幣）+1500金幣+1500金豆</p>
      <h5>第四名-第五名:</h5>
      <p>禮物王者徽章（31天）+浪漫飛艇座駕（30天）+限量超跑背包禮物*1+1000金幣+1000金豆</p>
      <h5>第六名-第十名:</h5>
      <p>浪漫飛艇座駕（30天）+限量超跑背包禮物*1+800金幣+800金豆</p>
    </div>
    <h5>K房爭霸榜前10名獎勵</h5>
    <div class="kRoomTop">
      <h5>第一名:</h5>
      <p>禮物王者徽章（31天）+30000貴族富豪值（價值30000金幣）+1個月VIP+浪漫飛艇座駕（30天）+限量超跑作品背包禮物（1888金幣）+3000金幣+3000金豆</p>
      <h5>第二名:</h5>
      <p>禮物王者徽章（31天）+1個月VIP+浪漫飛艇座駕（30天）+限量超跑作品背包禮物（1888金幣）+2000金幣+2000金豆</p>
      <h5>第三名:</h5>
      <p>禮物王者徽章（31天）+1個月VIP+浪漫飛艇座駕（30天）+限量超跑作品背包禮物（1888金幣）+1500金幣+1500金豆</p>
      <h5>第四名-第五名:</h5>
      <p>禮物王者徽章（31天）+浪漫飛艇座駕（30天）+限量超跑背包禮物*1+1000金幣+1000金豆</p>
      <h5>第六名-第十名:</h5>
      <p>浪漫飛艇座駕（30天）+限量超跑背包禮物*1+800金幣+800金豆</p>
    </div>
    <h5>人氣爭霸榜前10名獎勵</h5>
    <div class="peopleTop">
      <h5>第一名:</h5>
      <p>人氣王者徽章（31天）+1個月VIP+名牌包包背包禮物（599金幣）*1+1500金幣+1500金豆</p>
      <h5>第二名:</h5>
      <p>人氣王者徽章（31天）+1個月VIP+名牌包包背包禮物（599金幣）*1+1000金幣+1000金豆</p>
      <h5>第三名:</h5>
      <p>人氣王者徽章（31天）+1個月VIP+名牌包包背包禮物（599金幣）*1+800金幣+800金豆</p>
      <h5>第四名-第五名:</h5>
      <p>人氣王者徽章（31天）+1個月VIP+名牌包包背包禮物（599金幣）*1+600金幣+600金豆</p>
      <h5>第六名-第十名:</h5>
      <p>1個月VIP+荷花綻放背包禮物（199金幣）*1+300金幣+600金豆</p>
    </div>

    <h5>金幣返還獎勵</h5>
    <div class="fanhuan">
      <p>1、向報名活動後發佈的公開作品贈送可愛水瓶（10金幣）、搖搖木馬（99金幣）、迷你超跑（299金幣），次日凌晨返禮物金幣數的5%金幣。如當天贈送1個價值299金幣的迷你超跑禮物，則在次日凌晨獎勵15金幣</p>
      <p>2、向報名活動後在K房上麥的用戶贈送小黃鴨（10金幣）、歡樂水槍（99金幣）、快樂小火車（299金幣）禮物，次日凌晨返禮物金幣數的5%金幣。如當天贈送1個價值299金幣的快樂小火車禮物，則在次日凌晨獎勵15金幣</p>
    </div>

    <h5>獎勵說明</h5>
    <div class="tips">
      <p>1、該活動獲得的背包禮物獎勵，有效期均為14天。安卓版本可在我-背包中查看，而且送禮時，選擇背包禮物送出。IOS可前往app store 搜尋最新版本“高歌”，下載使用</p>
    </div>

    <p class="btnMsg">本活動的最終解釋權歸活動主辦方所有</p>
  </div>
</template>

<script>
export default {

}
</script>

<style lang="scss" scoped>
.wards {
  .activeTime {
    text-align: center;
    font-weight: 0.24rem;
    font-weight: 600;
    margin-top: 0.38rem;
    color: #fff;
  }

  > h5 {
    text-align: center;
    color: #fffea4;
    margin: 0.46rem auto 0.18rem;
    font-weight: 600;
    width: 5.9rem;
  }
  .wardTop {
    > h5 {
      color: #88ffdc;
      font-size: 0.21rem;
      margin-top: 0.2rem;
      font-weight: 600;
    }
  }
  .kRoomTop {
    > h5 {
      color: #88ffdc;
      font-size: 0.21rem;
      margin-top: 0.2rem;
      font-weight: 600;
    }
  }
  .fanhuan,
  .tips {
    p {
      margin-top: 0.22rem;
    }
  }
  .peopleTop {
    > h5 {
      color: #88ffdc;
      font-size: 0.21rem;
      margin-top: 0.2rem;
      font-weight: 600;
    }
  }
  p {
    color: #88ffdc;
    font-weight: 600;
    font-size: 0.22rem;
    line-height: 0.36rem;
  }

  .btnMsg {
    margin-top: 1.2rem;
    text-align: center;
    font-size: 0.24rem;
    font-weight: 600;
    color: #ccbaff;
  }
}
</style>
