const giftArr = [
    {
        name: 'تاج علاء الدين        '
    },
    {
        name: 'سيف سحري        '
    },
    {
        name: 'جان المصباح السحري        '
    },
    {
        name: 'سجادة طائرة        '
    },
    {
        name: 'بوق سحري        '
    },
    {
        name: 'خاتم سحري        '
    },
    {
        name: 'الماء السحري        '
    },
    {
        name: 'شوكولاتة        '
    },
    {
        name: 'ثروة كبيرة        '
    },
    {
        name: 'أيس كريم        '
    },
    {
        name: 'حصان اللهب        '
    },
    {
        name: 'دلفين سعيد        '
    },
    {
        name: 'دراجة بموتور        '
    },
    {
        name: 'قهوة        '
    },
    {
        name: 'الإضاءة لك        '
    },
    {
        name: 'حصان محظوظ        '
    },
]
export default giftArr